{"html":"<h1 id=\"-1-google-docs\">إلى السّحابة (1) - Google Docs</h1>\n<p><em>هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.</em></p>\n<p>كثيرون يستخدمون مجموعة برامج Microsoft Office التّي تتضمّن Word وPowerPoint وExcel. الحقيقة أنّني لا أفضّل استخدام هذه المجموعة لعدّة أسباب:</p>\n<ol>\n<li>ليست مجّانيّة، ولا تعمل على كلّ الأجهزة.</li>\n<li>معقّدة وفيها خصائص لا أحتاجها.</li>\n<li>وقت تثبيتها طويل، وحجم التّثبيت كبير.</li>\n</ol>\n<p>الحلّ البديل الّذي أستخدمه هو Google Docs، وهي مجموعة تطبيقات ويب (Web apps) تتضمّن محرّر مستندات وعروض تقديميّة وجداول ومخطّطات ورسوم. المجموعة مجّانيّة بالكامل ويكفي لكي تبدأ باستخدامها أن يكون لديك عنوان بريد إلكترونيّ Gmail.  </p>\n<p>من أهمّ مزايا هذه المجموعة:</p>\n<ol>\n<li>سهلة الاستخدام وبسيطة لا تحوي خصائص معقّدة.</li>\n<li>متوافقة مع ملفّات Microsoft Office: فقط ارفع الملفّ!</li>\n<li>يمكن تصدير الملفّات إلى عدّة لواحق منها لواحق Microsoft Office وطباعتها.</li>\n<li>مدقّق إملائيّ عربيّ وإنكليزيّ وغيرهما.</li>\n<li>ميزة ترجمة المستند في ثوانٍ إلى أي لغة تدعمها ترجمة Google.</li>\n<li>إضافة الصّور والرّوابط تمامًا كما في Microsoft Office.</li>\n<li>الملفّات لا تخزّن على جهازك، بل تخزّن على أجهزة Google. هذا يعني إمكانيّة الوصول إليها من أيّ مكان فيه وصول للإنترنت!</li>\n<li>يمكن رفع ملفّات Photoshop وأنواع أخرى من الملفّات لقرائتها (التّعديل غير متاح)</li>\n<li>إذا كنت تستخدم متصفّح Chrome فبإمكانك تفعيل ميزة Offline الّتي تسمح لك بقراءة مستنداتك عند انقطاع الإنترنت.</li>\n<li>يمكن الوصول للمستندات وقراءتها من هاتفك الذّكيّ.</li>\n</ol>\n<p>من عيوبها:</p>\n<p>تحتاج إلى اتّصال بالإنترنت لإنشاء وتعديل المستندات.</p>\n<p>كيف أستخدمها؟</p>\n<p>فقط توجّه إلى <a href=\"http://docs.google.com/\">http://docs.google.com</a>. أدخل عنوان بريدك الإلكترونيّ Gmail وكلمة المرور الموافقة (إن لم يكن لديك، فأنشئ حسابًا جديدًا). بعدها ستشاهد قائمة بمستنداتك (قد تكون فارغة)، وستشاهد أيضًا زرّي &quot;إنشاء&quot; و&quot;رفع&quot;، الأوّل لإنشاء مستند جديد، والآخر لرفع مستند من جهازك وبدء التّعديل عليه أو قراءته من خلال Google Docs.</p>\n","title":"إلى السّحابة (1) - Google Docs","filename":"1-google-docs.json","id":"1-google-docs","date":"2011-09-10T00:00:00.000Z","image":null,"description":"هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.","images":0,"videos":0,"tracks":0,"links":1,"type":"text"}