{"html":"<h1 id=\"-2-dropbox\">إلى السّحابة (2) - Dropbox</h1>\n<p><em>هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.</em><br>هل تملك عدّة حواسيب؟ هل تضطر للاحتفاظ بنسخ متطابقة من بعض الملفّات على جهازين أو أكثر؟ هل تنقلها يدويًّا باستخدام ذاكرة Flash؟ يبدو أنّك تعيش في العصر الحجريّ!<br>لديك حلّان لهذه المشكلة:  </p>\n<ul>\n<li>إمّا أن تربط الأجهزة باستخدام الشّبكة (مثل ميزة Homegroup في Windows) بحيث تحدّد الملفّات الّتي تريد مشاركتها مع بقيّة الأجهزة في بيتك. وهكذا يمكنك الوصول لملفّات جهاز من جهاز آخر. هذه الطّريقة تتطلّب ربط الأجهزة عبر الشّبكة سلكيًّا او لاسكليًّا ولا تحتاج إلى اتّصال بالإنترنت.</li>\n<li>الطّريقة الثّانية الّتي أريد الحديث عنها هي استخدام خدمات مثل Dropbox. هذه الطّريقة تتطلّب اتّصالاً سريعًا بالإنترنت ولكن لا داعي لربط الأجهزة عبر الشّبكة المنزليّة.ما Dropbox؟  </li>\n</ul>\n<p>سأحاول أن أشرح الخدمة ببساطة:</p>\n<ul>\n<li>لديك عدّة أجهزة تعمل بأنظمة تشغيل مختلفة (ومنها هاتف محمول مثلاً) أو متماثلة في بيتك وفي عملك و حتّى في بلد آخر.</li>\n<li>يفضّل تثبيت برنامج Dropbox. مهمّة البرنامج هي إنشاء مجلّد تجده في المستندات أو مجلّد المستخدم. هذا المجلّد تضع فيه الملفّات الّتي تريد مشاركتها مع بقيّة أجهزتك (حتّى مع الهاتف المحمول). قد تكون هذه الملفّات مستندات Word أو ملفّات تثبيت أو صور أو من أيّ نوع آخر.</li>\n<li>عندما تضع هذه الملفّات في المجلّد سيقوم البرنامج برفعها إلى أجهزة شركة Dropbox تلقائيًّا.</li>\n<li>عند انتهاء الرّفع، سيقوم البرنامج بتحميل الملفّات إلى بقيّة الأجهزة بحيث يمكنك الوصول إليها من أيّ جهاز مرتبط. لاحظ أنّه يجب عليك أن تثبّت البرنامج على كلّ أجهزتك.</li>\n<li>معنى هذا أنّه كلّ ما عليك فعله هو إضافة ملفّ إلى مجلّد Dropbox من أي جهاز ليمكنك بعدها مشاهدة هذا الملفّ من بقيّة الأجهزة المرتبطة.</li>\n<li>يمكنك أيضًا أن تشارك ملفّات مع أصدقائك أو مع العالم كلّه بسهولة.Dropbox تعطيك مساحة 2GB مبدئيًّا وبالمجّان، إن أردت المزيد من المساحة فعليك دعوة أصدقائك أو شراء مساحة إضافيّة. الأسعار رخيصة.  </li>\n</ul>\n<p>كيف أستخدمها؟</p>\n<p>اذهب إلى الموقع: <a href=\"http://www.dropbox.com/\">http://www.dropbox.com</a></p>\n<ul>\n<li>إن لم تشا تثبيت البرنامج على كلّ أجهزتك فيمكنك تحميل ورفع الملفّات <a href=\"http://www.dropbox.com/\">عبر الموقع</a> مباشرة. أنشئ حسابًا جديدًا إن لم يكن لديك.</li>\n<li>إن اردت تثبيت البرنامج الّذي يضيف مجلّدًا في المستندات أو في مجلّد المستخدم فلا داعي لإنشاء الحساب الآن، يمكنك إنشاؤه لاحقًا. فقط حمّل البرنامج ثمّ ثبّته. يشرح لك البرنامج كيفيّة العمل، وهي سهلة للغاية.تذكّر: هناك نسخ من البرنامج للهواتف الذّكيّة، وفي حال لم واجهت مشاكل مع البرنامج، فيمكنك دائمًا استخدام الموقع (واجهة Web) كبديل.</li>\n</ul>\n","title":"إلى السّحابة (2) - Dropbox","filename":"2-dropbox.json","id":"2-dropbox","date":"2011-09-15T00:00:00.000Z","image":null,"description":"هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.هل تملك عدّة حواسيب؟ هل تضطر للاحتفاظ بنسخ متطابقة من بعض الملفّات على جهازين أو أكثر؟ هل تنقلها يدويًّا باستخدام ذاكرة Flash؟ يبدو أنّك تعيش في العصر الحجريّ!لديك حلّان لهذه المشكلة:","images":0,"videos":0,"tracks":0,"links":2,"type":"text"}