{"html":"<h1 id=\"-2-\">ترتيب الكمبيوتر المفضل لدي (2)</h1>\n<p>بعد <a href=\"http://forabi.blogspot.co.uk/2013/02/gnome-3.html\">التدوينة السابقة</a>، أصبح لا بدّ من إدخال بعض التعديلات على <a href=\"http://forabi.blogspot.co.uk/2012/10/my-pc-setup.html\">ترتيب الكمبيوتر المفضل لديّ</a> والذي كان في السابق يعتمد على Windows وبرامجه.</p>\n<ul>\n<li>نظام التشغيل: Linux Mint 14 Cinnamon نسخة 64 بت مع الاستغناء عن الواجهة الأساسية Cinnamon واستخدام GNOME Shell (أفكر في الانتقال إلى Ubuntu Gnome Remix المؤسسة على Ubuntu ولكنها تستخدم GNOME 3 كواجهة افتراضيّة)</li>\n<li>Dropbox فقط: لا يتوفر إصدار من SkyDrive ولا Google Drive ولا Box على توزيعات لينكس، ويبدو لي إلى الآن أنني لن أحتاج سوى Dropbox؛ على الرغم من أنني أمتلك 50 غيغابايت مدى الحياة على Box لأنني أستخدم هاتف من Sony.</li>\n<li>المتصفح: Chrome وFirefox (لا جديد هنا)</li>\n<li>لا مضاد فيروسات</li>\n<li>ScreenCloud لالتقاط صور للشاشة الذي يعمل بطريقة مشابهة جدًّا لبرنامج LightScreen لكن بخيارات أوسع</li>\n<li>مستعرض/محرر الصور: المستعرض الافتراضي في Mint وShotwell للتعديلات البسيطة.</li>\n<li>التحرير الموسّع للصور: Pinta هو برنامج مستوحى من برنامج Paint.NET على Windows ويمتلك واجهة وخيارات مماثلة للأخير تقريبًا. وإذا لزم الأمر لتحرير أوسع فـGIMP موجود.</li>\n<li>برنامج الأرشفة: يأتي Mint مع دعم لضغط الملفات بعدة صيغ، تحتاج فقط لتثبيت إضافة RAR إن لم تكن موجودة وذلك لتتمكن من فك الملفات المضغوطة بهذه الصيغة، وإضافة 7z لتتمكن من ضغط الملفات وفكها بهذه الصيغة. الجميل في توزيعات Linux أنها تستعمل برنامجًا موحّدًا لكل الصّيغ.</li>\n<li>مشغل الصوت والفيديو: المشغل الافتراضي في GNOME والذي يتمتع بواجهة بسيطة ودعم لمعظم الأنواع بعد تثبيت codecs المناسبة، وكذلك VLC.</li>\n<li>قارئ PDF: برنامج Evince القارئ الافتراضي في Mint سريع ويتذكر موضع القراءة ولكن ينقصه ميزة إضافة الملاحظات والتظليل، Okular قارئ KDE الافتراضي يتمتع بهذه الميزة لكنّ هذه التعديلات لا تحفظ إلى الملف، بمعنى أنه بمجرد تغيير موقع الملف فإنك ستفقد كل الملاحظات والتظليلات. Adobe Reader يمكن تثبيه عن طريق Wine في حال واجهت مشاكل في توافق بعض الملفات.</li>\n<li>القاموس: StarDic وGoldenDict (الأخير لا يعمل لسبب ما!)</li>\n<li>محرر النصوص: Gedit المحرر الافتراضي في Gnome والذي يمكن توسيع إمكاناته بعدد كبير من الإضافات (لتحرير النصوص البرمجية أو غير المنسقة، كمفكرة Windows)، وAbiWord الذي يشبه Word لكنه أقل خيارات منه، وكذلك LibreOffice Writer الذي أعتبره كافيًا ومنافسًا لـWord بالنسبة لحاجاتي.</li>\n<li>بديل CCleaner هو BleachBit والذي يعمل بطريقة مشابهة جدًّا.</li>\n</ul>\n","title":"ترتيب الكمبيوتر المفضل لدي (2)","filename":"2.json","id":"2","date":"2013-02-24T00:00:00.000Z","image":null,"description":"بعد التدوينة السابقة، أصبح لا بدّ من إدخال بعض التعديلات على ترتيب الكمبيوتر المفضل لديّ والذي كان في السابق يعتمد على Windows وبرامجه.","images":0,"videos":0,"tracks":0,"links":2,"type":"text"}احظ أنّه يسأل نفسه كثيرًا.<br>يتنفّس الصّعداء عندما يسمع المشرف يقول &quot;انتهينا&quot;، هذه هي كلمة السّرّ، الّتي إن سمعها شعر بشيء من الارتياح.<br>بعدها يدخل مختبر النُّسج، المشرفة تُعيد ما تعلّمه في السّنة الماضية، هذا يعني أنّه يخسر ساعتين إضافيّتين من حياته في إعادة ما يعرفه.<br>&quot;انتهينا&quot; مرّة ثانية، يُسرع في الخروج، يخسر نصف ساعة من وقته إلى أن تبدأ الجلسة التّالية، بعدها يستمع إلى المشرف يتّحدّث عن الدّم ومكوّناته، الكريّات الحمراء والكريّات البيضاء وغيرها... هذا سُخف، لن يضيع وقته في سماعه، لكن لا مفرّ!<br>&quot;انتهينا&quot; مرّة ثالثة.<br>يحمد الله ويعود للبيت، ويخسر 5 ساعات من حياته نائمًا. لكنّه يسأل نفسه لآخر مرّة: هل يستحقّ ما تعلّمه اليوم أن يخسر من وقته ما خسره في هذا اليوم؟</p>\n","title":"حياة طالب جامعيّ (2) - فلسفة","filename":"2.json","id":"2","date":"2011-10-13T00:00:00.000Z","image":null,"description":"أمضى آخر أسبوع ينام باكرًا ويستيقظ في الصّباح، في محاولة منه للتّكيّف مع دوام الجامعة؛ لكنّه قرّر أن يسهر في أوّل يوم من العام الجامعيّ، لا يعرف السّبب... ربّما تحتاج ساعته البيولوجيّة لإصلاح!تعوّد أن لا دوام في أوّل أسبوعين من العام، هذا عرفٌ اتّفق عليه الطّلاب منذ فجر البشريّة، منذ بداية التّدريس بالأحرى. الطّلّاب هم من يحدّدون الدّوام: إن لم يحضر أحد، فلا دوام... فلماذا يحضرون؟! هذه غريزة حبّ الدّوام، يومًا ما سيعدّ بحثًا حول هذا الموضوع.أمضى أسبوعين في البيت يأكل وينام ويكتب ويقرأ كلّ شيء. ولأنّه متميّز ولأنّ وقته ثمين، فليس من المعقول أن يبدأ الدّوام من بداية الأسبوع الثّالث، سينتظر حتّى يقرّر الطّلاب أنّهم بدؤوا ثمّ يبدأ؛ وهكذا يعطي لنفسه يومين إضافيّين من الرّاحة.في اليوم الثّالث من الأسبوع، سيبدأ دوامه. لم ينم في اللّيل لأنّه يدرك أنّه إن نام سيفوته الدّوام. هكذا يمضي اللّيل يقرأ حتّى يأتيَ الصّباح فيغيّر ثيابه وينطلق. اتّفق مع صديقيه أن يذهبوا معًا.كلّما رأى صديقه تساءل كيف أصبحا صديقين؟ هذا يحبّ الدّراسة ويودّ لو أنّ الدّوام يبدأ في السّاعة السّادسة صباحًا، أمّا هو فيكره الدّوام والجامعة وكلّ شيء ويتمنّى لو اختفت الكلّيّة أو سافر عبر الزّمن لينهي دراسته أو -في أحسن الأحوال- حياته.يقول لنفسه في الطّريق: لا بأس، سيكون يومًا قصيرًا.يصل مع صديقيه إلى باب الكلّيّة ويشعر أنّه يدخل مقبرة، الجو هنا يشبه المقابر باستثناء أنّهم يتكلّفون الحياة كي لا يظهروا كالموتى. شعور بالخوف والانقباض وفراغ وصمت، أشجار ومقاعد قديمة... لو زرتها ليلاً لقلت إنّها مقبرة.عزاؤه الوحيد في هذه المقبرة أن يرى أصدقاء المدرسة وقد أصبحوا معه، لكنّه يحزن لأنّهم تخلّفوا عنه بعام كامل.يسأل نفسه: هل الحجاب هو قطعة من قماش توضع على الرّأس لكي يُقال عمّن تضعها أنّها محجّبة؟ أصبح الحجاب (بهذا التّعريف) شيئًا والاحتشام شيء آخر، الأوّل فرض والثّاني مكروه على ما يبدو.يمضي إلى المختبر وهو يعرف أنّ عليه أن يتنازل عن ربع ساعة من حياته في كلّ مرّة ينتظر فيها قدوم المشرف. يتساءل: هل هذا طبيعيّ؟ هل تأخّر كلّ مشرف ربع ساعة من الأمور الطّبيعيّة؟ هل خُلقَ الإنسان يتأخّر عن مواعيده؟ ما الفائدة إذًا من تحديد الموعد قبل ربع ساعة من الحضور؟المشرف يشرح خطوط الإنهاء وزوايا التّحضير وأنواع الإكريل والسّنابل الماسّية والشّرائط المُسندة؛ هذا جميل ومفهوم... يقول لنفسه، لكنّ سؤالاً يلحّ في ذهنه: ما الفائدة من معرفة هذه الأمور؟ عندها يتذكّر أنّه سيصبح طبيب أسنان، وأنّ طبيب الأسنان يعالج أسنان النّاس، وعلاج أسنانهم يسمح لهم بمتابعة أعمالهم لكي يعمّروا الأرض إلى أن يموتوا ويُحاسبوا. اقتنع بهذا الجواب.لاحظ أنّه يسأل نفسه كثيرًا.يتنفّس الصّعداء عندما يسمع المشرف يقول \"انتهينا\"، هذه هي كلمة السّرّ، الّتي إن سمعها شعر بشيء من الارتياح.بعدها يدخل مختبر النُّسج، المشرفة تُعيد ما تعلّمه في السّنة الماضية، هذا يعني أنّه يخسر ساعتين إضافيّتين من حياته في إعادة ما يعرفه.\"انتهينا\" مرّة ثانية، يُسرع في الخروج، يخسر نصف ساعة من وقته إلى أن تبدأ الجلسة التّالية، بعدها يستمع إلى المشرف يتّحدّث عن الدّم ومكوّناته، الكريّات الحمراء والكريّات البيضاء وغيرها... هذا سُخف، لن يضيع وقته في سماعه، لكن لا مفرّ!\"انتهينا\" مرّة ثالثة.يحمد الله ويعود للبيت، ويخسر 5 ساعات من حياته نائمًا. لكنّه يسأل نفسه لآخر مرّة: هل يستحقّ ما تعلّمه اليوم أن يخسر من وقته ما خسره في هذا اليوم؟","images":0,"videos":0,"tracks":0,"links":0,"type":"text"}