{"html":"<h1 id=\"-play-\">طرق لتجاوز حظر سوق Play في سوريا (للمبتدئين)</h1>\n<p>مستخدمو Android في سوريا يعانون من صعوبة العثور على تطبيقات ذات جودة عالية وبسهولة، وغالبًا ما يلجأون إلى استخدام متاجر بديلة مثل <a href=\"http://1mobile.com/\">1Mobile</a> و<a href=\"http://getjar.com/\">GetJar</a>، ولكن هذه التطبيقات تحتوي برامج من نوعية رديئة جنبًا إلى جنب مع البرامج العالية الجودة وقد تحمل نسخًا غير متوافقة مع الجهاز الذي تستخدمه. بكل الأحوال تبقى هذه المتاجر خيارًا جيًّدا لتحميل التطبيقات الشهيرة وبسرعة دون الحاجة إلى طرق معقدة. لكنني هنا سأشرح طريقة الوصول لأي تطبيق متوافق مع جهازك وتحميله مباشرة من سوق Play الرسمي، هكذا تضمن أنك ستحصل على أحدث الإصدارات من البرامج المتوافقة مع جهازك.</p>\n<p><strong>تحذير: لست مسؤولاً عن أي خلل فيزيائي أو برمجي يطرأ على جهازك نتيجة اتباع هذه الخطوات.**</strong>إذا لم تعرض الصور في هذه الصفحة (غالبًا تكون محجوبة)، استخدم برنامجًا لتجاوز الحجب.<strong>  \n</strong>هذه الطرق للمبتدئين، والمقصود أنني قمت بشرح كل الخطوات بالتفصيل الممل وأتوقع من المبتدئين الالتزام بها بحذافيرها، أما المستخدمون الأكثر خبرة فبإمكانهم تجاوز أو تغيير بعض الخطوات، أو استخدام طرق أخرى. **  </p>\n<p><strong>هذه ليست الطرق الوحيدة المتاحة للوصول إلى سوق Play، ربما توجد طرق أسرع وأفضل، لكنني أقدم لك الطرق التي تصلح لمعظم الأجهزة وتكون مضمونة دومًا ومتاحة في المستقبل على عكس بعض الطرق التي تمنح المستخدمين وصولاً مؤقتًا.</strong>  </p>\n<h3 id=\"-\">الطريقة الأولى: التحميل من الهاتف/اللوحي مباشرة</h3>\n<p><strong>ما تحتاجه (لا يهم الترتيب الذي تنفذ فيه، المهم أن تكون جميعها متوفرة في جهازك في النهاية):</strong></p>\n<ul>\n<li><strong>جهاز حديث بصلاحيات root:</strong> لن أشرح في هذه التدوينة كيفية فعل هذا، فهناك على الويب عشرات المقالات بالعربية التي تشرح لك كيف تحصل على صلاحيات root خطوةً بخطوة، كذلك تختلف الطرق من جهاز لآخر وإن تشابهت. ربما أفرد تدوينة مستقلة لاحقًا، لكن إن كنت تستطيع الحصول على صلاحيات root في جهازك، فهذه الطريقة مناسبة لك؛ أو انتقل إلى <a href=\"http://ardroid.aitnews.com/2010/08/22/the-complete-guide-to-android-market/\">هذه المقالة الممتازة على أردرويد</a> إن أحببت <em>(المقالة قديمة وقد لا تعمل بشكل مباشر، حاول أن تستخدم برامج بديلة، بإمكانك أيضًا تفكيك الطرق في هذه المقالة مع الطرق في مقالة أردرويد وإعادة دمجها بما تسمح به خبرتك!)</em>. ذكرت أن الجهاز يجب أن يكون &quot;حديثًا&quot;، أي أنه يحمل النسخة 2.2 على الأقل من Android، قد تصلح الطريقة لنسخ أقدم لكنني غير متأكد من هذا.</li>\n<li><strong>البرامج: MarketEnabler وTransparent Proxy وOrbot</strong> (للتحميل <a href=\"https://www.dropbox.com/sh/tk20lr2g8t0zozs/5AX80gwP6i\">انقر هنا</a>، سأحاول تحديث الإصدارات من وقت لآخر، لكن في حال صدور نسخ أحدث من Orbot، جرب <a href=\"http://www.1mobile.com/search.php?keywords=orbot\">تحميلها من متجر 1Mobile</a>). ربّما لا تحتاج Transparent Proxy وهذا يحدده طبيعة جهازك (بعبارة أكثر دقة: دعم نواة جهازك لخاصية معينة)، لكن تثبيته لن يضر جهازك. أيضًا تستطيع استخدام برامج VPN أوSSH كبديل عن Orbot وTransparent Proxy معًا، لكن معظم هذه التطبيقات محدودة أو غير مجانية أو محجوبة في سوريا. أنصحك باستخدام Orbot مع Transparent Proxy في حال كان لديك اتصال سريع بالإنترنت لأن Orbot بطيء وقد تحتاج لتكرار محاولة تحميل التطبيق من السوق أكثر من مرة. MarketEnabler ضروري مهما كان جهازك.</li>\n<li><strong>حساب على Google للدخول إلى سوق Play</strong>، يفضل أن تنشئ حسابًا جديدًا غير مرتبط برقم هاتف سوري، ولا تقم بتعيين البلد إلى سوريا أثناء إنشاء الحساب، وإذا أمكن قم بانشائه باستخدام برنامج VPN أو SSH أو أي طريقة تسمح لك بإخفاء رقم IP السوري. لا أعرف بالضبط إن كانت هذه الخطوة بكل تفاصيلها ضرورية، لكنها مضمونة أكثر وهذا ما فعلته.</li>\n</ul>\n<p><strong>الكيفية:</strong></p>\n<ul>\n<li>تأكد أنك حصلت على صلاحيات root بالفعل، ابحث عن تطبيق Superuser أو SuperSU في قائمة التطبيقات على هاتفك، فإن لم تجده فهذا يعني أنك لم تنجح في الحصول على الصلاحيات (أو ربما حصلت عليها لكن التطبيق الذي يدير الصلاحيات لم يُثبّت على جهازك)، وإن وجدته فهذا يعني غالبًا أنك نجحت في ذلك.</li>\n<li>ثبت التطبيقات التي حملتها (من الفقرة الأولى) بأي ترتيب.</li>\n<li>شغل Orbot، ستشاهد أول مرة شاشة الإعداد، يمكنك تجاوزها (سيخبرك البرنامج أنه من الأفضل طلب صلاحيات root ليعمل كما يجب، لا توافق على هذا، لأننا سنستخدم Transparent Proxy ليؤدي الوظيفة نفسها التي سيؤديها Orbot عندما يحصل على صلاحيات root).</li>\n<li>ستشاهد شاشة Orbot الرئيسية الآن، اضغط مطوّلاً على الزر الكبير ذي اللون الرمادي، سيتحول إلى اللون الأصفر الذي يشير إلى أن التطبيق يحاول الاتصال الآن، عند نجاح الاتصال (الذي سيستغرق وقتًا أطول في المرة الأولى) سيتحول اللون إلى الأخضر.<img src='content/images/screenshot_2012-10-29_0017.png' title='null' text=''/></li>\n</ul>\n<p>Orbot قبل الاتصال</p>\n<p><img src='content/images/screenshot_2012-10-29_0018.png' title='null' text=''/></p>\n<p>Orbot يحاول الاتصال</p>\n<p><img src='content/images/screenshot_2012-10-29_0018_2.png' title='null' text=''/></p>\n<p>Orbot متصل</p>\n<ul>\n<li><p>الآن Orbot يعمل، لكن هذا لا يكفي، والسبب أنك بحاجة إلى تطبيق Transparent Proxy ليقوم بتحويل طلبات الاتصال بالإنترنت إلى Orbot الذي يقوم بتشفيرها وتعميتها وبالتالي يخفي هويتك عن سوق Play  (وجميع البرامج الأخرى) ويسمح بتجاوز الحجب.</p>\n</li>\n<li><p>انتقل إلى تطبيق Transparent Proxy دون الخروج من Orbot (أي اتركه يعمل في الخلفية ولا تختر Exit من القائمة، عندما يعمل Orbot في الخلفية تظهر في منطقة التنبيهات إشارة معلومات مرفقة بعبارة Connected to the Tor network).</p>\n</li>\n<li>الشاشة الرئيسية لتطبيق Transparent Proxy تحوي عدة مجموعات من الخيارات، نحتاج أولاً إلى ضبط إعداداته ليعمل مع Orbot.<img src='content/images/screenshot_2012-10-29_0020.png' title='null' text=''/></li>\n</ul>\n<p>الشاشة الرئيسية لتطبيق Transparent Proxy</p>\n<ul>\n<li>انقر على Proxy Type واختر HTTP</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_1.png' title='null' text=''/></p>\n<ul>\n<li>انقر على Proxy Host واكتب localhost (كلمة واحدة) ثم OK</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_5.png' title='null' text=''/></p>\n<ul>\n<li>انقر على Proxy Port واكتب 8118 ثم OK</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_4.png' title='null' text=''/></p>\n<ul>\n<li>فعل التطبيق بالنقر على Proxy في أول القائمة، عند تشغيله أول مرة ستظهر نافذة تخيرك إذا كنت تريد السماح للبرنامج بالوصول إلى صلاحيات root، ونحن نريد هذا بالطبع، لذا اختر Grant أو Allow للسماح له.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_6.png' title='null' text=''/></p>\n<ul>\n<li>الآن نحتاج أن نتأكد من أننا قمنا بالخطوات بشكل صحيح، اذهب إلى متصفح الويب واكتب العنوان <a href=\"https://check.torproject.org/\">https://check.torproject.org</a>، إذا شاهدت النص المكتوب بخط أخضر (Congratulations. Your browser is configured to use Tor.) فهذا يعني أننا انتهينا من إعداد Orbot وTransparent Proxy، وبقي أن ننتقل إلى MarketEnabler.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0021.png' title='null' text=''/></p>\n<p>الصفحة التي تشاهدها عندما تضبط Orbot مع Transparent Proxy بشكل صحيح</p>\n<ul>\n<li>أما إذا لم يتمكن المتصفح من تحميل الصفحة، أو ظهرت عبارة بخط أحمر (Sorry. You are not using Tor.)، فهذا يعني أنك ارتكبت خطأ ما عند اتباعك الخطوات، أو أن جهازك بوضعه الحالي غير قادر على تنفيذ هذه الخطوات.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0019.png' title='null' text=''/></p>\n<p>كيف تظهر الصفحة عندما لا يعمل Orbot مع Transparent Proxy كما يجب </p>\n<ul>\n<li>بعد نجاح الخطوات السابقة، انتقل إلى MarketEnabler، ثم انقر على تبويب (Settings list)، انقر مطولاً على أي عنصر في القائمة (أفضّل الأوّل)، ثم اختر fake this provider now. في المرة الأولى ستظهر نافذة مماثلة لتلك التي ظهرت عندما فعلت Transparent Proxy تسألك إذا كنت تريد السماح للبرنامج بالوصول إلى صلاحيات root. اختر Allow أو Grant؛ سيبدأ بعدها التطبيق بالعمل لبضع ثوانٍ ليخبرك في رسالة أنه تم ضبط الإعدادات بنجاح (Done and all set). <em>عند إعادة تشغيل الجهاز يفقد MarketEnabler إعداداته وستحتاج إلى تكرار هذه الخطوة في كل مرة تعيد فيها تشغيل الجهاز (وربّما تحتاج لإعادتها حتى دون إعادة تشغيل الجهاز في بعض الأحيان، لم أفهم آلية عمل التطبيق بشكل كامل)</em>.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0024_1.png' title='null' text=''/></p>\n<p>انقر على تبويب Settings list</p>\n<p><img src='content/images/screenshot_2012-10-29_0024_2.png' title='null' text=''/></p>\n<p>بعد النقر مطولاً على أول عنصر في القائمة، اختر fake this provider now</p>\n<p><img src='content/images/screenshot_2012-10-29_0025_1.png' title='null' text=''/></p>\n<p>انتظر ريثما ينهي البرنامج عمله</p>\n<p><img src='content/images/screenshot_2012-10-29_0025.png' title='null' text=''/></p>\n<p>الرسالة Done and all set تظهر عند نجاح العملية</p>\n<ul>\n<li>انتقل الآن إلى سوق Play، سيبدأ التحميل. انقر على زر القائمة في جهازك واختر Accounts، ثم اختر حساب Google الذي أنشأته حديثًا كما في بداية شرح هذه الطريقة، إن لم تكن قد أضفته، فإذهب إلى إعدادات النظام > الحسابات والمزامنة ثم أضف الحساب الجديد بإدخال اسم المستخدم وكلمة المرور. الآن أنت تستخدم السوق بالحساب الجديد، سيستغرق التحميل للمرة الأولى فترة طويلة نسبيًّا والسبب أن السوق يقوم بتحديث نفسه وتنزيل آخر إصدار، بعدها يُفترض أن يكون وقت التحميل أقل، يعتمد الأمر على سرعة الاتصال بالإنترنت لديك في الحالتين.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0022_2.png' title='null' text=''/></p>\n<p>بعد الضغط على زر القائمة، اختر Accounts</p>\n<p><img src='content/images/screenshot_2012-10-29_0022_3.png' title='null' text=''/></p>\n<p>اختر الحساب الجديد الذي أنشأته</p>\n<p><img src='content/images/screenshot_2012-10-29_0025_2.png' title='null' text=''/></p>\n<p>انتظر ريثما يعيد السوق التحميل مجدّدًا</p>\n<ul>\n<li>بعد أن ظهرت أقسام السوق، ابحث عن التطبيق أو الكتاب أو أي محتوى تريد تحميله ثم انقر عليه لتظهر لك تفاصيله، ستشاهد زر Install إن لم يكن التطبيق مثبّتًا لديك، أو زر Update إن كانت نسخته لديك قديمة، أو زر Open لفتح التطبيق إن كان مثبتًا. اضغط Install في الحالة الأولى لتثبيت التطبيق.<img src='content/images/screenshot_2012-10-29_0026.png' title='null' text=''/></li>\n</ul>\n<p>الصفحة الرئيسية لقسم التطبيقات في سوق Play</p>\n<p><img src='content/images/screenshot_2012-10-29_0027_2.png' title='null' text=''/></p>\n<ul>\n<li>ستظهر شاشة تعرض معلومات عن الصلاحيات التي يتطلبها البرنامج (الوصول للإنترنت، تخزين المعلومات على بطاقة الذاكرة... إلخ.) وهي تختلف من برنامج لآخر، كن حذرًا ولا تقم بتثبيت تطبيقات غير مأمونة. اضغط Accept &amp; download للموافقة على تثبيت التطبيق والبدء بتحميله.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0027_3.png' title='null' text=''/></p>\n<ul>\n<li>يبدأ تحميل التطبيق وبالإمكان مشاهدة تقدم التحميل (إذا أردت أن يقوم السوق بتحديث التطبيق كلما صدرت نسخة جديدة، فاختر Allow automatic updating، وهذا يحتاج أن تكون متصلاً دومًا عبر Orbot وTransparent Proxy وأن يكون Market Enabler مضبوطًا).</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0027_4.png' title='null' text=''/></p>\n<p>يبدأ تحميل التطبيق</p>\n<p><img src='content/images/screenshot_2012-10-29_0027_5.png' title='null' text=''/></p>\n<p>يجري تحميل التطبيق</p>\n<p><img src='content/images/screenshot_2012-10-29_0028.png' title='null' text=''/></p>\n<p>خيار Allow automatic updating يسمح بالتحديث التلقائي للتطبيق</p>\n<ul>\n<li>سيقوم السوق بتثبيت التطبيق مباشرة بعد نهاية التحميل ودون أن يعرض لك نافذة التثبيت؛ عند الانتهاء من تحميل التطبيق وتثبيته تظهر أزرار Open لفتح التطبيق وUninstall لإزالته.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0028_2.png' title='null' text=''/></p>\n<p>تم تثبيت التطبيق</p>\n<ul>\n<li>بعد الانتهاء من تحميل التطبيقات التي تحتاجها، انتقل إلى Transparent Proxy وألغِ الخيار Proxy في أول القائمة، ثم انتقل إلى Orbot وقم بالنقر مطوّلاً على الزر الأخضر الكبير لإطفائه. هذه الخطوة اختيارية لكنها أفضل من حيث أنك ستعود إلى السرعة الطبيعيّة لاتصال الإنترنت الذي تستخدمه، لكنّها أسوأ من حيث أنّ Orbot يقدّم تشفيرًا لكلّ البيانات المتبادلة عن طريقه، كما أنّك ستحتاج إلى إعادة جميع الخطوات كلّما أردت تحميل تطبيق من السوق.<img src='content/images/screenshot_2012-10-29_0029.png' title='null' text=''/></li>\n</ul>\n<p>أزل الإشارة من خيار Proxy</p>\n<p><img src='content/images/screenshot_2012-10-29_0029_2.png' title='null' text=''/></p>\n<p>أطفئ Orbot بالضغط مطوّلاً على الزر الكبير لجعله رماديّ اللون</p>\n<p><strong>ملاحظات:</strong></p>\n<ul>\n<li>إذا فقدت القدرة على تصفح الويب واستخدام الإنترنت على الجهاز فهذا لأنك نسيت تعطيل Transparent Proxy بعد أن قمت بإيقاف Orbot. عد إلى تطبيق Transparent Proxy وأزل إشارة &quot;صح&quot; من الخيار Proxy في بداية القائمة.</li>\n<li>عندما يفشل Orbot في الاتصال أو يستغرق وقتًا أطول من المعتاد جرب أن تعيد تشغيل الجهاز (لا تنسى إعادة ضبط MarketEnabler بعد إعادة التشغيل كذلك).</li>\n<li>أحيانًا تظهر رسالة خطأ في المتجر (&quot;Connection timed out.&quot;) وهذا يشير إلى بطء الاتصال بالإنترنت، أغلق البرامج التي تستخدم الإنترنت في جهازك وبقية الأجهزة المتصلة بنفس الشبكة ثم أعد المحاولة بالضغط على زر Retry.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0023.png' title='null' text=''/></p>\n<ul>\n<li>إذا ظهرت الرسالة &quot;Authentication is required. You need to sign into your Google Account.&quot;، فهذا يعني أحد احتمالين: إما أنك لم تضبط MarketEnabler أو التطبيقين الآخرين بشكل صحيح (كرر الخطوة الموافقة) أو  إن حسابك مرتبط برقم هاتف سوري أو بالبلد سوريا ربّما.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0024.png' title='null' text=''/></p>\n<h3 id=\"-\">الطريقة الثانية: تحميل التطبيقات من جهاز كمبيوتر ثم نقلها إلى الجهاز</h3>\n<p>في هذه الطريقة، تحتاج إلى تنفيذ معظم الخطوات في الطريقة الأولى لمرة واحدة فقط، على الرغم من أنك ستحتاج إلى صلاحيات root  وجميع البرامج التي استخدمتها في الطريقة الأولى، إلا أنك تحتاج إلى فعل هذا مرة واحدة فقط، بعدها يمكنك تصفح البرامج التي ترغب بتحميلها من الكمبيوتر وتحميلها ثم نقلها إلى هاتفك؛ هذه الطريقة مريحة أكثر وغالبًا ما تكون أسرع.</p>\n<p><strong>ما تحتاجه:</strong></p>\n<ul>\n<li>جميع <a href=\"https://www.dropbox.com/sh/tk20lr2g8t0zozs/5AX80gwP6i\">البرامج من الطريقة الأولى</a>، </li>\n<li>وبرنامج DeviceID (انظر رابط التحميل في نهاية هذه الفقرة)،</li>\n<li>متصفح Chrome على جهاز الكمبيوتر </li>\n<li>إضافة APK Downloader لمتصفح Chrome على الكمبيوتر</li>\n<li><p>برنامجًا مثل Pshiphon 3 أو UltraSurf أو HotSpot Shield أو أي برنامج آخر يوفّر اتصالاً عبر VPN أو SSH.لتحميل القسم الثاني من البرامج والإضافات، <a href=\"https://www.dropbox.com/sh/748nbk5dhtxfgfk/zHyMQwgpsT?m\">انقر هنا</a>.<br><strong>الكيفية:</strong></p>\n</li>\n<li><p>أعد جميع الخطوات في الطريقة الأولى حتى تصل إلى شاشة سوق Play الرئيسية التي تعرض الأقسام (عليك فعل هذا مرة واحدة فقط).</p>\n</li>\n<li>ثبت DeviceID على جهازك وافتحه، تحت العنوان DeviceID ستجد مجموعة من الحروف والأرقام المتصلة عددها 16 حرفًا، احفظ هذا الرقم لديك على ورقة أو أرسله إلى نفسك عبر البريد الإلكتروني من زر Share المجاور أو أبقِ هاتفك بالقرب من الكمبيوتر (<em>المهم أن يكون في متناول يدك لأننا سنحتاج لإدخاله في الكمبيوتر</em>).</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_2301.png' title='null' text=''/></p>\n<ul>\n<li><p>أغلق Chrome بشكل نهائي، <em>إن كان يعمل في الخلفية فانقر على رمزه في زاوية النظام بالزر الأيمن للفأرة واختر Exit وانتظر بضع دقائق</em>.</p>\n</li>\n<li><p>اذهب إلى اختصار Chrome على سطح المكتب أو في شريط المهام أو في قائمة ابدأ (الاختصار الذي تستخدمه عادةً لفتح Chrome)</p>\n</li>\n<li>انقر على الاختصار بالزر الأيمن واختر Properties أو خصائص (إذا كان مثبّتًا في شريط المهام، ستحتاج إلى النقر على الرمز المصغر)</li>\n</ul>\n<p><img src='content/images/screenshot.178.jpg' title='null' text=''/></p>\n<ul>\n<li>نحتاج إلى إجبار Chrome على تجاوز التحقق من شهادات المواقع (<em>قد تعرض هذه الخطوة حاسوبك للخطر عند تصفح الويب إذ لا يقوم Chrome بتحذيرك عند زيارة مواقع مشبوهة</em>) في حقل Target أو الهدف، أضف إلى نهاية المسار (بعد C:\\...\\chrome.exe) مسافة ثم العبارة التالية كما هي دون تغيير:</li>\n</ul>\n<p>--ignore-certificate-errors --allow-running-insecure-content</p>\n<p><img src='content/images/screenshot.188.jpg' title='null' text=''/></p>\n<p>أدخل مسافة ثم العبارة كاملة في نهاية الحقل &quot;Target&quot;</p>\n<ul>\n<li><p>شغل Chrome من الاختصار الذي قمت بتعديله للتوّ، ثم ثبّت إضافة APK Downloader لمتصفح Chrome؛ النسخ الحديثة في Chrome لا تسمح بتثبيت الإضافات من خارج سوق Chrome الإلكتروني، لكن يمكن تجاوز هذا ببساطة: افتح صفحة الإضافات ثم اسحب ملف APK Downloader (وهو ملف بلاحقة .crx) من مدير الملفات في الكمبيوتر وأسقطه ضمن نافذة الإضافات، ثم اختر موافق لتثبيت الإضافة.</p>\n</li>\n<li><p>الآن عليك ضبط الإضافة لمرة واحدة فقط: حدث صفحة الإضافات وابحث عن APK Downloader ثم اختر Options.</p>\n</li>\n<li><p>اكتب عنوان البريد الإلكتروني لحساب Google الذي استخدمته في الخطوة الأولى لدخول سوق Play وكلمة المرور الموافقة. أدخل معرف الجهاز (Device ID) الذي حصلت عليه من برنامج Device ID في الحقل الموافق في إعدادات إضافة APK Downloader، ثم اضغط على زر Login.</p>\n</li>\n</ul>\n<p><img src='content/images/screenshot.166.jpg' title='null' text=''/> </p>\n<ul>\n<li>إذا تم تسجيل الدخول بنجاح، ستتغير شاشة الإعدادات لتعرض حقلين جديدين في الأسفل، وزر Save Settings. انقر على زر Save Settings فقط (<em>لا تنسى النقر عليه وإلا ستضطر لإعادة فتح خيارات الإضافة وملء الحقول</em>).</li>\n</ul>\n<p><img src='content/images/screenshot.170.jpg' title='null' text=''/></p>\n<ul>\n<li>ستظهر رسالة تخبرك بنجاح الضبط. إذا ظهرت رسالة خطأ فأعد المحاولة وتحقق من تنفيذك للخطوات بشكل صحيح.</li>\n</ul>\n<p><img src='content/images/screenshot.171.jpg' title='null' text=''/></p>\n<ul>\n<li>الآن شغل برنامج Psiphon 3 أو أي برنامج آخر قررت استخدامه، <em>تأكد من أنه يعمل مع المتصفح</em>.</li>\n<li>اذهب إلى سوق Play واختر البرنامج الذي تريده، ثم افتح صفحته وانتظر حتى يكتمل تحميل الصفحة، ستظهر عند ذلك أيقونة الإضافة APK Downloader في أقصى شريط العنوان في Chrome، انقر عليها لتنتقل إلى صفحة التحميل وليبدأ تحميل التطبيق مباشرة.<img src='content/images/screenshot.172.jpg' title='null' text=''/></li>\n</ul>\n<p>انقر على الصورة لتكبيرها</p>\n<p><img src='content/images/screenshot.174.jpg' title='null' text=''/></p>\n<p>انقر على الصورة لتكبيرها</p>\n<p><img src='content/images/screenshot.177.jpg' title='null' text=''/></p>\n<p>انقر على الصورة لتكبيرها</p>\n<ul>\n<li>تهانينا!<strong>ملاحظة:</strong></li>\n</ul>\n<p>إن واجهت أي مشكلة فلا تردد في ترك تعليق على التدوينة، لكن أولاً ارجع إلى الخطوات وتحقق منها واقرأ العبارات <em>المكتوبة بخط مائل</em> بتمعّن وتأكد من أنك نفذّتها.<br>لا تنسى مشاركة التدوينة مع أصدقائك!</p>\n","title":"طرق لتجاوز حظر سوق Play في سوريا (للمبتدئين)","filename":"access-google-play-in-syria.json","id":"access-google-play-in-syria","date":"2012-10-30T00:00:00.000Z","image":"content/images/screenshot_2012-10-29_0017.png","description":"مستخدمو Android في سوريا يعانون من صعوبة العثور على تطبيقات ذات جودة عالية وبسهولة، وغالبًا ما يلجأون إلى استخدام متاجر بديلة مثل 1Mobile وGetJar، ولكن هذه التطبيقات تحتوي برامج من نوعية رديئة جنبًا إلى جنب مع البرامج العالية الجودة وقد تحمل نسخًا غير متوافقة مع الجهاز الذي تستخدمه. بكل الأحوال تبقى هذه المتاجر خيارًا جيًّدا لتحميل التطبيقات الشهيرة وبسرعة دون الحاجة إلى طرق معقدة. لكنني هنا سأشرح طريقة الوصول لأي تطبيق متوافق مع جهازك وتحميله مباشرة من سوق Play الرسمي، هكذا تضمن أنك ستحصل على أحدث الإصدارات من البرامج المتوافقة مع جهازك.","images":37,"videos":0,"tracks":0,"links":8,"type":"text"}