{"html":"<h1 id=\"-android-\">بعض مشاكل قابلية الاستخدام في Android: زر الرجوع</h1>\n<p>Android نظام تشغيل ناجح للغاية، وقد أحدث ثورةً في مفاهيم الهواتف الذكية، فبعد أن كان الإمكانات المتقدمة التي يمكن لهاتف ذكي أن يؤديها حكرًا على أصحاب iPhone، وكانت هواتف Nokia الذكية أغبى من المتوقع، جاء Android ليضع في يد ملايين المستخدمين من حول العالم إمكانات تقارب ما يمكن لحاسوب أن يفعله، وتتجاوزه من حيث السهولة في كثير من الأحيان.</p>\n<p>لكن لنكون صريحين، فإن Android بعد أن جربته على كثير من الأجهزة بمختلف &quot;نكهاته&quot; التي تصر الشركات المصنعة أن تخلقها، ما زال يعاني من بعض المشاكل في قابلية الاستخدام.</p>\n<p>تكاد قابلية الاستخدام (Usability) تصبح علمًا قائمًا بذاته، ويمكن اعتبارها جزءًا من تجربة المستخدم (User Experience) الشغل الشاغل لمصممي الأنظمة والواجهات في هذه الأيام. إذا أردت قراءة المزيد عن هذا الموضوع بالعربية، فأنصحك بالاطّلاع على <a href=\"http://uxfix.com/\">مدونة الأستاذ مشهور الدبيان</a>، وإن لم تُحدّث منذ زمن.</p>\n<h3 id=\"-\">زر الرجوع</h3>\n<p>وهو المشكلة الكبرى برأيي، لا يحافظ زر الرجوع على نمط معين يمكن التنبؤ به بشكل دائم، وإنما عليك في كل مرة تضغط فيها زر الرجوع أن تضع كافة الاحتمالات في ذهنك، فإذا كنت في برنامج ما، وتصفحت عدة صفحات ضمنه، وأردت الرجوع إلى كل صفحة سابقة، فقد لا يعمل زر الرجوع كما تتوقع، بل ربما يعود بك إلى الصفحة الرئيسية للبرنامج أو ربما يخرج من البرنامج ليعيدك إلى الصفحة الرئيسية للهاتف في حال وصلت إليه من شريط التنبيهات مثلاً، ومما يزيد الطين بلة وجود اختلاف بين برنامج وآخر حتى لو كانت الظروف متماثلة فالأمر هنا متروك للمطورين أنفسهم، وليكون الأمر أسوأ فإن بعض التطبيقات التي تتبع أسلوب Holo (نمط التصميم المستخدم في Android 4.0 وما بعده) تضيف إلى الشريط العلوي زر رجوع آخر، مهمته تختلف من برنامج لآخر ومن صفحة لآخرى ضمن نفس البرنامج، فقد يظهر صفحة جانبية تحوي اختصارات في Google+ وقد يعيدك إلى الخلف في Google+ نفسه بحسب موضعك، ما مهمة زر الرجوع أدناه إذًا؟</p>\n<p>شخصيًا تطوّر عندي &quot;حدس&quot; بحيث يمكنني توقع ما الذي سيفعله زر الرجوع بالضبط، وهذا ينجم عن الخبرة، التي أتمنى أن تمكن بقية المستخدمين من تجاوز هذه المشكلة!</p>\n<p>لمزيد من الشرح <a href=\"https://www.youtube.com/watch?feature=player_detailpage&amp;v=WAslrg10Jps#t=658s\">شاهد هذا الفيديو بدءًا من الدقيقة 11 تقريبًا.</a></p>\n","title":"بعض مشاكل قابلية الاستخدام في Android: زر الرجوع","filename":"android.json","id":"android","date":"2013-02-25T00:00:00.000Z","image":null,"description":"Android نظام تشغيل ناجح للغاية، وقد أحدث ثورةً في مفاهيم الهواتف الذكية، فبعد أن كان الإمكانات المتقدمة التي يمكن لهاتف ذكي أن يؤديها حكرًا على أصحاب iPhone، وكانت هواتف Nokia الذكية أغبى من المتوقع، جاء Android ليضع في يد ملايين المستخدمين من حول العالم إمكانات تقارب ما يمكن لحاسوب أن يفعله، وتتجاوزه من حيث السهولة في كثير من الأحيان.","images":0,"videos":0,"tracks":0,"links":2,"type":"text"}