{"html":"<h1 id=\"-aquran\">الإصدار الجديد من aQuran</h1>\n<p>استكمالاً <a href=\"https://arabia.io/webdev/5902-مشروع-تطبيق-للقرآن-الكريم-للهواتف-الذكية-مبني-بلغات-الويب\">للموضوع السابق</a>، قمت للتو برفع نسخة تجريبية من التطبيق على GitHub Pages بعد محاولة الاستضافة على عدة مواقع أخرى باءت بالفشل :)</p>\n<h2 id=\"-\">ما الجديد منذ الموضوع السابق؟</h2>\n<ul>\n<li>تم الانتقال إلى <em>قواعد بيانات IndexedDB</em> ضمن المتصفح، وهي من الميزات الحديثة ضمن المتصفحات، حيث يتم تخزين قاعدة بيانات النص القرآني والترجمات ومعلومات التلاوات ضمن المتصفح، وبهذا لا داعي لأي شيء من جهة الخادم، سوى تقديم الملفات الثابتة static، ولا داعي أيضًا لإبقاء كامل قاعدة البيانات ضمن الذاكرة، وهو ما كنت أفعله في السابق.</li>\n<li>التطبيق يعمل بلا اتصال بعد اكتمال تحميل كافة الملفات أول مرة، يمكنك زيارة الرابط نفسه حتى لو كنت غير متصل بالإنترنت (يعتمد على ميزة <em>AppCache</em>).</li>\n<li>يتم تحميل النص القرآني مرة واحدة وتخزينه ضمن المتصفح، مما يسمح بتحسين الأداء بشكل رائع.</li>\n<li>يتم تحميل الترجمة عند تفعيلها فقط، ثم تخزينها في المتصفح ضمن قاعدة بيانات IndexedDB.</li>\n<li>الترجمات تعمل، تعرض ترجمة كل آية تحتها، ويمكن اختيار أكثر من ترجمة، وبأكثر من لغة.</li>\n<li>طبعاً مع إمكانية إخفاء الترجمات بالكامل والاكتفاء بالنص القرآني</li>\n<li>بدل الحاجة للتنقل بين الصفحات أثناء القراءة، كل ما عليك هو متابعة التمرير للأسفل لتحميل الصفحة التالية (infinte scrolling)</li>\n<li>البحث يعمل</li>\n<li>النقر على إحدى نتائج البحث ينقلك مباشرة إلى هذه الآية، في السابق كان ينقلك إلى بداية الصفحة التي فيها الآية</li>\n<li>التلاوات تعمل بشكل تجريبي (هناك بعض المشاكل تؤدي لتكرار تلاوة الصفحة بدل الانتقال للصفحة التالية، أعمل على حلها)</li>\n<li>جودة التلاوات قابلة للتكيف مع سرعة الاتصال (لا يوجد متصفح حالياً يتبنى الواجهة البرمجية لمعلومات الاتصال Network Information API سوى Firefox OS على حد علمي، وعلى هذا ستحصل دوماً على أعلى دقة للتلاوة على بقية المتصفحات)</li>\n</ul>\n<h2 id=\"-http-imgur-com-a-pvpew-\"><a href=\"http://imgur.com/a/PvPEW\">صور التطبيق</a></h2>\n<p><span class='media-container'> <img src='content/images/aquran-beta/1.png' title='' text='1'/> </span>\n<span class='media-container'> <img src='content/images/aquran-beta/2.png' title='' text='2'/> </span>\n<span class='media-container'> <img src='content/images/aquran-beta/3.png' title='' text='3'/> </span>\n<span class='media-container'> <img src='content/images/aquran-beta/4.png' title='' text='4'/> </span>\n<span class='media-container'> <img src='content/images/aquran-beta/5.png' title='' text='5'/> </span>\n<span class='media-container'> <img src='content/images/aquran-beta/6.png' title='' text='6'/> </span>\n<span class='media-container'> <img src='content/images/aquran-beta/7.png' title='' text='7'/> </span>\n<span class='media-container'> <img src='content/images/aquran-beta/8.png' title='' text='8'/> </span></p>\n<h2 id=\"-\">متطلبات التشغيل</h2>\n<ul>\n<li>أحدث نسخة من Chrome أو Firefox على Android 4.0+</li>\n<li>أحدث نسخة Chrome على iOS 7+ (لم أقم بالتجربة ولكن المفترض أن يعمل)</li>\n<li>Firefox OS 1.2+</li>\n</ul>\n<h2 id=\"-\">شكر خاص</h2>\n<ul>\n<li>أحب أن أتقدم بالشكر الجزيل للدكتور <a href=\"https://arabia.io/u/خالد-حسني\"><em>خالد حسني</em></a> لمساهمته الكبيرة في تطوير المشروع، حيث قدم لي نسخًا معدلة من خط أميري قرآن، كما تم اعتماد <a href=\"https://bitbucket.org/khaledhosny/quran\">النص القرآني الذي يعمل عليه</a>، وهو يتبع معايير</li>\n<li><a href=\"https://arabia.io/u/louy\"><em>لؤي العقاد</em></a> لنصائحه ولاقتراحه نشر التطبيق كتطبيق ويب بدل الاعتماد على منصة Cordova (هذا سهل المهمة أكثر :))</li>\n<li><em>مجتمع Arabia I/O</em> لتشجيعهم لي على المتابعة</li>\n</ul>\n<h2 id=\"-\">مشاكل معروفة</h2>\n<ul>\n<li>بطء التحميل للمرة الأولى: الأمر يعتمد على سرعة اتصالك، في المرات القادمة التي يتم فتح التطبيق فيها، المفترض أن تستخدم النسخة المخزنة ضمن AppCache، وهذا يعني أنه لا حاجة للاتصال بعد ذلك (باستثناء عند تشغيل التلاوات بالطبع).</li>\n<li>النص القرآني تجريبي، ومبني على عمل الدكتور خالد حسني. لاحظت بعض الأخطاء في إشارات الوقف، وسأعمل على التبليغ عنها ثم تحديث المشروع، في الوقت الحالي بإمكانك استخدام النص القرآني من مشروع الفانوس كبديل، وذلك عند بناء التطبيق بالأمر التالي:</li>\n</ul>\n<pre lang='en'>gulp --production --experimental <span class=\"hljs-number\">0</span></pre><ul>\n<li>تُرجى التجربة على <strong>هاتف ذكي</strong> أو <strong>جهاز لوحي</strong>، ليس على desktop أو laptop. السبب هو أن التطبيق مصمم لشاشات اللمس ومبني على إطار عمل للهواتف الذكية.</li>\n<li><strong>متصفح Chrome لا يعرض النص القرآني بشكل صحيح</strong>، السبب في Chrome، لن أعمل على إيجاد حلول ترقيعية الآن. لإصلاح المشكلة يمكنك تعطيل تلوين النص القرآني في إعدادات التطبيق، مع ذلك ستبقى إشارة الآية تسبق الرقم، لكن النتيجة ستكون أفضل بالطبع.</li>\n<li>Firefox يعرض النصوص بطريقة صحيحة، لكن لسبب ما لا يمكن النقر على زر تبديل وضع الخيار ضمن الإعدادات.</li>\n<li>تكرار تلاوة الصفحة بدل الانتقال للصفحة التالية (أعمل على حلها)</li>\n<li>تقطع التلاوة: بما أن التطبيق يعتمد على Network Information API لتقدير سرعة اتصالك بالإنترنت، فلا يمكن الاستفادة من هذه الميزة إلا على Firefox (وربما على Firefox OS فقط)، إذا واجهت تقطعاً بالتلاوات، فالسبب هو بطء اتصالك بالإنترنت وفشل التطبيق في تقدير سرعته لجلب تلاوة بدقة مناسبة. سأبحث عن حلول أخرى لتقدير سرعة الاتصال.</li>\n<li>النسخة المستضافة على GitHub Pages لا توفر سوى الترجمات باللغتين العربية والإنكليزية حالياً.</li>\n</ul>\n<h2 id=\"-\">الخطوات التالية</h2>\n<ul>\n<li>حل المشاكل السابقة</li>\n<li>تعريب التطبيق، وتوفير إمكانية ترجمته لأية لغة</li>\n<li>لتقليل استهلاك الذاكرة، حذف الصفحات القديمة في قائمة التمرير عند الابتعاد عنها لمسافة معينة</li>\n</ul>\n<p><a href=\"http://forabi.github.io/aQuran\">جرب التطبيق!</a></p>\n<h2 id=\"-\">المساهمات</h2>\n<p>هل تجيد تطوير تطبيقات الويب؟ <a href=\"https://github.com/forabi/aQuran\">ساعدني على GitHub</a></p>\n","title":"الإصدار الجديد من aQuran","filename":"aquran-1.0-beta-announcement.json","id":"aquran-1.0-beta-announcement","date":"2014-04-04T00:00:00.000Z","image":"content/images/aquran-beta/1.png","description":"استكمالاً للموضوع السابق، قمت للتو برفع نسخة تجريبية من التطبيق على GitHub Pages بعد محاولة الاستضافة على عدة مواقع أخرى باءت بالفشل :)","images":8,"videos":0,"tracks":0,"links":7,"type":"text"}