{"html":"<h1 id=\"-chromium-os\">تجربتي لنظام Chromium OS</h1>\n<p>تعجبني الأفكار الّتي تأتي بها Google، وأحاول دائمًا تجربة منتجاتها الجديدة حتّى وإن كانت في المرحلة التّجريبيّة.<br>Chrome OS ببساطة هو نظام تشغيل يحتوي فقط على متصفّح للويب؛ تنجز أعمالك كلّها عبر الإنترنت، لا يقوم النّظام بتخزين البيانات على الجهاز بل على &quot;السّحابة&quot; أي في مخدّمات الشّركات الّتي تستخدم منتجاتها.</p>\n<p>سأطرح مثالاً لتوضيح فكرة الحوسبة السّحابيّة (Cloud Computing): بدلاً من استخدام Microsoft Office مثلاً... ستستخدم Google Docs (محرّر مستندات Google) وهو طقم مكتب يحوي معالجًا للنّصوص كبديل عن Word وصانعًا للعروض التّقديميّة كبديل عن PowerPoint... إلخ، ولكنّ الفرق الأساسيّ بينهما أنّ الأوّل (Microsoft Office) يحتاج أوّلاً إلى التّثبيت على الجهاز ثمّ تشغيله وربّما لا يعمل على بعض أنظمة التّشغيل... أمّا الأخير فكلّ ما عليك فعله للبدء بالكتابة وصنع العروض التّقديميّة بواسطته هو أن تزور الموقع الخاصّ به على الويب... لن يكون هناك عمليّة تثبيت، فقط تحتاج لمتصفّح ويب. كذلك فإنّ الملفّات الّتي تنشئها على Google Docs لا تخزّن على جهازك بل على مخدّمات Google وستجدها في قائمة لديك ضمن نفس الموقع لتشاهدها وتعدّلها متى شئت.<br>قد تسألني... ما الفائدة إذًا من بناء نظام تشغيل لا يحوي سوى المتصفّح بينما أستطيع تثبيت المتصفّح على جهازي الّذي يعمل بنظام Windows أو غيره من الأنظمة؟ الجواب يحدّده استخدامك للجهاز: إذا كنت تستعمل متصفّح الويب ولا شيء غيره فلم تستخدم نظامًا قد تصيبه الفيروسات ومدّة إقلاعه طويلة وأداؤه بطيء بسبب البرامج الكثيرة المثبّتة؟ إذا قلت لي إنّك تستخدم جهازك للبرامج الهندسيّة أو غير ذلك من الأعمال الاختصاصيّة والمهنيّة... فنظام Chrome OS ليس لك!</p>\n<p>في هذا الفيديو، تشرح Google فكرة نظام Chrome OS:</p>\n<p>تجربتي<br>في الحقيقة لم أجرّب نظام Chrome OS لأنّه يأتي فقط على أجهزة تطرحها شركات مثل Samsung وAcer... ولا يمكنك استخدامه على جهازك العادي، ما جرّبته هو Chromium OS... وهو نظام يدعمه ويبنيه مطوّرون متطوّعون، وكلا النّظامين يستخدم نفس الأصل البرمجيّ. لن تجد أيّ فرق آخر يُذكر بين النّظامين.</p>\n<p>بعد <a href=\"http://forabi.blogspot.com/2011/08/chromium-os_04.html\">تحميل النّظام وتشغيله</a> من ذاكرة Flash، شاهدت شاشة تسجيل الدّخول، الجميل في هذا النّظام أنّ مفهوم المستخدم فيه يعني صاحب حساب Google، أيّ أنّك تكتب عنوان بريدك الإلكترونيّ وكلمة المرور الموافقة ليتمّ تسجيل دخولك إلى النّظام! لن تحتاج إلى إنشاء حسابات مستخدمين لأيّ شخص... يستطيع أن يقوم بتسجيل الدّخول كلّ من لديه عنوان بريد إلكترونيّ من Gmail، وتستطيع أن تنشئ حسابًا جديدًا أو أن تستعمل النّظام كضيف Guest دون الحاجة لتسجيل الدّخول بحساب Google.<img src='content/images/login-screen.PNG' title='null' text=''/></p>\n<p>شاشة تسجيل الدّخول، سيتذكر النّظام أسماء الحسابات السّابقة بحيث تضطر إلى إدخال كلمة السّرّ فقط، يمكن اختيار اللّغة أيضًا.</p>\n<p><img src='content/images/screenshot-20110802-190851.png' title='null' text=''/></p>\n<p>استخدام النّظام كضيف، وهذا شبيه بوضع Incognito المتخفّي في متصفّح Chrome.</p>\n<p>بعد تسجيل الدّخول سيظهر أمامك متصفّح شبيه جدًّا بـChrome، إن كنت تستخدم ميزة المزامنة في Chrome فسيقوم النّظام بتحميل كلّ الإشارات والتّطبيقات والإضافات وكلمات المرور... أو فقط ما اخترت مزامنته.<br><img src='content/images/screenshot-20110802-185530.png' title='null' text=''/></p>\n<p>سجّلت دخولي بحسابي على Google، فقام النّظام بمزامنة تطبيقاتي وإضافاتي...<br>لاحظ وجود مدير الملفات (File Manager) في البداية.</p>\n<p>أعجبني</p>\n<ul>\n<li>سهولة استخدام النّظام.</li>\n<li>المزامنة مع Chrome.</li>\n<li>شاشة تسجيل الدّخول عمليّة وبسيطة.</li>\n<li><p>نظام التّنبيهات الّذي يجمع التّنبيهات من كلّ المواقع في نافذة واحدة تظهر أسفل الشّاشة.لم يعجبني</p>\n</li>\n<li><p>مدير الملفّات بسيط وميّزاته قليلة.</p>\n</li>\n<li>الخطّ المستخدم في النّصوص ليس واضحًا تمامًا.</li>\n<li>النّصوص العربيّة تبدو كبيرة بالنّسبة للنّصوص اللّاتينيّة بنفس حجم الخطّ.</li>\n</ul>\n<p>مشاكل في النّظام</p>\n<p>تذكّر أنّ هذا الإصدار من النّظام غير مستقرّ unstable وليس نهائيًّا، لذا فمن الطّبيعيّ أن تجد العديد من العيوب.</p>\n<ul>\n<li>دعم اللّغة العربيّة غير مكتمل: تظهر بعض الكلمات غير كاملة، وإذا قمت بتسجيل الدّخول مختارًا اللّغة الإنكليزيّة فلن تستطيع الكتابة بالعربيّة... اتّجهت لإعدادات النّظام ووجدت خيارات اللّغة لكن لم أستطع إضافة أيّ لغة للكتابة، يبدو أنّ هذه الميزة لم تفعّل بعد، لذا قمت بتثبيت لوحة المفاتيح <a href=\"https://chrome.google.com/webstore/detail/mpphfcjpaldmedbbomcdhgonmhjngfig?hc=search&amp;hcp=main\">هذه</a>. في حال اخترت اللغة العربية لتسجيل الدّخول فلن تواجه مشكلة: سيكون بإمكانك التّبديل بين اللغتين العربيّة والإنكليزيّة عن طريق ضغط Alt+Shift.</li>\n<li>لم يعمل الصّوت، لا أعرف ما المشكلة بالضّبط: هل هي ضمن Flash Player فقط، أم أنّ الصّوت لم يضف بعد إلى النّظام... أم أنّ السّبب هو أنّني اضطررت لتشغيل النّظام من خلال برنامج يسمح للأجهزة القديمة بإقلاع النّظام من ذاكرة Flash.</li>\n<li>بشكل عامّ النّظام بطيء بسبب إقلاعه من خلال البرنامج الّذي ذكرته أعلاه (استغرق الإقلاع 56.4 ثانية).</li>\n<li>بعض الإضافات لم تعمل بصورة صحيحة وبعضها تحطّمت crashed عدّة مرّات.</li>\n<li>أعاد النّظام تشغيل الجهاز تلقائيًّا أكثر من مرّة.</li>\n<li>لم يعمل الاتّصال اللّاسلكيّ Wi-Fi على جهاز Laptop.صور<br>تستطيع التقاط الصّور بطريقة عاديّة، اضغط زرّ Print Screen في لوحة المفاتيح وستخزّن الصّور تلقائيّا في مجلّد تجده في مدير الملفّات. هذه بعض الصّور للنظام، اضغط على صورة لتراها بقياس أكبر.  </li>\n</ul>\n<p><img src='content/images/screenshot-20110802-190645.png' title='null' text=''/></p>\n<p>صفحة Google السّعوديّة.</p>\n<p><img src='content/images/screenshot-20110802-191643.png' title='null' text=''/></p>\n<p>تجربة الخطّ الأساسيّ في النّظام. في حال كانت الواجهة بالإنكليزيّة فلن تظهر الكتابة العربيّة بهذا الخطّ بل بخطّ قبيح هو خطّ Linux الأساسيّ.</p>\n<p><img src='content/images/screenshot-20110802-190535.png' title='null' text=''/></p>\n<p>إحدى صفحات الإعدادات.</p>\n<p><img src='content/images/screenshot-20110802-190803.png' title='null' text=''/></p>\n<p>مدير الملفّات، بطريقة عرض مصغّرات.</p>\n<p><img src='content/images/screenshot-20110802-190758.png' title='null' text=''/></p>\n<p>مدير الملفّات بطريقة عرض التّفاصيل.</p>\n<p><img src='content/images/screenshot-20110802-190747.png' title='null' text=''/></p>\n<p>مدير الملفّات.</p>\n<p><img src='content/images/screenshot-20110802-190628.png' title='null' text=''/></p>\n<p>يمكنك البحث في الإعدادات.</p>\n<p><img src='content/images/screenshot-20110802-190652.png' title='null' text=''/>هل أعجبك النّظام؟ هل تريد تجربته؟ إذا اقرأ <a href=\"http://forabi.blogspot.com/2011/08/chromium-os_04.html\">طريقة التّحميل والتّثبيت</a>.</p>\n","title":"تجربتي لنظام Chromium OS","filename":"chromium-os.json","id":"chromium-os","date":"2011-08-04T00:00:00.000Z","image":"content/images/login-screen.PNG","description":"تعجبني الأفكار الّتي تأتي بها Google، وأحاول دائمًا تجربة منتجاتها الجديدة حتّى وإن كانت في المرحلة التّجريبيّة.Chrome OS ببساطة هو نظام تشغيل يحتوي فقط على متصفّح للويب؛ تنجز أعمالك كلّها عبر الإنترنت، لا يقوم النّظام بتخزين البيانات على الجهاز بل على \"السّحابة\" أي في مخدّمات الشّركات الّتي تستخدم منتجاتها.","images":11,"videos":0,"tracks":0,"links":3,"type":"text"}