{"html":"<h1 id=\"-chromium-os-\">كيف أستطيع تجربة Chromium OS؟</h1>\n<p>هذا ما فعلته حتّى استطعت تشغيل النّظام و<a href=\"http://forabi.blogspot.com/2011/08/chromium-os.html\">تجربته</a>، (تذكّر قبل البدء أنّ هذه الإصدارات غير مستقرّة):</p>\n<ol>\n<li>قمتُ بتحميل نسخة مضغوطة <a href=\"http://chromeos.hexxeh.net/vanilla.php\">من هذا الموقع</a>. مرّر الصّفحة إلى الأسفل ستجد قائمة تحوي إصدارات مختلفة من النّظام، اختر الأولى وهي الأحدث. إذا أردت تجربة النّظام ضمن بيئة وهميّة فاختر إمّا VirtualBox أو VMware ولا أنصح بأيّ منهما لأنّ النّظام سيعمل ببطء ضمن البيئة الوهميّة.</li>\n<li>اختر USB لتحميل نسخة مبنيّة لتعمل على ذاكرة فلاش Flash memory. قد يصل حجم هذه النّسخة إلى نحو 250 ميغابايت (بعد فكّ الضّغط ربّما يصل إلى 1.20 غيغابايت). نسخة USB يمكن تشغيلها من أيّ جهاز يدعم الإقلاع من ذواكر فلاش، إن لم يكن كذلك فهناك طريقة تسمح للأجهزة القديمة بالإقلاع منها، سأشرحها لاحقًا إذا طُلب ذلك منّي.<img src='content/images/ChromiumOS+Vanilla+Nightly+Builds.png' title='null' text=''/></li>\n</ol>\n<p>اختر USB، لاحظ تاريخ البناء.</p>\n<ol>\n<li>الملفّ الّذي حمّلته مضغوط، قم بفكّ الضّغط عنه باستخدام برامج مثل WinZip أو WinRAR أو 7-Zip. سيكون الملفّ النّاتج ذا صيغة IMG.</li>\n<li>الآن سنقوم بتحميل برنامج Disk Imager لأنظمة Windows، مهمّته نسخ الملفّ الأخير إلى ذاكرة فلاش بطريقة تسمح بالإقلاع منها. حمّل البرنامج من <a href=\"https://launchpad.net/win32-image-writer/+download\">الصّفحة الرّسمية</a> (أوّل رابط).</li>\n<li>شغّل البرنامج بعد فكّ الضّغط عنه، ستجد نافذة كهذه:<img src='content/images/Disk+Imager.PNG' title='null' text=''/></li>\n</ol>\n<p>النافذة الأساسيّة لبرنامج Disk Imager.</p>\n<ol>\n<li>اضغط على زرّ التصفّح ذي اللّون الأزرق، اختر الملفّ ذي الصّيغة IMG.</li>\n<li>في قائمة Device اختر الحرف الموافق لذاكرة فلاش الّتي تريد تثبيت النّظام عليها. تأكّد من أنّ المساحة الكلّيّة لذاكرة فلاش أكبر من حجم الملفّ النّاتج عن فكّ الضّغط. سيتمّ مسح كلّ البيانات المخزّنة فيها عند بدء عمل البرنامج، وكذلك سيتمّ تغيير نظام الملفّات عليها إلى نظام غير متوافق مع Windows، وستحتاج إلى <a href=\"http://download.cnet.com/HP-USB-Disk-Storage-Format-Tool/3000-2094_4-10974082.html\">أداة خاصّة</a> لإعادتها إلى وضعها إذا أردت حذف النّظام عليها.</li>\n<li>اضغط Write، وانتظر حتّى انتهاء الكتابة.</li>\n<li>دع الذّاكرة موصولة بالجهاز، وأعد تشغيله، اضغط على الزّر الّذي يسمح لك باختيار الجهاز الّذي تريد الإقلاع منه (Flash memory, CD, Hard disk...) واختر Flash memory. الزّرّ يختلف باختلاف اللّوحة الأمّ في جهازك وقد يكون F10 أو F12 أو غيره، عادةً يظهر عند بدء إقلاع الجهاز مثل هذا: BOOT MENU (F10).</li>\n<li>سيستغرق الإقلاع أقلّ من دقيقة وربّما 20 ثانية فقط.</li>\n</ol>\n<p>راجع <a href=\"http://forabi.blogspot.com/2011/08/chromium-os.html\">تجربتي للنّظام</a>.</p>\n","title":"كيف أستطيع تجربة Chromium OS؟","filename":"chromium-os_04.json","id":"chromium-os_04","date":"2011-08-04T00:00:00.000Z","image":"content/images/ChromiumOS+Vanilla+Nightly+Builds.png","description":"هذا ما فعلته حتّى استطعت تشغيل النّظام وتجربته، (تذكّر قبل البدء أنّ هذه الإصدارات غير مستقرّة):","images":2,"videos":0,"tracks":0,"links":5,"type":"text"}