{"html":"<h1 id=\"-daily-record\">أول مشاريعي العملية على الويب - Daily Record</h1>\n<p>تعرفت على موقع Codecademy في بداية ظهوره عن طريق عالم التقنية، وبدأت بالتجول بين صفحاته والاطلاع على فكرته، فأعجبني جدًّا وبدأت بالانتظام في متابعة دروسه.</p>\n<p>يقدم الموقع مجموعات من الدروس كل منها يعلمك لغة برمجة معينة أو مكتبة برمجية معينة أو مجموعة متكاملة من اللغات للوصف والبرمجة مثل HTML+CSS+JavaScript.</p>\n<p>طريقة التعليم ممتعة جدًّا ويكاد يكون من المستحيل أن يشعر المستخدم بالملل، وكذلك فإن الدروس تأخذ بيد المتعلم خطوة بخطوة وتراعي مستواه المبتدئ في البداية.<br>لا أعرف تمامًا إذا كان من الممكن اعتبار الموقع الوجهة الأولى لمن لا يعرف شيئًا عن البرمجة على الإطلاق، ولكنني متأكد أن من لديه اطلاعًا بسيطة على لغات البرمجة وطريقة تفكير برمجية (فهم كيفية حل المشاكل، فهم العلاقات بين التوابع والمتغيرات والكائنات والأصناف...) يمكنه بسهولة أن يتعلم أي لغة وأن يدرك الاختلافات البسيطة بين لغات البرمجة المختلفة إذا كانت مصممة لتؤدي نفس الغرض.</p>\n<p>قبل Codecademy كنت قد بدأت بالاطلاع على Java في سبيل تعلم تطوير تطبيقات Android، وقبل ذلك كتبت بضع برامج بسيطة بـVisual Basicفي موضوعها لكنني كنت أعتبرها متقدمة لأنني حرصت فيها على &quot;أتمتة&quot; كل شيء وكذلك كتابة كل شيء بنفسي.<br>أعتبر أنني حققت في السابق إنجازًا شخصيًّا كبيرًا لأنني تعلمت بنفسي، ودون أي مساعدة، وقبل أن يتوفر لدي اتصال بالإنترنت -اللهم سوى اتصال dial-up الذي أتى متأخرًا بعد ذلك ولم أستخدمه مطلقًا فيما يتعلق بتعلم البرمجة- طريقة التفكير البرمجي المنطقي، وكيف أحل المشاكل التي تواجهني.<br>البداية كانت بتثبيت Visual Studio على نظام Windows (وكلاهما نسختان غير مرخصتين :P) والبدء في الكتابة، كنت في البداية أصمم واجهة البرنامج المفترض، ولم يكن لدي أدنى اطلاع على النصوص البرمجية، ولكنني كنت أضغط على الأزرار في واجهة التصميم فينقلني إلى واجهة كتابة النص البرمجي بعد أن يملأها بوظيفة الحدث (event) المتعلق بالنقر المزدوج على هذا الزر، وهنا بدأت أربط ما أقرأه وبدأت الكتابة وساعدني الإكمال التلقائي في الانطلاق بالكتابة، فيما بعد اطلعت على المزيد من الأحداث الممكنة لكل عنصر في الواجهة مثل النقر المزدوج والمرور بالفأرة فوق العنصر وتغير النص في مربع النص...</p>\n<p>تعلمت أيضًا حلقات for وwhile من خلال الاطلاع على الأمثلة المرفقة بتثبيت Visual Studio.<br>على الرغم من أن أقصى ما كتبته باستخدام Visual Basic كان محرر نصوص بسيطة مع عدد من الميزات الموسعة التي تعاملت مع registry نظام Windows لتسجيل البرنامج في بدء التشغيل، وطرق حفظ الملف، وحفظ الملف إلى مكان مؤقت للعودة إليه لاحقًا، وقائمة بآخر المستندات التي تم فتحها، والحفظ التلقائي للمستند كل مدة معينة، وعلى الرغم من أنني تركت Visual Studio قبل أن أفهم الكثير من الأمور، إلا أن الرغبة في تحدي المشكلات ومجرد التفكير في أنك قادر على صنع شيء مركب من مجموعة أوامر بسيطة ليؤدي مهمة معينة مثّلتا لي شغفًا كبيرًا.<br>بعد ذلك، وعن طريق المدرسة، تم ترشيحي اسمي من عدد من الأصدقاء للدخول إلى دورات تدريبية بلغة C++ في مركز الجمعية العلمية السورية للمعلوماتية SCS وطُلب منّا في البداية كتابة برنامج (نسيت تفاصيله) بأي لغة برمجية نعرفها.</p>\n<p>لم أتمكن من حل البرنامج بالكامل لكنني كتبت بما يناسب الوقت المُتاح وبما كانت تسمح به قدرتي، والنتيجة كانت أنني قبلت للمتابعة في الدورة أنا وصديق آخر.<br>في هذه الدورة تعلمت شيئًا مهمًّا كان جديدًا بالنسبة لي، وهو أن بإمكاني أن أتعلم طريقة كتابة أي لغة برمجية طالما امتلكت قدرة على التفكير المنطقي، وهو ما ركزت عليه الدورة، فكان الاهتمام منصبًّا على حل مسائل رياضية باستخدام مكونات اللغة من حلقات for وwhile والجمل الشرطية والتوابع وما إلى ذلك، ولم يكن متوجّهًا إلى تعليم C++ بشكل مستقل.</p>\n","title":"أول مشاريعي العملية على الويب - Daily Record","filename":"daily-record.json","id":"daily-record","date":"2013-03-24T00:00:00.000Z","image":null,"description":"تعرفت على موقع Codecademy في بداية ظهوره عن طريق عالم التقنية، وبدأت بالتجول بين صفحاته والاطلاع على فكرته، فأعجبني جدًّا وبدأت بالانتظام في متابعة دروسه.","images":0,"videos":0,"tracks":0,"links":0,"type":"text"}