{"html":"<h1 id=\"-2-\">ملخصات (2)</h1>\n<p>وعدت أنني سأكتب هذه الملخصات كلما توفرت لدي مجموعة من المقالات المناسبة للقراءة، والهدف من تلخيصها إعفاء القارئ من عناء قراءة المقالة كاملة، مع إتاحة الرابط إليها إن أحبّ. هذه المرة لن أكتفي بما حفظته في Diigo، بل سأدرج بعض الروابط من أرشيف ما قرأته في Pocket. كما أنني هذه المرة سأكتب شيئًا من أفكاري وأضمّن الروابط في سياق الحديث في بعض المواضع.</p>\n<h3 id=\"-firefox-os-mozilla-\">لمحة عن نظام Firefox OS من Mozilla للهواتف المحمولة</h3>\n<p><a href=\"https://www.youtube.com/results?search_query=firefox+os\">Firefox OS</a> نظام تشغيل للهواتف المحمولة تنوي Mozilla طرحه في بداية العام القادم، يستخدم نفس محرك الرسم (rendering engine) للمتصفح الشهير Firefox. في الحقيقة أجد هذا النظام مثيرًا جدًّا بسبب فكرته: التطبيقات (والنظام) في الحقيقة هي مواقع على الويب أو مجموعة صفحات ويب مكتوبة باللغات المعروفة HTML مع CSS وJavaScript. هناك عشرات الآلاف من مطوري الويب ومصممي المواقع.</p>\n<p>لا أستطيع أن أشرح ضمن الملخصات لماذا أتابع أخبار هذا النظام باهتمام كبير، والحقيقة أن موضوعًا كهذا يحتاج أكثر من تدوينة كذلك. الفكرة الأساسية التي أهتم بها هي أن النظام هو متصفح ويب، على غرار Chrome OS للحواسب، مما يتيح التخلص من طبقة كاملة من المكتبات والواجهات البرمجية المكتوبة بلغات أخرى، ويسرع زمن الإقلاع، ويوسع قاعدة التطبيقات لتشمل آلاف المواقع على الإنترنت التي يمكن تحويلها إلى تطبيقات ببضع سطور برمجية. إذا كُتب لهذا النظام أن يستمر، واستطاع أن يضمن حصته في سوق الهواتف المحمولة الذي يشهد تنافسًا شديدًا على مستوى الهواتف الذكية بين الأنظمة الشهيرة Android وiOS وWindows Phone، فإنه سيغير من معنى الويب لتصبح البيئة الموحّدة للتطبيقات على مختلف الأجهزة. بتبني واجهات Mozilla البرمجية المفتوحة المصدر والمتاحة للجميع، وبناء تطبيقات ويب معتمدة عليها، لن يعود هناك حاجة لكتابة تطبيق لكل نظام تشغيل للهواتف المحمولة.</p>\n<p>لنأخذ على سبيل المثال Dropbox، أحد أشهر التطبيقات العابرة للمنصات (cross-platform، بمعنى أنه يعمل على أكثر من تركيب من الأجهزة والأنظمة). مطورو التطبيق يصدرون تطبيقات لهواتف Android وiPhone والأجهزة اللوحية، وكذلك يطورون واجهة موقع الويب ونسخة خاصة من موقع الويب للهواتف المحمولة، وكل من هذه الإصدارات التي تؤدي بالأساس شيئًا واحدًا، تحتاج إلى جهد ومتابعة دائمة وصيانة وإصدار تحديثات مستمرة. لو اعتمد المطورون على واجهات Firefox OS واستخدموا المفاهيم الحديثة في تصميم الويب (مثل Responsive design ومفاهيم أخرى)، فسيصبح بالإمكان توحيد الجهود لصنع نسخة واحدة من الخدمة (لم أذكر هنا تطبيقات Dropbox لأنظمة Windows وMac OS X وLinux لأن الحاجة إليها ستبقى موجودة). عندما تتحد الجهود بدلاً من أن تتشتت، وعندما يُقبل آلاف المبرمجين على تصميم تطبيقات ويب موحّدة، فإن وتيرة تطور التقنيات المستخدمة لتصميم هذه التطبيقات ستزداد بسرعة كبيرة وسنشاهد تطبيقات عملية لهذه التقنيات ربما لم نكن لنشاهدها إلا بعد عشرة أعوام.</p>\n<p>لكن هل تمتلك Mozilla موارد كافية لفعل هذا؟ وهل لديها تقنيات منافسة لتقنيات Google أو Apple؟ على الأقل هم يفهمون موقعهم، ويحاولون الدفع بالنظام في سوق الهواتف البسيطة، ثم الهواتف الذكية فيما بعد.</p>\n<p>استطعت <a href=\"https://ftp.mozilla.org/pub/mozilla.org/b2g/nightly/latest-mozilla-central/\">تجربة النظام على الكمبيوتر</a> البارحة، وعلى الرغم من كون <a href=\"https://plus.google.com/111992038052913129304/posts/GbGCWWTYMvw\">النسخة التي جربتها</a> قديمة، إلا أنها تسمح بإعطاء فكرة عن النظام وواجهاته. ضمن <a href=\"https://wiki.mozilla.org/B2G\">صفحة المشروع</a> وجدت بعض الصور <a href=\"https://wiki.mozilla.org/Gaia\">لواجهة للنظام</a> بإصدارات أحدث (أو لما يفترض أن يصبح عليه) والمستندات التي تشرح مفاهيم تصميمه.<br>كنت <a href=\"http://www.it-scoop.com/2011/07/mozilla-boot-to-gecko/\">كتبت في المجلة التقنية</a> عن المشروع بعد بضعة أيام من الإعلان عنه (على الرغم من أن الفكرة كانت غامضة إلى حد ما بالنسبة لي).</p>\n<h3 id=\"-windows-phone-8-windows-8\">الكشف عن Windows Phone 8 وWindows 8</h3>\n<p>Windows Phone يتميز بواجهة جميلة تجمع بين البساطة والعملية، المربعات والمستطيلات المختلفة الألوان المصفوفة جنبًا إلى جنب والتحديثات التي تظهر عليها تجعل الشاشة غنية بالمعلومات التي تحتاجها سريعًا، في Android وiOS تحتاج إلى عدة نقرات على الشاشة لتصل إلى تذكير أو ملاحظة أو معلومة تحتاجه على الفور. في شرح <a href=\"https://www.youtube.com/watch?v=SQZEkXCE_fY\">ما الجديد في الإصدار 8</a>، يتحدث أحد المشرفين على التطوير عن كون التجربة شخصية، ويسخر من كلا النظامين المنافسين Android وiOS بقوله إنه من الصعب التمييز بين عدة هواتف موضوعة معًا على طاولة واحدة، أتساءل هل من الممكن حقًّا التمييز بين عدة هواتف Windows Phone تتشابه جميعها في المربعات والمستطيلات ولا يمكن فيها رؤية صورة خلفية؟ التفريق الوحيد يكون في لون الجهاز وهو شيء حسن. أما في Android فيمكنك صنع ما تشاء بواجهة هاتفك وتخصيصها، وهذا واقعي لأنني لم أجد هاتفين متشابهين في محتوى الشاشة يعملان بنظام Android.</p>\n<p>في المقابل، لا أرى الشيء الذي يدفعني لاستخدام Windows 8 بالفأرة ولوحة المفاتيح، هل تفكر Microsoft بمئات الملايين من المستخدمين الذين لا يملكون شاشات تعمل باللمس؟ الواجهة تحتاج إلى تعلّم من جديد دون أن تحقق شيئًا أكثر إفادة، أما واجهة Windows 7 فهي مألوفة ومفهومة وتؤدي نفس المهمات. إذا لم يكن لديك شاشة تعمل باللمس، فلا تنتقل إلى Windows 8.  </p>\n<blockquote>\n<p>&quot;Now, they don&#39;t have too many options left, but they still have a cash cow. And if they insist on trying out whole new UIs, then do it, but let Windows become a quiet reliable and invisible platform, and do experimentation elsewhere.&quot; -- <a href=\"http://threads2.scripting.com/2012/october/microsoftKeepsBlowingIt\">Microsoft keeps blowing it</a></p>\n</blockquote>\n<p>بالحديث عن الحاجة لتعلم الواجهة الجديدة، مررت منذ عدة أيام بمدونة بالإنكليزية تحمل عنوان <a href=\"http://linuxhaters.blogspot.co.uk/\">&quot;كاره لينكس&quot;</a>، وعلى الرغم من عشرات الشتائم والكلمات البذيئة التي يطلقها الكاتب في كل تدوينة، فإنه بالفعل يملك رؤية دقيقة لما يجب أن تكون عليه أنظمة التشغيل، فيما يلي بعض <a href=\"http://linuxhaters.blogspot.co.uk/2008/09/its-all-about-determination.html\">مما كتبه حول الانتقال إلى Linux</a>:</p>\n<blockquote>\n<p>عادة، ليصبح الناس أكثر إنتاجًا [بالانتقال إلى Linux]، فإما ألّا يحتاجوا إلى تعلم شيء جديد ليستطيعوا تحقيق شيء أفضل قليلاً مما كانوا يحققونه دومًا، وإما أن يحتاجوا إلى تعلم القليل مجدّدًا ليستطيعوا تحقيق شيء لم يكونوا قادرين على تحقيقه.</p>\n<p>الانتقال إلى Linux بالنسبة لبعض الناس لا يحقق أيًّا من الأمرين السابقين، عليك تعلم الكثير لتفعل ما كنت تفعله. وعندما تنتقل إليه، تخسر الكثير جدًّا من التطبيقات، مما يقلل إمكانياتك.</p>\n<p>[ساخرًا] أوه صحيح، لكنه بالفعل يتيح لك أن تضيّع الكثير من أيام العطلة في محاولة لتعلم البرمجة لتصحيح الأخطاء البرمجية والمساهمة في كتابة النصوص البرمجية بحيث يصبح لديك برنامج قادر على تنفيذ ما كنت قادرًا على فعله قبل أن تبدأ بهذا. لا، للأسف ليس هنا تعليمة لاستعادة الأيام الضائعة.</p>\n</blockquote>\n<p>الكاتب يفكر هنا بصورة منطقيّة، وهو غالبًا مستخدم قديم لـLinux ومبرمج كذلك، وربما يصف تجربته التعيسة.</p>\n<h3 id=\"-http-www-livestrong-com-article-532439-the-recommended-percentages-of-fiber-protein-carbohydrates-fat-\"><a href=\"http://www.livestrong.com/article/532439-the-recommended-percentages-of-fiber-protein-carbohydrates-fat/\">النسب المفضلة للألياف والبروتين والنشويات والدهون</a></h3>\n<p><a href=\"http://loseit.com/\">Lose It!</a> يسمح بمراقبة ما تتناوله خلال اليوم على Android وiPhone وعبر الموقع، كما يسمح بمراقبة النسب المئوية للعناصر الغذائية في ما تتناوله، وتحديد هدف للوزن الذي تريد الوصول إليه، وإنشاء أطباق وأطعمة مخصصة في حال لم تعثر على ما تريده في قائمة الطعام (لأن معظم الأطعمة فيه متلائمة مع الحياة الغربية). التطبيق رائع بكل معنى الكلمة وأفضل ما فيه أنه متوفر لـAndroid مما يغني المستخدم عن الحاجة لزيارة الموقع في كل مرة يريد فيها إدخال ما تناوله. قمت بالبحث عن النسب المثالية للعناصر الغذائية لأحرص على الالتزام بها ما أمكنني.</p>\n<h4 id=\"-\">البروتينات</h4>\n<ul>\n<li>يجب أن تساهم البروتينات بما نسبته <strong>10% إلى 35%</strong> من إجمالي الحريرات [يوميًّا].</li>\n<li>يجب أن تستهلك 0.8 غ من البروتين لكل 1 كغ من وزنك.</li>\n<li>اختر البروتينات الصافية، كلحوم الدواجن المنزوعة الجلد، والسمك، والمكسرات والبقوليات وزبدة الفول السوداني والألبان القليلة الدسم. قلل استهلاك البروتينات المترافقة مع نسبة عالية من الدسم، مثل اللحوم الحمراء والحليب كامل الدسم.</li>\n</ul>\n<h4 id=\"-\">الدهون</h4>\n<ul>\n<li>الدهون، وهي العنصر الغذائي الأكثر كثافة من حيث الحريرات، يجب أن تتراوحه نسبته في الغذاء [اليومي] <strong>بين 20% و35%</strong> من كامل الحريرات. يجب أن تؤلف الدهون المشبعة أقل من 10% من كامل الدهون المتناولة، والدهون المتحولة يجب أن تكون أقل من 1%.</li>\n<li>تجنب مصادر الدهون غير الصحية كالزبدة والكريمة والحليب كامل الدسم واللحوم الحمراء.</li>\n</ul>\n<h4 id=\"-\">السكريات</h4>\n<ul>\n<li>(...) <strong>بين 45% و65%</strong> من إجمالي الحريرات [يوميًّا]. يجب أن يبقى الأشخاص الذين يكثرون الجلوس ولا يتحركون كثيرًا عند الحد الأدنى، أما أولئك الذين يتحركون بكثرة والرياضيون فيجب أن يسعوا إلى الحد الأعلى.</li>\n<li>عند اختيار الأغذية الحاوية على السكريات، اختر الفواكه والخضار والحبوب الكاملة والألبان قليلة الدسم وتجنب السكريات المكررة والبسيطة لأنها لا تقدم قيمة غذائية وتسبب زيادة في الوزن عند الإفراط في تناولها.</li>\n</ul>\n<h3 id=\"-\">روابط أخرى</h3>\n<ul>\n<li><a href=\"https://www.youtube.com/playlist?list=PLFC0917E83BCC66DE\">‫ورشة عمل تطبيقات أندرويد‬‎ - YouTube</a> (بالعربية): قائمة بأكثر من 30 مقطع فيديو لورشة عمل حول Android. سأحاول مشاهدتها بما أنني نجحت مؤخرًا في تركيب بيئة Eclipse IDE للتطوير بلغة Java وتركيب إضافة تطوير Android عليها وتحميل طقم تطوير Android، وتصميم برنامج بسيط جدًّا وتجربته على هاتفي، واكتسبت أساسيات Java.</li>\n<li><a href=\"https://www.youtube.com/course?list=EC2F07DBCDCC01493A&amp;feature=plcp\">Android Application Development Tutorials</a> (بالإنكليزية): 200 مقطع فيديو تشرح خطوة بخطوة كيفية تركيب بيئة تطوير Eclipse وتطوير برامج Android.</li>\n<li><a href=\"http://www.shabayek.com/blog/2012/10/29/%D9%83%D8%AA%D8%A7%D8%A8%D8%A9-%D9%87%D8%AF%D9%81%D9%83-%D9%88%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B9%D8%AF%D8%A7%D8%AF-%D9%84%D9%84%D9%85%D8%B4%D8%A7%D9%83%D9%84-%D9%8A%D8%A4%D8%AF%D9%8A-%D9%84%D9%84/\">كتابة هدفك والاستعداد للمشاكل يؤدي للنجاح -- مدونة شبايك</a></li>\n<li><a href=\"http://ardroid.aitnews.com/2012/10/30/matias-duarte-answers-nexus-questions/\">لماذا يعمل حاسب نيكسوس 10 اللوحي بواجهة الهاتف؟ ولماذا لا تدعم أجهزة نيكسوس الذواكر الخارجية؟ غوغل تجيب | Ardroid | أردرويد</a>: هل تهتم Google حقًا بتجربة المستخدم؟ كما يذكر أحد المعلقين، فإن Google قدمت Honeycomb (النسخة 3.0 من Android) بواجهات مختلفة كليًّا عن النظام السابق Gingerbread لأن تجربة استخدام الجهاز اللوحي مختلفة عن Gingerbread وشاعت السخرية من كون واجهة iPad نسخة مكبرة عن iPhone، إذا لماذا عادت Google الآن لتجعل حاسبها اللوحي نسخة مكبرة عن هواتفها؟ حلال على Google وحرام على Apple؟</li>\n</ul>\n","title":"ملخصات (2)","filename":"digest-2.json","id":"digest-2","date":"2012-11-01T00:00:00.000Z","image":null,"description":"وعدت أنني سأكتب هذه الملخصات كلما توفرت لدي مجموعة من المقالات المناسبة للقراءة، والهدف من تلخيصها إعفاء القارئ من عناء قراءة المقالة كاملة، مع إتاحة الرابط إليها إن أحبّ. هذه المرة لن أكتفي بما حفظته في Diigo، بل سأدرج بعض الروابط من أرشيف ما قرأته في Pocket. كما أنني هذه المرة سأكتب شيئًا من أفكاري وأضمّن الروابط في سياق الحديث في بعض المواضع.","images":0,"videos":0,"tracks":0,"links":16,"type":"text"}