{"html":"<h1 id=\"-1-\">ملخصات (1)</h1>\n<p>هذه مجموعة من المقالات التي قرأتها مؤخرًا وتتناول مواضيع متنوعة، وقمت بتلخيصها باستخدام <a href=\"http://www.diigo.com/\">Diigo</a> وأخذت منها ما يهمني وقررت أن أنشرها لكي أريحك من عناء قراءة المقالات كاملة، على أية حال، يمكنك قراءة المقالات كاملة بالضغط على الروابط في العناوين الفرعية. سأكتب هذه الملخصات في كل مرة أجمع فيها عددًا مناسبًا من المقالات المفيدة.  </p>\n<h3 id=\"-http-lifehacker-com-5853250-how-to-sound-like-you-know-what-youre-talking-about-even-when-you-dont-\"><a href=\"http://lifehacker.com/5853250/how-to-sound-like-you-know-what-youre-talking-about-even-when-you-dont\">كيف تبدو وكأنك تفهم ما تقوله؟ (وإن كنت لا تفهمه)</a></h3>\n<blockquote>\n<p>يعلم الخبراء أنهم يلفتون انتباه الناس، ولهذا أثران: الأول أنهم يعلمون أن سمعتهم على المحك كل مرة ينطقون فيها كلمة، بمعنى آخر: سيخضع كل ما يقولونه للتمحيص والتدقيق؛ وثانيًا أنهم يعلمون أيضًا أن الناس يأخذون ما يقولونه على محمل الجد وربمًا يتصرفون على أساسه، ولهذا يشعرون بمسؤولية كبيرة تجبرهم على تقديم معلومات جيدة. </p>\n</blockquote>\n<h3 id=\"-http-lifehacker-com-5951066-how-to-lie-without-actually-telling-a-lie-\"><a href=\"http://lifehacker.com/5951066/how-to-lie-without-actually-telling-a-lie\">كيف تكذب دون أن تنطق بالكذبة؟</a></h3>\n<ul>\n<li>يحتاج الكذب جهدًا، عندما تصدق فإنك ببساطة تتذكر شيئًا ما وتقوله. أما عندما تكذب فإنك تأخذ في الحسبان الحقيقة، وما إذا كنت تريد قولها أو لا، ثم تقرر أنك لا تريد ذلك، وبعدها تلفق كذبة ثم تحاول أن تقولها بطريقة توحي أنك صادق.</li>\n<li>يصبح الكذب صعبًا جدًّا في مواقف معينة لأنك تحتاج أولاً أن تتذكر الكذبة لتقولها لكل شخص يسألك وثانيًا عليك أن تذكر على من كذبت ومن قلت له الحقيقة.</li>\n<li>عليك أن تقول ما تريد قوله بطريقة طبيعية لا توحي بأنك متوتر أو مذنب.</li>\n</ul>\n<h3 id=\"-agps-http-en-wikipedia-org-wiki-assisted_gps-\"><a href=\"http://en.wikipedia.org/wiki/Assisted_GPS\">aGPS (ويكيبيديا)</a></h3>\n<ul>\n<li>aGPS تعني Assisted GPS أي نظام GPS مع مساعدة من أنظمة تحديد موقع أخرى مثل الأنظمة المعتمدة على Wi-Fi وBluetooth وغيرها.</li>\n<li>المساعدة تقع في فئتين: الأولى: تسريع طلب المعلومات من القمر الصناعي، والثانية: حساب الموقع الذي تلقاه الحساس من القمر الصناعي في مخدم (server) تُرسل إليه البيانات عن طريق الإنترنت مثلاً.</li>\n<li>GPS التقليدي (دون مساعدة)، يقدم الموقع أول مرة خلال 30-40 ثانية.</li>\n<li>سرعة نقل البيانات من القمر الصناعي المستخدم في نظام GPS هي 50 بت/ثانية فقط.</li>\n<li>إذا تعرضت إشارة القمر الصناعي للتشويش أو الضياع والانقطاع خلال تحديد الموقع، فإن المعلومات التي يتلقاها حساس GPS في الجهاز المستقبل تُتجاهل ويعاد طلب تحديد الموقع من البداية (وهذه نقطة ضعف في نظام GPS التقليدي)</li>\n</ul>\n<h3 id=\"-https-en-wikipedia-org-wiki-hybrid_positioning_system-\"><a href=\"https://en.wikipedia.org/wiki/Hybrid_positioning_system\">نظام تحديد الموقع الهجين (ويكيبيديا)</a></h3>\n<ul>\n<li>GPS دقيق جدًّا في تحديد الموقع في الأماكن المفتوحة، لكنه أدائه يضعف جدًّا في الأماكن المغلقة وبين الأبنية العالية.</li>\n<li>أنظمة تحديد الموقع بالاعتماد على Wi-Fi قد تعطي موقعًا دقيقًا للغاية، لكن فقط في المدن التي فيها كثافة عالية من شبكات Wi-Fi، كما أنّها تتطلب قاعدة بيانات واسعة تتضمن تفاصيل انتشار هذه الشبكات.</li>\n</ul>\n<h3 id=\"-http-lifehacker-com-5952115-simple-ways-to-eat-less-without-noticing-\"><a href=\"http://lifehacker.com/5952115/simple-ways-to-eat-less-without-noticing\">طرق بسيطة لتأكل أقل دون أن تلاحظ</a></h3>\n<ul>\n<li>استخدم أطباقًا أصغر</li>\n<li>أنقص 20% من الوجبة</li>\n<li>استخدم كؤوسًا أطول</li>\n<li>تناول البروتينات على الفطور: وحدها وجبات الفطور الحاوية على نسبة عالية من البروتين تقلل الشهية خلال اليوم</li>\n<li>تناول ثلاث وجبات في اليوم: لم يثبت أن لتناول أكثر من ثلاث وجبات في اليوم فائدة، وقد يكون أكثر سوءًا من حيث التحكم بالشهية</li>\n<li>أخفِ الوجبات السريعة عن نظرك: كثير من الدراسات أثبتت أن الناس يأكلون أكثر بكثير عندما يكون الطعام أمامهم منه عندما يكون بعيدًا عن نظرهم، حتى لو كانوا يعرفون مكانه.</li>\n<li>امضغ بتأنٍّ</li>\n<li>لا تأكل من العلبة: إن لم تكن تدرك الكمية التي تتناولها فإنك غالبًا تتناول أكثر من حاجتك (ضعفين وربما ثلاثة أضعاف الكمية التي ستتناولها لو أنك كلفت نفسك عناء أخذ حصة من العلبة وسكبها في الطبق)</li>\n<li>لا تأكل أمام التلفزيون</li>\n<li>لا تهتم بالوجبات التي تدعي الشركات المنتجة لها أنّها &quot;صحية&quot;، فهي في معظم الأحيان تكون وجبات سريعة عُبئت بشكل أجمل من الوجبات البديلة. وأيضًا، يبدو أن الناس يأكلون من الوجبات &quot;الصحية&quot; أكثر مما يجب، ولا يعيرون اهتمامهم للسعرات الحرارية فيها طالما أنها &quot;صحية&quot;؛ لكي تكون في صحة حقيقية، تناول طعامًا بسيطًا ودون ادعاءات كاذبة.</li>\n</ul>\n<h3 id=\"-facebook-http-gizmodo-com-5530178-top-ten-reasons-you-should-quit-facebook-\"><a href=\"http://gizmodo.com/5530178/top-ten-reasons-you-should-quit-facebook\">عشرة أسباب تدفعك لترك Facebook</a></h3>\n<ul>\n<li>تنص شروط خدمة Facebook على أنهم لا يمتلكون بياناتك فحسب، بل إنك إن لم تقم بتحديثها ولم تحرص على إبقائها دقيقة فإنهم قد يغلقون حسابك.</li>\n<li>ببساطة، هم يعتبرون أن المستخدمين موظفون غير مأجورين لديهم لتجميع المعلومات واستخدامها في الإعلانات.</li>\n<li>لمؤسس Facebook تاريخ موثق يوحي بتصرفات غير أخلاقية (بحسب ما فهمت: محاولة الدخول إلى عناوين البريد الإلكتروني لبعض منافسيه بتوقع كلمات مرور الحسابات بالاعتماد على بياناتهم على Facebook)</li>\n<li>عرض Paul Warden (مبرمج) كيف يمكنه الحصول على بيانات من Facebook قيل إنها عُممت بالخطأ، فقاضته الشركة، فلماذا يقاضى مطور تطبيقات لأنه جعل بيانات يريد Facebook في الأصل جعلها عامة كما تنص شروط خدمته بعد تحديثها الأخير؟</li>\n<li>عندما تستخدم Facebook فإنك لا تثق فيه فحسب، بل تثق في كل مطوري التطبيقات عليه والذين يكون كثيرٌ منهم صغيرًا جدًا ليهتم بالحفاظ على بياناتك سرية ومؤمنة.</li>\n<li>إما أنهم لا يهتمون كثيرًا بخصوصيّتك، أو أنهم ليس لديهم مهندسون جيّدون، أو كلا الأمرين.</li>\n<li>يجعل Facebook حذف حسابك صعبًا ومعقّدًا، فهو يوحي للمستخدم بأن تعطيل الحساب (deactivation) هو إزالته وهكذا يعتقد المستخدم أنه تخلص منه ولكن بياناته محفوظة لدى الموقع، أما إذا أردت حذفه حقيقة، فعليك العثور على رابط مخفيّ ضمن مركز المساعدة.</li>\n<li>تعطيل الحساب لا يختلف كثيرًا عن الامتناع عن تسجيل الدخول لفترة معينة.</li>\n<li>Facebook حاليًا لا يعطيني أي فائدة على الإطلاق. وهو مزعج أكثر من أي شيء آخر.</li>\n<li>يُصرّ Facebook بوضوح على إضافة كل ميزة من الشبكات الاجتماعية المنافسة في محاولة للسيطرة على الويب.</li>\n<li>يمكنهم أن يفعلوا ما يشاؤون، ضمن إطار القانون (خصوصًا أن القوانين المتعلقة بالإنترنت والشبكات الاجتماعية غامضة وغير محددة تمامًا)</li>\n</ul>\n<h3 id=\"-\">روابط أخرى</h3>\n<p><a href=\"http://lifehacker.com/5940565/why-you-should-start-using-a-vpn-and-how-to-choose-the-best-one-for-your-needs\">لماذا يجب أن تبدأ باستخدام VPN؟ وكيف تختار الخدمة المناسبة لحاجتك؟</a> (بالإنكليزية)</p>\n<p><a href=\"http://lifehacker.com/5911639/the-stupid-things-you-do-on-facebook-and-how-to-fix-them\">الحماقات التي ترتكبها على Facebook وكيف تصلحها</a> (بالإنكليزية)</p>\n<p><a href=\"http://rawkes.com/articles/there-is-something-magical-about-firefox-os\">موظف في Mozilla يتحدث عن نظام Firefox OS للهواتف المحمولة القادم في مطلع العام 2013</a> (بالإنكليزية)</p>\n","title":"ملخصات (1)","filename":"digest-1.json","id":"digest-1","date":"2012-10-17T00:00:00.000Z","image":null,"description":"هذه مجموعة من المقالات التي قرأتها مؤخرًا وتتناول مواضيع متنوعة، وقمت بتلخيصها باستخدام Diigo وأخذت منها ما يهمني وقررت أن أنشرها لكي أريحك من عناء قراءة المقالات كاملة، على أية حال، يمكنك قراءة المقالات كاملة بالضغط على الروابط في العناوين الفرعية. سأكتب هذه الملخصات في كل مرة أجمع فيها عددًا مناسبًا من المقالات المفيدة.","images":0,"videos":0,"tracks":0,"links":10,"type":"text"}