{"html":"<h1 id=\"-facebook-\">كيف تتحكّم بحياتك الاجتماعيّة على Facebook؟</h1>\n<p>في البداية كان البريد الإلكترونيّ وسيلة أساسيّة للتّواصل، ولأنّ المستخدم هو من يختار، فإنّ بإمكانه استخدامه لأشياء مختلفة: للعمل أو للتّرفيه أو لنشر الأخبار (أو الأكاذيب) أو للتّواصل مع من يعرفهم ولكنّهم بعيدون عنه.<br>لم يترافق انتشار البريد الإلكتروني على حدّ علمي بوصف Social (اجتماعيّ) الّذي يتردّد اليوم بكثرة، بدايات ما يسمّى &quot;الحياة الاجتماعيّة على ويب&quot; كانت مع برامج الدردشة، أصبحت حدود الأشياء الّتي بإمكانك فعلها بالدّردشة أوسع: التّواصل لحظيّ؛ وستحتاج دومًا أن تبقى أمام شاشة جهازك لتردّ على كلّ رسالة في وقتها، وسيفعل الطّرف الثّاني الشّيء نفسه، ثمّ تكتشفان أنّه ما من داعٍ لإهدار الوقت هكذا، إذ لا فائدة فعليّة تحقّقها الدّردشة عادةً؛ فكلّ برامج الدّردشة يروّج لها بكلمات مثل connect وmeet وfun... وهي لا توحي بفائدة على الاطلاق.<br>في 2004 ظهرت &quot;الشّبكات الاجتماعيّة&quot; كمفهوم وكنماذج هي Facebook وTwitter، ربّما كانت MSN شبكة اجتماعيّة بدائيّة لكنّها لم تضع مفهوم الحياة الاجتماعيّة كما هو اليوم.<br>Facebook بحدّ ذاته أصبح مفهومًا وتجاوز حدود النّموذج، على العكس من ذلك أرى أنّ الشّبكات الاجتماعيّة الجديدة تحاول نسخ Facebook: على سبيل المثال: Google+.<br>Twitter لا يتمتّع بشهرة كبيرة في المجتمع السّوريّ، إلّا مؤخّرًا بدأت تظهر مئات الحسابات بأسماء زائفة وغالبًا يبدأ مستخدم Twitter بعمل retweet لتغريدات المشاهير، ثمّ ينطلق فيه ويدخل مرحلة التّعلّق وربّما الإدمان.<br>لكنّني أريد في هذه التّدوينة الحديث عن Facebook بالذّات لأنّه أصبح يمثّل الوجهة الأولى (وربّما الوحيدة) لكثير من النّاس.  </p>\n<h3 id=\"-facebook-\">لماذا ينشِئ المرء حسابًا على Facebook؟</h3>\n<p>لأمور كثيرة، قد يكتشف لاحقًا أنّه كان بالإمكان إنجازها بطرق أكثر كفاءة وسرعة، منها:</p>\n<h4 id=\"-facebook-facebook-\"><strong>التّواصل مع الأصدقاء والعائلة وزملاء العمل</strong>هذا بالأساس ما أُنشئ Facebook من أجله، تعلّمتُ أن أعود للغايات في كلّ مرّة أضلّ فيها الطّريق؛ فإذا كان Facebook وضع أساسًا لهذا، فلماذا أستخدمه لأغراض أخرى؟ لماذا نكتب بأسماء وهميّة ونصادث أشخاصًا لا نعرفهم؟ ما القيمة الّتي تضيفها لحياتي معرفة أنّ (شخصًا ما) لم ألتقِ به قطّ قد أنهى امتحاناته؟ أو أنّه قد تناول الغداء مع شخص آخر لا أعرفه كذلك؟ هنا أريد أن أقف وأصرخ بغضب: توقفوا عن هذه السّخافات، أنهوا هذه المهزلة!</h4>\n<h4 id=\"-\"><strong>الاطّلاع على الأخبار</strong></h4>\n<p>الشّبكات الاجتماعيّة هي أيضًا وسائل إعلامٍ قويّة، قد يُختَلف حول ما إذا كانت أقوى من الإعلام التّقليديّ أو أنّها ليست كذلك. لا يهمّ، ما يهمّني هو أن المستخدمين سيقرؤون شيئًا يُدعى News feed (نشرة الأخبار) وللحظة سيبدو لهم أنّهم يمتلكون زمام أمورهم وأنّهم اختاروا بالفعل ما يقرؤونه، لكنّ الأمر أعقد من هذا بكثير. الحقيقة أنّ الموضوع يحتاج منّي الكثير من الشّرح لكنّ الفكرة راسخة لديّ: مع الوقت ستصبح أسيرًا لدى Facebook، سيُطلَق سراحك فقط بعدما تكتشف أنّك أسير، وستحتاج الكثير من الجهد لفكّ الوثاق.</p>\n<p>باستطاعتي ضرب عدّة أمثلة: هل فعلاً نستغلّ فضاء الإنترنت الحرّ للحصول على ما يفيدنا أمّ أنّ أوّل ما نفعله عند فتح المتصفّح هو كتابة حرف f عند البدء وسيكمل المتصفّح الكلمة لأنّنا أدمنّا Facebook؟</p>\n<p>في نفس الوقت لا يبدو لي أنّ Facebook كموقع ويب وبأفكاره وأسسه موقع غير مفيد، لكنّ الطّبيعة البشريّة وعامل &quot;الحياة الاجتماعيّة&quot; والتّركيز على عالمك كفرد، كلّ هذا وأكثر، يجعلك تصاب بمرض Facebook.</p>\n<p>لا أعرف إن كان أحد قد سبقني بتشخيص هذا المرض، لكنّني أصبحت متأكّدًا من كونه مرضًا حقيقيًّا نفسيًّا وله أعراض؛ من هذه الأعراض: حبّ النّفس والأنانيّة والنفاق والتّعصّب. لأنّك تحبّ نفسك، ستحرص على أن تُظهِر منها فقط ما يجعلها راضية، وستخفي عيوبك قدر المستطاع، لن تنشر تفاصيل حياتك الكئيبة والمظلمة، تصفّح الملفّات الشّخصيّة لأصدقائك وستعتقد لوهلة أنّهم لم يعانوا مرّة في حياتهم بل هم أشخاص سعيدون وناجحون. هذا هو النّفاف الّذي ذكرتُه. نحن ملايين من المنافقين في حياتنا الاجتماعيّة وبينما نعيش حياتنا الحقيقيّة بحلوها ومرّها، نعيش حياتنا على Facebook بحلوها فقط، وربّما بسكّر زيادة! وهذا يبدو لي سبب الإدمان الأصليّ وليس كما يظنّ كثيرون &quot;إضاعة الوقت&quot;.</p>\n<p>لديّ الكثير لأقوله لكنّني عاجز عن جمعه كلّه، لكن بعد أن عرفتُ كلّ هذا بدأت تتكوّن لديّ الإرادة لفكّ الوثاق، إن عرفتَ كلّ هذا وصدّقته ثمّ لم تقعل شيئًا فأنت عبدٌ يحبُّ أن يبقى أسيرًا. على كلّ حال، لا أنتظر من أحد، ولا أتوقّع إطلاقًا أن تُحدِث هذه المقالة لدى أحد ممّن قرأها رغبة فوريّة في التّغيير، لكنّها بداية الطّريق، وطرقة على باب الفكر المقفل، سيتبعها طرقات أخرى.</p>\n<h3 id=\"-\">ماذا أفعل الآن؟</h3>\n<p>أقول إنّني اكتشفت العلاج الشّافي لمرض Facebook، لكن يجب قبل تعاطيه البدء أخذ بعض المقويّات إلى أن يحين وقت العلاج.</p>\n<p>المقويّات هي:</p>\n<ol>\n<li>استخدم قوائم الأصدقاء وقوائم الاهتمامات: نعم، Facebook فعل شيئًا جيّدًا جدًّا مؤخّرًا، ويبدو لي هذا من آثار التّنافس المحمود مع Google+. قوائم الأصدقاء تسمح لك بتصنيف من أضفتهم على Facebook إلى مجموعات: الأصدقاء المقرّبون، العائلة، زملاء الدّراسة، زملاء العمل؛ هذه هي القواءم الأساسيّة وبإمكانك (ويجب أن تفعل هذا إذا أردت الشفاء) صنع قوائم جديدة. من القوائم الّتي أنشأتها أنا: المهتمّون بالتّقنيّة، من لا أعرفهم شخصيًّا، أصدقاء عرفتهم عبر Twitter. القائمة الثّانية (من لا أعرفهم شخصيًّا) مهمّة جدًّا للمرضى: ابحث عن هؤلاء وأضفهم إلى القائمة ولا تستثنِ منهم أحدًا. فيما بعد سيكون بإمكانك إخفاء معلومات ومنشورات محدّدة عن قوائم تختارها أو إظهارها لها دون غيرها أو الاطّلاع على منشورات أفرادها على حدة.</li>\n<li>هذا هو محور العلاج: أن تطلع على أخبار من يهمّك وتتجاهل أخبار هؤلاء الّذين ينشرون صور اختباراتهم وأصدقائهم الّذين لم تقابلهم مرّة وقصص حيواناتهم الأليفة وهراءً مشابهًا (حسنًا أعتقد أنّني بالغت قليلاً!)</li>\n<li>شخصيًّا من يهمّنى الاطّلاع على نشاطهم وأخبارهم هم أصدقائي المقرّبون وعائلتي وزملاء الدّراسة، وأمّا من تبقّى فلا تعنيني حياتهم الشّخصيّة في شيء ولا أعتقد أنّ باستطاعتهم إثراء حياتي.</li>\n<li>لاحظ أنّك أنت نفسك ستكون من هؤلاء بالنّسبة للآخرين فلا تهتمّ، فقد اكتشفت أنّ العدوى تنتشر ببطء لكنّها تنتشر واسعًا، واللّقاح الوحيد هو أن تملأ وقت فراغك بشيء أكثر إفادة قبل أن تنضمّ لـFacebook، لا لقاح آخر حاليًّا!و</li>\n<li>الآن وقد بدأت بتناول المقويّات، ستبدأ بالصّراع مع نفسك فالمرض يقاوم إرادتك وعليك أن تبدأ بالعلاج! ستشعر بالحنين لأيّاك القديمة بعد هذا التّغيير، ربّما يفيدك عندئذٍ أن تطّلع على خطّك الزّمنيّ (Timeline، وهو أيضًا شيء مفيد أضافه Facebook) لتكتشف كم كنت مريضًا وكم تحسّنت. عندها ستضعف رغبتك بالعودة.</li>\n<li>أمّا العلاج الشّافي، فهو الهدف النّهائيّ الأكثر صعوبة، لكنّني لم أجد غير التّخلّص من الحساب نهائيًّا علاجًا شافيًا لمرض Facebook، لا شيء غير ذلك مع الأسف. لكنّ عليك الانتباه أنّك لا تستطيع فعل هذا بين ليلة وضحاها، لأنّ القفز من علٍ إلى الدّرك (وهنا يجب أن أقول العكس) مؤلمٌ للغاية، عليك استخدام الدّرج!</li>\n<li>تذكّر: عليك أيضًا أن تجد بديلاً لكلّ غاية سليمةٍ استخدمت Facebook من أجلها، ويشترط فيها أن تخلوَ من جراثيم المرض!</li>\n</ol>\n","title":"كيف تتحكّم بحياتك الاجتماعيّة على Facebook؟","filename":"facebook.json","id":"facebook","date":"2012-06-08T00:00:00.000Z","image":null,"description":"في البداية كان البريد الإلكترونيّ وسيلة أساسيّة للتّواصل، ولأنّ المستخدم هو من يختار، فإنّ بإمكانه استخدامه لأشياء مختلفة: للعمل أو للتّرفيه أو لنشر الأخبار (أو الأكاذيب) أو للتّواصل مع من يعرفهم ولكنّهم بعيدون عنه.لم يترافق انتشار البريد الإلكتروني على حدّ علمي بوصف Social (اجتماعيّ) الّذي يتردّد اليوم بكثرة، بدايات ما يسمّى \"الحياة الاجتماعيّة على ويب\" كانت مع برامج الدردشة، أصبحت حدود الأشياء الّتي بإمكانك فعلها بالدّردشة أوسع: التّواصل لحظيّ؛ وستحتاج دومًا أن تبقى أمام شاشة جهازك لتردّ على كلّ رسالة في وقتها، وسيفعل الطّرف الثّاني الشّيء نفسه، ثمّ تكتشفان أنّه ما من داعٍ لإهدار الوقت هكذا، إذ لا فائدة فعليّة تحقّقها الدّردشة عادةً؛ فكلّ برامج الدّردشة يروّج لها بكلمات مثل connect وmeet وfun... وهي لا توحي بفائدة على الاطلاق.في 2004 ظهرت \"الشّبكات الاجتماعيّة\" كمفهوم وكنماذج هي Facebook وTwitter، ربّما كانت MSN شبكة اجتماعيّة بدائيّة لكنّها لم تضع مفهوم الحياة الاجتماعيّة كما هو اليوم.Facebook بحدّ ذاته أصبح مفهومًا وتجاوز حدود النّموذج، على العكس من ذلك أرى أنّ الشّبكات الاجتماعيّة الجديدة تحاول نسخ Facebook: على سبيل المثال: Google+.Twitter لا يتمتّع بشهرة كبيرة في المجتمع السّوريّ، إلّا مؤخّرًا بدأت تظهر مئات الحسابات بأسماء زائفة وغالبًا يبدأ مستخدم Twitter بعمل retweet لتغريدات المشاهير، ثمّ ينطلق فيه ويدخل مرحلة التّعلّق وربّما الإدمان.لكنّني أريد في هذه التّدوينة الحديث عن Facebook بالذّات لأنّه أصبح يمثّل الوجهة الأولى (وربّما الوحيدة) لكثير من النّاس.","images":0,"videos":0,"tracks":0,"links":0,"type":"text"}