{"html":"<h1 id=\"-firefox\">كيف تفعّل تعدد المستخدمين في Firefox</h1>\n<p>إحدى أهم ميزات Chrome التي افتقدتها عند الانتقال إلى Firefox إمكانية إنشاء أكثر من مستخدم على المتصفح، بحيث يكون لكل مستخدم حساباته الخاصة وعلاماته وإضافاته وتطبيقاته... وذلك ضمن المستخدم الواحد على النظام، بإمكانك مثلاً أن تستعمل حسابًا للعمل وآخر للبيت على نفس الجهاز، أو حسابًا لأخيك الصغير خوفًا من أن يعرّض حسابك للخطر...<br>كنت في السابق أعلم أن Firefox يدعم تعدد المستخدمين لكن بطريقة مختلفة وتحتاج شيئًا من البحث، وعندما احتجت إلى تعدد المستخدمين، كل ما فعلته أنني بحثت عن إضافة للمتصفح تجعل التبديل بين الحسابات أسهل، ووجدتها خلال دقائق قليلة.</p>\n<ol>\n<li>أولاً: عليك أن تُنشئ الحسابات التي تريد استخدامها، اضغط Win+R في Windows أو Alt+F2 في Ubuntu (ومشتقاته) واكتب firefox -p، الأمر الذي يعني تشغيل Firefox مع العامل p اختصارًا لـprofile والذي يقوم بعرض مدير الملفات الشخصية profiles والتي سنعتبرها حسابات أو مستخدمين.</li>\n<li>ستعرض نافذة صغيرة فيها حسابك الرئيسي الذي تستخدمه، وبإمكانك إنشاء مستخدم جديد بالضغط على زر Create Profile...</li>\n<li>الجميل في Firefox أنه بإمكانك إنشاء الملف الشخصي في أي مجلد تشاء بعكس Chrome، والأمر مفيد لأنه بقليل من النباهة يعني إمكانية أن تستفيد من ذلك بمزامنة ملف الشخصي إلى Dropbox بحيث يكون Firefox على جهازك الأول نسخة طبق الأصل عنه في جهازك الثاني بدون الحاجة لاستخدام أي نوع من إضافات المزامنة أو مزامنة Firefox التي أعتبرها أقل جودة من مقابلها في Chrome.</li>\n<li>بعد إنشاء الحساب ستعود إلى النافذة الصغيرة إيّاها، اختر أي مستخدم تشاء ثم انقر زر Start Firefox، سيبدأ Firefox مستخدمًا الملف الشخصي الذي اخترته، ثم <a href=\"https://addons.mozilla.org/en-US/firefox/addon/profileswitcher/\">ثبّت هذه الإضافة</a> التي تسمح بالانتقال السريع بين &quot;المستخدمين&quot;، حتى دون الاضطرار لإغلاق واحد التبديل للآخر.</li>\n<li>أغلق Firefox ثم نفذ الخطوة الأولى ثانية واختر المستخدم الآخر ثم ثبت الإضافة ثانية على هذا المستخدم.</li>\n</ol>\n<p>في قائمة ملف يظهر خيار التبديل بين المستخدمين، وتتيح هذه الإضافة خيارات جيدة منها إمكانية ضبطها للتبديل بين المستخدمين دون إغلاق أي منهم أو السؤال كل مرة أو إجبار إغلاق الأول قبل الانتقال للثاني.</p>\n","title":"كيف تفعّل تعدد المستخدمين في Firefox","filename":"firefox.json","id":"firefox","date":"2013-03-06T00:00:00.000Z","image":null,"description":"إحدى أهم ميزات Chrome التي افتقدتها عند الانتقال إلى Firefox إمكانية إنشاء أكثر من مستخدم على المتصفح، بحيث يكون لكل مستخدم حساباته الخاصة وعلاماته وإضافاته وتطبيقاته... وذلك ضمن المستخدم الواحد على النظام، بإمكانك مثلاً أن تستعمل حسابًا للعمل وآخر للبيت على نفس الجهاز، أو حسابًا لأخيك الصغير خوفًا من أن يعرّض حسابك للخطر...كنت في السابق أعلم أن Firefox يدعم تعدد المستخدمين لكن بطريقة مختلفة وتحتاج شيئًا من البحث، وعندما احتجت إلى تعدد المستخدمين، كل ما فعلته أنني بحثت عن إضافة للمتصفح تجعل التبديل بين الحسابات أسهل، ووجدتها خلال دقائق قليلة.","images":0,"videos":0,"tracks":0,"links":1,"type":"text"}