{"html":"<h1 id=\"gnome-3-\">GNOME 3: فرصة أخرى للمصادر المفتوحة على الحواسيب</h1>\n<p>يبدو أنني كنت مخطئًا بشأن Linux على سطح المكتب، ويبدو أن حكمي كان صادرًا عن شعور بالإحباط بعد تجربتي لكثير من التوزيعات التي يُفترض أن تكون سهلة الاستخدام، وبعد المشاكل التي واجهتني، فقد كنت قررت أن أترك توزيعات Linux إلى الأبد، لكنني منذ أقل من شهر اضطررت لإعادة تثبيت Windows تخلصًا من كثير من البرامج التي ثبتتها فيما مضى ولم أعد محتاجًا لها. كنت أريد إعادة تثبيت Windows 7 لكنني قررت أن أمنح Linux فرصة أخرى، وأن أثبته إلى جانب Windows، لكنني قمت بتثبيت Linux Mint 14 أولاً وقررت تجربتها، ولم أقم بتثبيت Windows بعدها.</p>\n<p>هذه المرة قررت أن أجرب GNOME 3.6، وهي النسخة الأحدث من بيئة سطح المكتب الأكثر شهرة بين مستخدمي Linux، وهذه النسخة بالتحديد لم تلقَ قبول المستخدمين القدامى، بسبب التغييرات الجذرية التي أدخلتها على مفاهيم استخدامها؛ وكان من بين الرافضين لها لينوس تورفالدز نفسه، والذي كان يستعمل GNOME 2. وكذلك فإن GNOME شقت لنفسها طريقًا مختلفًا عمّا سلكه مطوّرو Ubuntu الذين قرّروا إنشاء واجهتهم الخاصة Unity.</p>\n<p>كنت منذ أكثر من سنة ونصف جربت GNOME 3 في نسخة أولية منها، وكانت مليئة بالثغرات والأخطاء، أشياء بسيطة لم تكن تعمل، وكانت بطيئة وغير عمليّة. كان وضع GNOME حينئذٍ حرجًا، بعد أن هجرها مستخدموها القدامى، ولم تفلح في جذب مستخدمين جدد بسبب أدائها غير المستقرّ.</p>\n<p>لكن الوضع فيما بعد تحسّن، حتى أن لينوس تورفالدز الذي كان انتقدها في إصدارات سابقة عاد ليبدي رضاه إلى حدّ ما على التحسينات اللاحقة.</p>\n<p>مؤخرًا ثبتت النسخة المستقرة الأحدث 3.6 واستخدمتها على Linux Mint 14 كنظام تشغيل وحيد على جهازي، وإلى الآن أستخدمها ولم أحتج إلى Windows.</p>\n<p>من التغييرات الجذرية التي أدخلت على GNOME 3 حذف شريط المهام التقليدي الذي يُشاهد في Windows وMac OS X وKDE والنسخ القديمة من GNOME، وكذلك حذف زر تصغير النافذة، بمعنى إلغاء فكرة تصغير النوافذ.</p>\n<p>السبب في هذه التغييرات هو الاتجاه السائد حاليًا نحو التركيز على الهواتف الذكية، حتى أن الأفكار التي وُجدت على هذه الهواتف ومن بعدها على الحواسب اللوحية بدأت تظهر على الحواسيب الشخصية، وإذا نظرنا إلى الأمور من هذه الجهة فإننا نلاحظ أن مستخدمي الهواتف الذكية الجديدة لا يقومون &quot;بتصغير&quot; البرامج عند الانتقال من واحد لآخر، وكذلك فإنه لا وجود لشريط مهام في هاتف ذكي، وعليه فإن هذا المستخدم يألف نمطًا من التعامل مع التطبيقات يختلف عما يُشاهد على الحواسيب، وإذا أردنا منع حصول هذا التعارض، فعلينا إيجاد رؤية موحدة لمفاهيم التعامل مع التطبيقات المتعددة.</p>\n<p>لا داعي لتصغير النوافذ، فقط انتقل من تطبيق إلى آخر، خصوصًا أن التطبيقات اليوم معظمها يحتاج لأن يملأ الشاشة، كمتصفح الويب ومشغل الفيديو وقارئ المستندات...  </p>\n<p>وكذلك فإنّه لا داعي لوجود شريط للمهام للتنقل بين البرامج، كل ما عليك فعله هو أن تضغط على زر Super (زر Windows) في لوحة المفاتيح أو أن تسحب مؤشر الفأرة نحو الزاوية العلوية اليمنى من الشاشة (أو اليسرى في اللغات التي تكتب من اليسار إلى اليمين)، وستحصل على ما يُسمى باسم Activities Overview، وهو شاشة تعرض للمستخدم نظرة عامة على التطبيقات المفتوحة بمعاينات كبيرة نسبيًّا وحيّة (تتغيّر لحظيًّا وليست جامدة) وإلى طرف الشاشة البرامج المفضلة التي قام المستخدم بتثبيتها إلى هذا الطرف، مع أيقونات البرامج المفتوحة ذاتها، وإلى الطرف المقابل لوحٌ يعرض مساحات العمل التي تٌُستخدم، وهي ديناميكية، بحيث إن عددها يساوي عدد مساحات العمل الممتلئة زائدة واحدًا، في حال رغب المستخدم بإضافة تطبيقات إلى مساحة فارغة، فتظهر مساحة أخرى فارغة، وهكذا...<br>إن التخلص من شريط المهام يزيد في المساحة العمودية التي يمكن للتطبيقات أن تملأها مقارنة بـWindows، وهذا له قيمة كبيرة على شاشات الأجهزة المحمولة Laptops التي يكون ارتفاع الشاشة فيها محدودًا.  </p>\n<p>أيضًا في منتصف الشاشة من أعلى مربع بحث وكل ما عليك أن تبدأ بكتابة حرف لتظهر التطبيقات المثبتة ونتائج البحث في الملفات والبرامج وما إلى ذلك، وليس عليك بالضرورة أن تضغط على مربع البحث لتبدأ في الكتابة فيه.</p>\n<p>إذًا لفتح برنامج جديد: اضغط زر Super ثم اكتب بضع حروف منه، واضغط Enter لفتح أول نتيجة (تمامًا كما في Windows وواجهة Unity في Ubuntu).</p>\n<p>وللتنقل بين البرامج المفتوحة: اضغط زر Super واختر البرنامج، أو اسحب مؤشر الفأرة إلى الزاوية العلوية اليمنى ثم اختر البرنامج، وهذا يقابل في Windows شريط المهام ما عدا أنك لا تحتاج إلى المرور على معاينات كل برنامج لتجد ما تبحث عنه، بل ستحصل على نظرة عامة لكل البرامج المفتوحة، وكذلك إن لم تجد البرنامج مفتوحًا فكل ما عليك أن تفعله هو أن تبدأ في كتابة بضعة حروف، فإذا كان البرنامج مفتوحًا انتقلت إليه، وإلا فإنه سيُفتح.</p>\n<p>من خلال التجربة يبدو هذا النموذج في الاستخدام عمليًّا وأكثر سرعة من كل من Unity وWindows، ففي Unity إذا أردت التنقل بين مساحات العمل عليك أن تضغط على زر التنقل بينها في المشغل، أو تضغط Super+S، وهذا يُعتبر أثناء العمل أكثر استهلاكًا للوقت والجهد، ويعني ضغط زرين أو التحرك بالفأرة والنقر (خطوتان).<br>حاليًا انتقلت للعمل على Unity لأن GNOME Shell لم تعد تعمل بسب انتقالي إلى تحديثات شبه يومية (من مخزن غير مستقرّ)، وعادةً فإن هذه المخازن تكون موجهة للمطورين والراغبين في التجربة حتى لو كانت على حساب تعطل الواجهة بالكامل، وأنا منهم :)</p>\n<p>أنتظر بشوق 27 آذار موعد صدور النسخة الجديدة من GNOME Shell التي ستشمل تحسينات كبيرة على البحث والخصوصية، سأعود لأكتب عنها قريبًا.</p>\n","title":"GNOME 3: فرصة أخرى للمصادر المفتوحة على الحواسيب","filename":"gnome-3.json","id":"gnome-3","date":"2013-02-21T00:00:00.000Z","image":null,"description":"يبدو أنني كنت مخطئًا بشأن Linux على سطح المكتب، ويبدو أن حكمي كان صادرًا عن شعور بالإحباط بعد تجربتي لكثير من التوزيعات التي يُفترض أن تكون سهلة الاستخدام، وبعد المشاكل التي واجهتني، فقد كنت قررت أن أترك توزيعات Linux إلى الأبد، لكنني منذ أقل من شهر اضطررت لإعادة تثبيت Windows تخلصًا من كثير من البرامج التي ثبتتها فيما مضى ولم أعد محتاجًا لها. كنت أريد إعادة تثبيت Windows 7 لكنني قررت أن أمنح Linux فرصة أخرى، وأن أثبته إلى جانب Windows، لكنني قمت بتثبيت Linux Mint 14 أولاً وقررت تجربتها، ولم أقم بتثبيت Windows بعدها.","images":0,"videos":0,"tracks":0,"links":0,"type":"text"}