{"html":"<h1 id=\"-google-\">رأيي بـGoogle+</h1>\n<p>حصلت على دعوة للانضمام إلى Google+ منذ فترة لكنّني لم أستطع الاشتراك بسبب الضّغط الزّائد، قرأت<a href=\"http://lifehacker.com/5818522/this-is-lifehackers-summer-series-get-a-google-plus-invite-build-a-bug-trap-and-save-money-with-your-phone\">مقالة على Lifehacker</a> تشرح كيفيّة &quot;التّحايل&quot; على Google+ والانضمام إليها رغم إيقاف قبول طلبات الاشتراك. طلبت من صديقي <a href=\"https://plus.google.com/102851994961608957144\">بشر</a> أن يساعدني في إتمام الخطوات واستطعت الاشتراك البارحة!</p>\n<p>قبل أن أنضمّ إلى الشّبكة كنت قد قرأت العديد من المقالات حولها وتعرّفت على عناصرها الرئيسيّة، لذا لم أشعر &quot;بالغربة&quot; عندما أتممت التّسجيل وظهرت الصّفحة الأولى.</p>\n<p>هذه ليست مراجعة... هذا رأي شخصيّ منحاز :). أعرف أنّي منحاز لـGoogle ومنتجاتها... أعتمد على Gmail وReader وDocs والبحث طبعًا. ستجد أنّ ما سأكتبه هو شيء يشبه المدح إن صحّ التّعبير؛ لكن لا يعني هذا أن أتغاضى عن سلبيّات Google+ (نعم نعم هناك سلبيّات!).  </p>\n<p>ليس جديدًا أنّ Google+ تحاول اختراق سوق الشّبكات الاجتماعيّة... فلـGoogle تجارب سابقة في هذا المجال، أو باﻷحرى تجربتان لا يمكن القول عنهما سوى أنّهما فاشلتان، الأولى Google Wave والثّانية Google Buzz (أو نبضات Google كما تسمّيها بالعربيّة).</p>\n<ul>\n<li>برأيي أن فشل الخدمة الأولى كان بسبب فكرتها الجديدة. نعم، فالمستخدم للشّبكات الاجتماعيّة لا يريد أشياء كهذه... يريد صندوق نصّ يكتب فيه حالته... ويريد مساحة ينشر فيها صور أصدقائه... وأحيانًا آراءه وشعوره.</li>\n<li>أمّا الثّانية فقد فشلت لأنّها تقليد صارخ لـTwitter لم يضف جديدًا ولأنهّا انتهكت خصوصيّة المستخدمين.</li>\n</ul>\n<p>بعد فشل الخدمتين السّابقتين حزمت Google أمرها وقرّرت أن تعمل بإتقان ومن غير تسرّع. قرّرت أن تعطي وقتًا كافيًا لمهندسيها ومصمّميها.المهمّ أن تكون الشّبكة ناجحة.</p>\n<p>أستطيع تخيّل ما فكّر به المهندسون والمصمّمون: يجب أن يأنس المستخدم Google+ منذ البداية. لم يجدوا حرجًا في نسخ (أو محاكاة) واجهة Facebook مع انتباههم لإضافة عناصر جديدة تجذب المستخدمين كي لا يكون مصيرها كمصير Buzz المنسوخة عن Twitter.</p>\n<h1 id=\"-google-\">أفكار حول Google+</h1>\n<ul>\n<li><strong>الاستفادة من خبراتها:</strong> فشل Buzz وWave لا يعني رميهما في القمامة! فـWave قدّمته لمنظمة Apache وBuzz لا يزال موجودًا. فكرة المتابعة كما في Twitter تجعل من Google+ غنيًّا أكثر من Facebook، يمكن القول أن باستطاعة Google+ أن يحلّ محلّ Twitter وFacebook، فخدمات Twitter (التّدوينات القصيرة ومشاركة المكان ومشاركة الصور...) كلّها موجودة في Facebook وGoogle+ لكنّ الاختلاف بين اﻷخيرين يكمن في أنّ Google+ فيه المزيد من خواصّ Twitter (مشاركة الموقع وإعادة نشر النصوص، تحديدًا).</li>\n<li><strong>تبسيط المشاركة:</strong> التركيز على فكرة الدّوائر لجعل المشاركة أسهل، وكذلك بساطة واجهة إعدادات الخصوصيّة والتّعديل التّفاعليّ للملفّ الشّخصيّ (أي النّقر على جزء من الملفّ الشخصيّ كالمدينة مثلًا ثمّ تعديل إعداد الخصوصيّة الخاصّ به) كلهّا أمور تجعل Google+ يتفوّق بسهولة في مجال الخصوصيّة؛ أضف إلى ذلك أنّ Google أقلّ شرًّا من Facebook (أقول أقلّ شرًّا وليست أفضل :P).</li>\n<li><strong>سدّ نواقص المنافسين:</strong><ul>\n<li>في Facebook لا يمكن مشاركة الحالة (status)... عليك نسخ الحالة ولصقها في مربّع المشاركة ثمّ نشرها... هذا يضيّع مصدر النّصّ. Google حلّت المشكلة وسمحت بمشاركة الحالات مع ذكر صاحب الحالة الأصليّ بوضوح.</li>\n<li>في Twitter يمكنك عمل retweet للتّغريدات (tweets) فقط إذا كان حساب المغرّد عامًّا (public)، بمعنى أنّه لا يمكنك طرح تغريدة مقفلة دون الأخرى: إمّا أن تكون تغريداتك عامّة كلّها أو مقفلة كلّها. في Google+ يمكنك التّحكّم بإمكانيّة المشاركة لكلّ مشاركة على حدة.</li>\n<li>في Facebook يمكنك عمل مشاركة لصورة أو رابط أو فيديو من شخص آخر، لكن لن يعلّم الشّخص الّذي نشره بأنّك شاركته، في Google+ يمكنك بسهولة معرفة من شارك منشوراتك وكم عددهم، ويمكنك أيضًا منع إعادة النّشر لكلّ مشاركة على حدة كما ذكرت أعلاه.</li>\n<li>لم يأت Facebook وTwitter مترجمين إلى لغات كثيرة، بل اعتمدوا على المستخدمين في التّرجمة... أمّا Google+ فهو مترجم إلى لغات عديدة، ومنها العربيّة. هذا سيدعم Google+.</li>\n<li>أيضًا مجموعات Facebook ووسوم الصور (tags) أمران مزعجان فيه... أن يضيفك شخص إلى صورة رغمًا عن إرادتك ويدخلك في مجموعة لا تريها لهو أمر مقيت فعلاً! Google+ تحلّ مشكلة الوسوم مبدئيًّا عن طريق السّماح للمستخدم بفرض طلبإذنه قبل أن يضع له أصدقائه وسمًا في صورة. أمّا بالنّسبة للمجموعات فهي غير موجودة الآن (ربّما هذا هو الحلّ الأمثل :P).</li>\n</ul>\n</li>\n<li>تطبيقات<strong>الهواتف المحمولة</strong> في Google+ واعدة... ومدعومة بكثير من الخيارات منذ أن طرحت الخدمة. لا تنسَ أيضًا أنّ لدى Google نظام تشغيل خاصّ لهواتف المحمولة هو الأوسع انتشارًا والأكثر نموًّا. ولديها أيضًا <strong>Chrome متصفّح الإنترنت وChrome OS نظام التّشغيل السّحابيّ</strong>. إذا استطاعت الشّركة إيجاد طريقة تقوّي بها كلّ منتجاتها معًا بدعم الشّبكة الجديدة هذه، فسيكون لـFacebook مصير MySpace.</li>\n<li>ستستفيد Google من مشاركات المستخدمين و<strong>زرّ +1</strong> في نتائج بحثها. تخيّل كم سيكون هذا رائعًا! ستحصل على ما تريده من بحث Google تمامًا!</li>\n<li><strong>Gmail</strong>... وما أدراك ما Gmail... هو أشرس خدمة بريد إلكترونيّ على الإطلاق... حقيقةً أستغرب كيف يمكن ان تكون خياراته كلّها مجّانيّة... Gmail يسبق منافسيه بسنين ضوئيّة؛ سيكون تكامله مع Google+ &quot;ضربة معلّم&quot;. سيجلب هذا المزيد من المستخدمين إلى Gmail، وبالتّأكيد سيجلب مستخدمي Gmail إلى Google+، سيسهّل على Google أيضًا عمليّة فرز spam بمساعدة المستخدمين.</li>\n<li><strong>Docs</strong> أو المستندات... لعلّها ستصبح أكثر خدمات Google نموًّا إن أحسنت Google دمجها مع الشّبكة، تخيّل إنشاء حلقة بحث وتحريرها بشكل جماعيّ مع أصدقائك! (اﻷمر موجود لكنّه يفقتد للنّكهة الاجتماعيّة)... ثمّ إجراء chat معهم لمناقشة أفكاره وتصحيح الأخطاء، مع الاستعانة بمحرّك البحث وبالاهتمامات Sparks ثمّ إرساله إلى خدمة الطّباعة السّحابيّة Google Cloud Print مثلاً... كلّ هذا وأنت تستخدم Chrome. هذا سيكون شيئًا عظيمًا يا رجل!</li>\n<li><strong>الإعلانات</strong>... أكبر مصدر دخل لـGoogle ستجعل من Google+ مصدر دخل مهمّ جدًّا لـGoogle، ومن إضافات حجب الإعلانات تجارة رابحة :) (على الأقل بالنّسبة لي!).</li>\n<li><strong>Picasa</strong> خدمة قويّة جدًّا في مجال تحرير الصّور، ربّما لم تنافس Flickr من ناحية الانتشار، لكنّها تملك من الخواص ما يجعل دمجها في شبكة اجتماعيّة أمرًا رائعًا؛ لم أجد برنامجًا أو خدمة تفوّقت على Picasa في اكتشاف الوجوه، مثلاً.</li>\n</ul>\n<p>سلبياتها</p>\n<ul>\n<li>لنكن صريحين، هناك أشياء في Google+ لا تعجبني :) أوّلها عدم وجود الصّفحات... وهذه محلولة، قالت Google أنّها ستقدّم شيئًا للأعمال... وأنّها شعرت بالحرج عندما سألت شركة Ford عن جنسه (أو ربّما جنسها؟) - تقصد أن الشّركة أنشئت ملفًّا شخصيًّا لعدم وجود الصّفحات كما في Facebook.</li>\n<li>هناك قضيّة أخرى تتعلّق بالدّوائر... لو كنت تدردش بالفيديو مع عائلتك فيمكن لأيّ عضو في نفس الدّائرة أن ينضمّ إلى الدّردشة. هذا الأمر مزعج فهناك من عائلتي من لا أرغب أن ينضمّ إلى محادثة الفيديو مع أخواتي وإخوتي، وسيجبرني هذا على عمل دائرة خاصّة بأهلي المقرّبين، ودائرة أخرى للعائلة... وستتكاثر الدّوائر!</li>\n<li>السلبيّة الأخيرة: أضافت الشبكة طريقة جديدة للتّواصل زيادة على Gmail وBuzz وChat... على Google+ أن تتخلّص من Buzz كاسم، وتدمجه مع Google+ بسرعة! أعتقد أنّها ستفعل ذلك. ثمّ عليها أن تدمج بقيّة طرق التّواصل معًا. أجد جهات الاتصالات في Gmail مربكة جدًّا إذا ما أضفنا إليها دوائر Google+ ومتابعي Buzz.</li>\n</ul>\n<p>تسألني هل ستنجح Google+؟ أقول لك ستنجح نجاحًا باهرًا... سيبقى لـFacebook وTwitter مستخدمون مخلصون أو لا يحبوّن التّغيير... وستمضي Google+ في جذب مستخدمين جدد ربّما، أو ربّما ينتهيان بمصير أسود. إن كنت لا تصدّقني، فاقرأ تاريخ MySpace واسأل مؤسّسها ما حاله! واقرأ كيف كانت أعظم شبكة اجتماعيّة منذ سنوات قليلة وكيف صارت الآن! ربّما لم تسمع بـMySpace من قبل، صحيح؟</p>\n","title":"رأيي بـGoogle+","filename":"google_09.json","id":"google_09","date":"2011-07-09T00:00:00.000Z","image":null,"description":"حصلت على دعوة للانضمام إلى Google+ منذ فترة لكنّني لم أستطع الاشتراك بسبب الضّغط الزّائد، قرأتمقالة على Lifehacker تشرح كيفيّة \"التّحايل\" على Google+ والانضمام إليها رغم إيقاف قبول طلبات الاشتراك. طلبت من صديقي بشر أن يساعدني في إتمام الخطوات واستطعت الاشتراك البارحة!","images":0,"videos":0,"tracks":0,"links":2,"type":"text"}