{"html":"<h1 id=\"-google-\">المزيد من الأفكار حول Google+</h1>\n<p>ما زلت أفكر في كيفيّة تطوير Google+ ودمج بقيّة منتجات Google فيه؛ من الواضح أنّ Google تفكّر في دمج معظم أو كلّ خدماتها في منصّة اجتماعيّة واحدة تساهم في زيادة انتشار واستخدام هذه الخدمات وإضفاء الصّفة الاجتماعيّة عليها.<br>في الحقيقة أنا مزعوج من التغييرات الكثيرة الّتي تجريها Google على خدماتها وتقدّمها للمستخدمين قبل الانتهاء منها، لهذا بالطّبع فوائد ومنها المساعدة في اكتشاف الثّغرات والمشاكل الفنّيّة والمساهمة باقتراحات جديدة... لكنك تشعر في نفس الوقت بنوع من عدم الاستقرار.<br>فمثلاً، قدّمت Google منذ فترة تصميمًا جديدًا لكلّ من Gmail وCalendar وBlogger وTranslate وMaps؛ التصميم كما ذكرت الشّركة موحّد وهو تصميم سهل الاستخدام ويعرض المهمّ والمهمّ فقط، كما أنّ الخطوط واضحة والأزرار كبيرة وهذا يسهّل الاستخدام على شاشات اللّمس. المشكلة أنّ هذا التّصميم لم يطبّق على جميع منتجات Google مع أنّ بعضها شائع الاستخدام وربّما أكثر استخدامًا من خدمات غيّرت Google تصميمها. Reader مثلاً استخدامه غير مريح ومعقّد ويحتاج فعلاً إلى إعادة تصميم جذريّة.<br>اختلاف التصميم بين هذه الخدمات يشتّت المستخدمين... ربّما Google الآن تعمل على إعادة تصميم Reader وبقيّة المنتجات لكن كان عليها أن تطرح هذا التصميم بالتزامن مع بقيّة الخدمات.  </p>\n<p>نقطة أخرى أجد أنّها تستحقّ الدّراسة وهي خدمات Google على الهاتف المحمول: أقصد أنّ الهواتف المحمولة أصبحت خارقة وبعضها أقوى من أجهزة الكمبيوتر المطروحة منذ عدّة أعوام، فلمَ لا يزال المستخدم عاجزًا عن استخدام منتجات Google للإنتاج لا الاستهلاك باستخدام هاتفه المحمول؟ خذ Docs مثالاً... تطبيق Google Docs لنظام Android وiOS ينقصه الكثير من الميّزات الموجودة في نسخة Docs للويب.<br>نعود للشبكة الاجتماعيّة، وسأعرض مقترحاتي لدمج المنتجات واحدًا تلو الآخر:  </p>\n<ol>\n<li>البحث: أعتقد أنّ طريقة Facebook في الاستفادة من بحث Bing ضمن نتائج البحث عمّا تكتبه في المربّع العلويّ هي طريقة جيّدة لاستغلال البحث، وهنا أقصد البحث في الويب والصور وفي YouTube. لا ننسى أيضًا استغلال زرّ +1 في خوارزميّة البحث كعامل من عوامل ترتيب النّتائج، وهذا ربّما ما سيزيد من قوّة محرّك البحث وسيجعل منافسه Bing في ورطة.</li>\n<li>التقويم: يقابله في Facebook المناسبات Events، وإذا أحسنت Google الاستفادة من خدمتها فستكون المناسبات في Google+ أفضل منها في Facebook، لأنّ تقويم Google يدعم الاستيراد والتصدير، وإضافة العديد من التقويمات وإمكانيّة مشاركتها مع أشخاص معيّنين. على سبيل المثال: سيكون بإمكانك إنشاء مناسبة ومشاركتها مع دائرة أصدقائك فقط، وستعرض المناسبة في مذكّرات أصدقائك على هواتفهم وستظهر تلقائيًّا في حساباتهم في تقويم Google... أضف إلى ذلك إمكانيّة التّعليق على الأحداث أو تأجيلها... وكلّ ذلك بالطّريقة السّهلة المعتمدة حاليًّا في تقويم Google!</li>\n<li>المهامّ: مهامّ Google والّتي يمكن اعتبارها جزءًا من التّقويم سينطبق عليها ما ينطبق على التّقويم من عمليّات المشاركة والتّعليق والتّعديل المشترك مع الدّوائر.</li>\n<li>Picasa Web Albums: كنت أتوقّع من Google أن تغيّر اسمها إلى Photos فقط. وهذا ما حدث! وأراها خطوة صائبة لأنّ المستخدم العادي سيدرك معنى Photos مباشرة؛ ولكن الخطوة التّالية الّتي ينبغي على Google تنفيذها هي الدّمج... الدّمج سيكون بالتّخلّص من واجهة Picasa وتحويل المستخدم إلى واجهة الصّور في Google+ مع إضافة طرق مختلفة لاستعراض الصّور وترتيبها وتحريرها. إبقاء Picasa على ما هو عليه سيزيد المستخدمين إرباكاً.</li>\n<li>Picnik: محرّر صور على الويب اشترته Google وأضافته لـPicasa، الإضافة لم تكن سوى زرّ أضافته لواجهة الأخير ينقلك إلى محرّر الصّور... برأيي وبعد دمج Picasa Web Albums في Google+ فإنّ الخطوة المنطقيّة هي إضافة التّحرير التّفاعليّ إلى الصّور ضمن الشّبكة ودون نقل المستخدم إلى صفحة أو موقع جديد. في Google+ شيء بسيط من هذا يتضمّن جعل الصّور بالأبيض والأسود وتأثيرات أخرى مشابهة... ولكن التّحرير الحقيقيّ يجب أن يتضمّن إمكانيّة قصّ الصّورة وإضافة النّصوص وغير ذلك.</li>\n<li>جهات الاتّصال: لعلّها أكثر ما يزعجني حاليًّا، إذ أنّ جهات الاتّصال في Google+ غير متعلّقة بجهات الاتّصال الّتي تجدها في Gmail... مثلاً لديّ صديق على Google+ وعلى Gmail إلا أنّ معلوماته الموجودة في Gmail لا تظهر لديّ عندما أشير إلى اسمه في Google+، لا أدري إن كانت Google تنوي التّغيير هنا ولكن سيكون هذا صعبًا خصوصًا فيما يتعلّق بالخصوصيّة.</li>\n<li>Gmail: فيما عدا جهات الاتّصال وإعادة التّصميم، لا أرى أنّ على Google إجراء تغييرات.</li>\n<li>Reader: كما ذكرت يحتاج إلى إعادة تصميم بالإضافة إلى الدّمج الّذي سيكون بجعله جزءًا من القائمة الجانبيّة ضمن Google+ وبديلاً عن Sparks (الاهتمامات) الّتي تظهر حاليًّا والّتي لا يمكن تخصيصها كما تريد، أعني أنّك تستطيع إضافة اهتمام حول طبّ الأسنان مثلاً لكنّ لن يكون بإمكانك اختيار مواقع محدّدة لتظهر منها الأخبار دون الأخرى، ولن يكون بإمكانك وضع نجمة على مقالة أعجبتك ضمن هذا الاهتمام. دمج Reader سيوفّر هذه الخصائص ويجعل المحتوى أكثر خصوصيّة. ويجب أيضًا المحافظة على زرّ المشاركة. أضيف إلى ذلك اقتراح لمشاركة وتبادل الاهتمامات مع دوائرك.</li>\n<li>المجموعات: Google Groups الّتي كدنا ننسى وجودها يمكن دمجها بسهولة وبكامل خصائصها وإعداداتها... مع أخذ الدّوائر بالحسبان! وعندها ستكون مقابلاً لمجموعات Facebook.</li>\n<li>النبضات: ربّما يجب عرض خيارين أمام المستخدم، الأوّل نقل مشاركاته في النبضات إلى Google+ مع ضمّ من يتابعهم إلى الدّوائر... وإرسال تنبيه إلى متابعيه لكي يقوموا بضمّه إلى دوائرهم أيضًا؛ والثّاني حذف كلّ مشاركاته ومتابعيه ومن يتابعهم والانتقال إلى Google+ دون نقل.</li>\n<li>مختصر الروابط URL Shortener: استخدامه واضح ومشابه لما يقابله في Twitter.</li>\n<li>الدردشة ومحادثات الفيديو: بعد دمج جهات الاتّصالات بين Gmail وGoogle+ سيكون من السّهل دمج الدّردشة، أمّا محادثات الفيديو فهي موجودة بالفعل (Hangouts).</li>\n<li>Blogger: سيكون على Google توحيد الملفّ الشّخصيّ بين Blogger وGoogle+ وإتاحة إمكانيّة نشر التّدوينات الجديدة تلقائيًّا على Google+ وأيضًا إضافة الكاتب إلى دوائر القارئ وبالعكس.</li>\n<li>التّرجمة: ربّما سيكون من المفيد طلب المساعدة من دوائرك للمساهمة في تحسين التّرجمة الّتي قدّمتها لك خدمة التّرجمة من Google. وعلى Google توفير آليّة لتسهيل هذه العمليّة.</li>\n<li>محرّر المستندات: أعتقد أنّ الدّمج يكون بإمكانيّة دعوة دوائرك للمشاركة في التحرير المتزامن للمستند وإضافة التّعليقات واستخدام الدّردشة.</li>\n<li>الإعلانات: كما في Facebook مع ملاحظة أنّ Google أكثر خبرةً في هذا المجال.أذكّر هنا بضرورة تطوير منتجات Google للهاتف المحمول، وبتوحيد التصّميم، مع الإبقاء على إمكانيّة استخدام بعض المنتجات بشكل منفصل عن Google+ لكي لا يكون الاشتراك في Google+ إجباريًّا.<br>قرأت منذ قليل عن إغلاق Google لبعض الحسابات بسبب استخدام أسماء غير حقيقيّة من مثل &quot;الوحش اللطيف&quot; و&quot;الهمسة الزرقاء&quot;... إلخ... من المسمّيات الّتي أراها تافهة... وهي خطوة ممتازة وفي الطّريق الصّحيح وستجعل من Google+ شبكة موثوقة وأعضاؤها مسؤولون عمّا يكتبونه. كما قرأت أن Google ستوفّر حسابات متحقّق منها verified كما في Twitter، وإن كان الخبران يعنيان شيئًا، فهما يعنيان أنّ Google حملت على عاتقها جزءًا كبيرًا من مسؤوليّة توحيد الهويّة الرّقميّة على الويب!</li>\n</ol>\n","title":"المزيد من الأفكار حول Google+","filename":"google.json","id":"google","date":"2011-07-24T00:00:00.000Z","image":null,"description":"ما زلت أفكر في كيفيّة تطوير Google+ ودمج بقيّة منتجات Google فيه؛ من الواضح أنّ Google تفكّر في دمج معظم أو كلّ خدماتها في منصّة اجتماعيّة واحدة تساهم في زيادة انتشار واستخدام هذه الخدمات وإضفاء الصّفة الاجتماعيّة عليها.في الحقيقة أنا مزعوج من التغييرات الكثيرة الّتي تجريها Google على خدماتها وتقدّمها للمستخدمين قبل الانتهاء منها، لهذا بالطّبع فوائد ومنها المساعدة في اكتشاف الثّغرات والمشاكل الفنّيّة والمساهمة باقتراحات جديدة... لكنك تشعر في نفس الوقت بنوع من عدم الاستقرار.فمثلاً، قدّمت Google منذ فترة تصميمًا جديدًا لكلّ من Gmail وCalendar وBlogger وTranslate وMaps؛ التصميم كما ذكرت الشّركة موحّد وهو تصميم سهل الاستخدام ويعرض المهمّ والمهمّ فقط، كما أنّ الخطوط واضحة والأزرار كبيرة وهذا يسهّل الاستخدام على شاشات اللّمس. المشكلة أنّ هذا التّصميم لم يطبّق على جميع منتجات Google مع أنّ بعضها شائع الاستخدام وربّما أكثر استخدامًا من خدمات غيّرت Google تصميمها. Reader مثلاً استخدامه غير مريح ومعقّد ويحتاج فعلاً إلى إعادة تصميم جذريّة.اختلاف التصميم بين هذه الخدمات يشتّت المستخدمين... ربّما Google الآن تعمل على إعادة تصميم Reader وبقيّة المنتجات لكن كان عليها أن تطرح هذا التصميم بالتزامن مع بقيّة الخدمات.","images":0,"videos":0,"tracks":0,"links":0,"type":"text"}