{"html":"<h1 id=\"-\">ترتيب الكمبيوتر المفضل لي</h1>\n<p>يبدو العنوان غير مناسب، لأنني لا أعرف كيف أترجم كلمة &quot;setup&quot; إلى العربية، هل هي &quot;إعداد&quot; أم &quot;تجهيز&quot;؟ المهم أنني سأحاكي <a href=\"http://zenhabits.net/essential-mac/\">تدوينة</a> قرأتها مؤخرًا يتحدث فيها الكاتب عن البرامج التي يستعملها على حاسوبه ويشرح كلًّا منها باختصار.  </p>\n<h3 id=\"-windows-7\">نظام التشغيل: Windows 7</h3>\n<p>للأسف ليس <a href=\"http://www.ubuntu.com/\">Ubuntu</a> أو توزيعة Linux أخرى، والسبب بسيط: لقد <a href=\"http://tirania.org/blog/archive/2012/Aug-29.html\">انتهى عصر Linux على الحواسيب الشخصية</a> (الرابط لتدوينة كتبها مؤسس Gnome)، بينما يبدو مستقبله واعدًا جدًّا على الهواتف الذكية والأجهزة اللوحية. يحتاج الأمر الكثير من الشرح، لكنني بعد تجربة Ubuntu و<a href=\"http://www.linuxmint.com/\">Mint</a> و<a href=\"http://www.fedora.org/\">Fedora</a> وغيرها وواجهتي KDE وGnome، واجهت مشاكل في كل نسخة قد لا توجد في أخرى، والخلاصة أنني لم أجد توزيعة يُعتمد عليها كبديل لنظام Windows بشكل نهائي، المشاكل الأساسية تتعلق بأداء القرص الصلب وحرارته على جهاز Dell، والحاجة إلى استعمال الطرفية (Terminal) في كل مرة، والتي يدّعي الكثير من عشّاق Linux أنها أكثر كفاءة من استعمال الواجهات المرئية، وقد تبين لي أنّ هذا غير صحيح، ليس لقلة خبرتي في كتابة الأوامر (وهذا صحيح)، لكن فكرة اللجوء إليها لتثبيت برنامج أو إزالته، أو لتصحيح خطأ أصليّ في التوزيعة، أو حتى لتجميل الخط العربي القبيح، لا تبدو فكرة مقبولة لي ولكثير من المستخدمين الجدد.</p>\n<blockquote>\n<p>&quot;I spent a month experiencing Linux as a desktop OS. What I learned from the <a href=\"http://www.pcworld.com/businesscenter/article/229187/30_days_with_ubuntu_linux_day_1.html\">30 Days With Ubuntu Linux</a> experiment is that Linux is, in fact, capable of being a desktop OS. But, the whole 30 days <a href=\"http://www.pcworld.com/businesscenter/article/234885/ubuntu_linux_day_30_what_i_learned_from_30_days_with_ubuntu_linux.html\">felt like I was swimming upstream</a>--<strong>constantly tinkering and finding workarounds to get everyday tasks done</strong>.&quot; -- <a href=\"https://www.pcworld.com/article/252516/why_linux_on_the_desktop_is_dead.html\">PC World: Why Linux on the Desktop Is Dead</a> </p>\n</blockquote>\n<p>في المقابل، يبدو Windows 7 نظامًا مستقرًا وآمناً ولم أواجه خلال استخدامي له منذ صدوره مشاكل جدّيّة.  </p>\n<h3 id=\"dropbox-skydrive\">Dropbox وSkyDrive</h3>\n<p><a href=\"https://www.dropbox.com/\">Dropbox</a> خدمة تتيح لك مزامنة ملفاتك بين عدة أجهزة والاحتفاظ بها ضمن مساحة خاصة بك على مخدمات الشركة، بحسب قراءتي لتاريخ الخدمة، يبدو أنّها أقدم خدمة قدمت هذه الفكرة، ولا أجد هذا مستغربًا مع كل الأمان والثبات والذكاء الذي يقدمه تطبيق الخدمة على Windows وLinux وMac. الفكرة باختصار، أنه عند تثبيت البرنامج على جهازك، فإنه ينشئ لك مجلدًا عاديًّا على أي موضع تحدده، ثم تحفظ ملفاتك في هذا المجلد وسيقوم البرنامج برفعها إلى المخدم فورًا وتحميلها على بقية الحواسيب المتصلة، أي إنك ستجد ملفاتك التي حفظتها في هذا المجلد على كل أجهزتك وكذلك على الويب إذا كنت بعيدًا عنها واحتجتها؛ كذلك بإمكانك مشاركة مجلد فرعيّ مع الأصدقاء بحيث يمكنهم إضافة ملفات إليه. Dropbox يجب أن يوجد في كل نظام تشغيل أستعمله وفي كل جهاز أستعمله سواء هاتف أو كمبيوتر، لم يعد بإمكاني الاستغناء عنه.</p>\n<p><a href=\"https://apps.live.com/skydrive/app/9a65e47d-606a-4816-a246-90f54bf7a3ea\">SkyDrive</a> هو خدمة من Microsoft تقوم بالضبط بما يقوم به Dropbox، ويمكنك بالإضافة إلى هذا تحرير مستندات Word وPowerPoint وExcel من داخل المتصفح بعمليات التحرير الأساسية، بمعنى أنك قد لا تحتاج إلى شراء وتثبيت Office لديك إن كنت لا تهتم بكل الميزات المتقدمة التي توفرها، وأيضًا يمكنك مشاركة مستند مع أصدقائك ليقرأوه من الموقع مباشرة دون الحاجة لتثبيت Office لديهم.</p>\n<p>أفضل Dropbox عن غيره لأنه ذكي بما يكفي ليدرك أي جزء من الملف قد تغير فلا يعيد رفعه من الصفر (طبعًا هذا لا يصلح لكل أنواع الملفّات)، وكذلك فإنه ينسخ الملفات دون الحاجة لتحميلها ثانية للإنترنت إذا كان الجهاز متصلين عبر نفس الشبكة (بكلا الحالتين سيحتاج إلى وجود اتصال بالإنترنت ليُدرك أنه أٌجريت تغييرات في المجلد فيبدأ بالمزامنة)؛ بمعنى أنه - على عكس الخدمات المنافسة - لا يقوم بتحميل الملفات نفسها مرارًا إذا كنت تستعمل حاسوبين في المنزل، بل ينسخها ببساطة من أحدهما للآخر وبالاتجاهين. كذلك فإن كلاً من Dropbox وSkyDrive عند فقد بياناتهما أو تثبيت نظام تشغيل جديد لا يتجاهلان وجود الملفات ضمن مجلداتهما، بل يتعرفان عليها ولا يعيدان التحميل من الصفر.</p>\n<h3 id=\"-chrome-firefox\">المتصفح: Chrome وFirefox</h3>\n<p><a href=\"http://www.google.com/chrome\">Chrome</a> بشكل أساسيّ، مع عدد كبير من الإضافات وعدد قليل من التطبيقات (ربّما يحتاج الأمر تدوينة مستقلة!). <a href=\"http://www.firefox.com/\">Firefox</a> أستعمله على الجهاز المكتبي لأنه أقلّ ثقلاً على الذاكرة، خصوصًا أنني أستعمله مع عدد قليل من الإضافات أهمها <a href=\"https://addons.mozilla.org/en-US/firefox/addon/downthemall/\">DownThemAll!</a> للتحميل و<a href=\"http://www.diigo.com/\">Diigo</a> لتظليل الصفحات وإضافة الملاحظات إليها وحفظها.</p>\n<p>بعد صدور <a href=\"http://windows.microsoft.com/en-US/internet-explorer/downloads/ie-9/worldwide-languages\">Internet Explorer 9</a> لم يعد اختيار المتصفح أمرًا مهمًّا، فالصفحات أصبحت تُعرض في كل المتصفحات بالطريقة نفسها. <a href=\"http://www.opera.com/\">Opera</a> متصفح سريع وخفيف.</p>\n<h3 id=\"-microsoft-security-essentials\">مضاد الفيروسات: Microsoft Security Essentials</h3>\n<p>نعم لا تستغرب، لا يهمني كثيرًا أن أستعمل أقوى مضاد فيروسات أو أكثرها ميزات، ما يهمني حقًا هو أن يبقى أداء جهازي ضمن الحدود المقبولة، والأمر الآخر المهم هو أن يقوم مضاد الفيروسات بمنع التشغيل التلقائي للفيروسات على ذواكر التخزين، فقط لا غير. في السابق كنت أستخدم النسخة المجانية من Avira؛ أما برامج مثل BitDefender وKaspersky فهي أشياء تخلصت منها منذ أكثر من عامين.</p>\n<p><a href=\"http://windows.microsoft.com/mse\">Security Essentials</a> من Microsoft وكذلك الجدار الناري المدمج مع Windows يقدّمان ما أحتاجه وأكثر.</p>\n<h3 id=\"lightscreen\">Lightscreen</h3>\n<p>أداة لالتقاط صور الشاشة وحفظها مباشرة دون الحاجة إلى فتح الرسام ولصقها ثم تسميتها وحفظها في مجلد، بدل ذلك، فقط قم بتحديد المجلد الذي تريد الحفظ فيه، واضغط زر التقاط الشاشة على لوحة المفاتيح، وستجد كل صور الشاشة محفوظة في هذا المجلد. يمكنك أيضًا التقاط صورة لنافذة واحدة أو لأي جزء من الشاشة دون غيره. الفكرة التي أطبقها: جعل مجلد صور الشاشة مجلدًا فرعيَّا في مجلد Dropbox على جميع أجهزتي، وهكذا تبقى صور الشاشة من جميع الأجهزة في مجلد واحد ويمكنني الرجوع إليها في أي وقت (أستفيد منها في الشروح وفي التدوينات ولحفظ اقتباسات من كتب إلكترونية أقرأها). طبعًا <a href=\"http://lightscreen.sourceforge.net/\">Lightscreen</a> يستطيع أن يتعرف وجود صور في هذا المجلد فلا يستبدل صورًا من جهاز بصور من جهاز آخر، بل يسميها بالأرقام (&quot;screenshot12.png&quot;، &quot;screenshot13.png&quot;) أو أي اسم ولاحقة تحددهما.  </p>\n<h3 id=\"-\">مستعرض/محرر الصور</h3>\n<p>لا أستغني عن <a href=\"http://www.filehippo.com/download_picasa/\">Picasa</a>، عارض الصور فيه سريع للغاية ويقدم تجربة مريحة ومجموعة من المميزات العملية كتكبير الصورة بعجلة الفأرة ورفعها إلى ألبومات بيكاسا على الويب ومزامنة الألبومات كاملة والتعرف المذهل على الوجوه وتجميعها بحسب الشخص ثم اقتراح اسم الشخص بالاعتماد على صوره السابقة (حسنًا قد لا تكون هذه ميزة عمليّة حقًّا، لكنا تبقى رائعة!).</p>\n<p>محرر الصور في Picasa يحوي عشرات التأثيرات الجاهزة وإمكانية التصحيح التلقائي للصور، كما أن ميزة إزالة العين الحمراء تتعرف تلقائيًّا على موضع العيون الحمراء وتصححها، دون الحاجة إلى الإشارة إلى مواضع العيون ثم تصحيح كلّ منها كما في البرامج الأخرى.</p>\n<p>تقنيات البرنامج الواسعة وسرعته هي ما يستهويني، لأنها تشير إلى ذكاء مهندسيه، ويبدو أن هذا كان سببًا كافيًا لتستحوذ عليه Google.  </p>\n<h3 id=\"-\">التحرير الموسّع للصور</h3>\n<p><a href=\"http://www.getpaint.net/download.html\">Paint.NET</a> هو برنامج بسيط لكنه يحوي العمليات الأساسية التي يؤديها Photoshop ومجموعة من الأدوات المشابهة، تستطيع قص الصور وتعديل التباين والسطوع والإشباع وعكس الألوان وإضافة بعض التأثيرات بخصائص موسّعة مثل Blur بأنواعه وما إلى ذلك، بالإضافة إلى تحديد أجزاء الصورة وإضافة الطبقات (layers)... وبالإمكان أيضًا تثبيت <a href=\"http://forums.getpaint.net/index.php?/forum/7-plugins-publishing-only/\">إضافات</a> للبرنامج توسع قدراته.</p>\n<p>Paint.NET هو برنامج أكثر تقدمًا من الرسام بالّطبع، لكنه يقع قبل <a href=\"http://gimp.org/\">GIMP</a> من حيث التقدّم، والذي بدوره يقع قبل Photoshop.</p>\n<h3 id=\"-\">برنامج الأرشفة</h3>\n<p>برنامج <a href=\"http://www.filehippo.com/search?q=7zip\">7z</a> المجاني والمفتوح المصدر يدعم قراءة عدة أنواع من ملفات الأرشيف بما فيها zip وrar، وبإمكانه ضغط الملفات بتنسيقي zip و7z الخاص به والذي يعطي عند إنشاء ملف مضغوط حجمًا قريبًا جدًّا (وأحيانًا أصغر) من ملفات rar. البرنامج سريع وبسيط ولا يحتاج إلى شرح.</p>\n<p>عمومًا أفضل استخدام صيغة zip عند ضغط ملف ونشره على الويب لأنها متوافقة بشكل مدمج مع كل أنظمة التشغيل، ولا يحتاج المستخدم برامج مستقلة لقرائتها.</p>\n<h3 id=\"-\">مشغل الصوت والفيديو</h3>\n<p>Media Player Classic المضمن ضمن حزمة <a href=\"http://filehippo.com/download_klite_mega_codec/\">K-Lite Mega Codec Pack</a> كبرنامج افتراضي لجميع أنواع الصوت والفيديو لدي، خفيف وسريع وبإمكانه أن يعيدك إلى حيث وصلت في الملف الصوتي أو في الفيديو عند فتحه مرة أخرى (تحتاج إلى تفعيل هذا من الخيارات أولاً).</p>\n<p>أحيانًا أنسى وجود Windows Media Player، لم أستعمله منذ نحو سنتين أو أكثر.</p>\n<p><a href=\"http://www.videolan.org/\">VLC Media Player</a> برنامج مفتوح المصدر لكنه لا يعرض الترجمة العربية بشكل صحيح دائمًا، وكذلك فإنّه أبطئ من Media Player Classic.</p>\n<h3 id=\"-pdf\">قارئ PDF</h3>\n<p>حتى وقت قريب كنت أستخدم <a href=\"http://get.adobe.com/reader\">Adobe Reader</a>، وهذا يعني الحاجة المستمرة للتحديث وحجمًا كبيرًا للتحميل وبرنامج يسرع بدءه في بداية تشغيل Windows، وفوق هذا لا يتذكر الموضع الذي توقفت عنده ضمن الكتاب، أي أنني أضطر إلى تذكر أين وصلت في القراءة ثم الذهاب إلى هذا الموضع كل مرة أفتح فيها الكتاب.</p>\n<p>الآن أستخدم <a href=\"http://blog.kowalczyk.info/software/sumatrapdf/download-free-pdf-viewer.html\">Sumatra PDF</a> وهو برنامج خفيف جدًّا ويقدم الميزات الأساسيّة لأيّ قارئ PDF، وهو أيضًا مفتوح المصدر وعندما تفتح كتابًا مرة أخرى سيعيدك إلى حيث وصلت فيه، لكن ينقصه ميزة توجد في Adobe Reader هي إمكانية إضافة الملاحظات وتظليل النصوص ضمن الكتاب وحفظها والرجوع إليها في أي وقت.</p>\n<p><a href=\"http://www.foxitsoftware.com/Secure_PDF_Reader/\">Foxit Reader</a> خفيف لكنه لا يدعم التعليقات العربية على الملفات بشكل جيد. يبقى Sumatra PDF خياري حتى الآن.</p>\n<h3 id=\"-\">القاموس</h3>\n<p>عند وجود الإنترنت، فإن <a href=\"http://translate.google.com/\">Google Translate</a> يكفي لترجمة الكلمات والجمل القصيرة خصوصًا مع إمكانية قراءة الكلمة الإنكليزية بطريقة تبدو طبيعيّة تقريبًا ولا يبدو أنها مركّبة آليًّا. عند انقطاع الإنترنت أستخدم برنامج <a href=\"http://goldendict.org/download.php\">GoldenDict</a> المجاني والمفتوح المصدر بعد أن أضيف له قواميس منوّعة، المميز في هذا البرنامج أنه يستطيع التعامل مع قواميس Babylon ذاتها وقواميس عدة برامج أخرى، وكذلك يجلب لك نتائج Wikipedia، كل هذا في واجهة بسيطة ودون أن يؤثر على الأداء.</p>\n<h3 id=\"-\">محرر النصوص</h3>\n<p>محرر النصوص البسيط الّذي أستخدمه جنبًا إلى جنب مع مفكرة Windows (البسيطة أكثر من اللازم) هو <a href=\"http://notepad-plus-plus.org/download/v6.2.html\">Notepad++</a>. يفيد في تحرير النصوص البرمجية وكذلك النصوص العادية، وهو سريع للغاية ومريح وعند تثبيته يضيف إلى قائمة السياق للملفات خيارًا للتحرير بواسطته، دون الحاجة إلى تعيينه كبرنامج افتراضي أو النقر على &quot;فتح باستخدام...&quot; واختياره، وهذا يجعله مفيدًا عندما تريد تحرير ملف بشكل بسيط وبسرعة.</p>\n<p>أما لكتابة المقالات وغيرها، فإما أن أستخدم <a href=\"https://docs.google.com/\">محرر مستندات Google</a> أو Word عندما أحتاج لخيارات أوسع.  </p>\n<h3 id=\"ccleaner\">CCleaner</h3>\n<p>أداة خفيفة الحجم تقوم بحذف الملفات المؤقتة التي ينشئها النظام والبرامج في الأقراص وحذف تاريخ التصفح لعدد من متصفحات ويب الشهيرة و<a href=\"https://en.wikipedia.org/wiki/Data_remanence\">مسح المساحة الفارغة في الأقراص</a> والتحكم بالبرامج التي تبدأ مع Windows وإزالة البرامج. يمكنك السماح له بالعمل عند كل بدء تشغيل للنظام وسيقوم بمسح الملفات من المواقع التي حددتها له في المرة السابقة، لكن كن حذرًا وأزل خيارات مسح بيانات المتصفح إن لم تكن ترغب في ذلك.</p>\n<h3 id=\"-\">برامج أخرى</h3>\n<p>برامج لا أعتمد عليها في مهامي اليوميّة، لكنني أحتاجها بين فترة وأخرى: </p>\n<ul>\n<li><a href=\"http://mediago.sony.com/enu/download\">MediaGo</a>: برنامج من Sony لتحميل ومشاهدة الأغاني والفيديو والخلاصات الصوتية (Podcasts)، ومزامنة الصور والموسيقى من هواتف Sony. عمليًّا أحتاجه لتحميل الخلاصات الصوتية لبعض المواقع الّتي أهتم بمتابعتها (مثل <a href=\"http://www.eslpod.com/\">ESLPod</a>) ونقلها لهاتفي للاستماع إليها متى شئت. من عيوبه حجمه الكبير (بالطبع سيبدو حجمه كبيرًا بالنسبة للمهمة الوحيدة التي أحتاج فيها إليه) وكذلك عدم قدرته على الاتصال بالهاتف لاسلكيًّا، أتمنى أن أجد برنامج أفضل.</li>\n<li><a href=\"http://www.den4b.com/?x=products&amp;product=renamer\">ReNamer</a>: برنامج صغير وخفيف يقوم بإعادة تسمية مجموعة من الملفات دفعةً واحدة وفقًا لقواعد أو صفات تتصف بها، مثلاً يمكنك إعادة تسمية مجموعة من الأغاني وفقًا لأسمائها وأسماء مؤدّيها، أو مجموعة من الصور بحسب تاريخ التقاطها مع رقم مميز (1، 2، 3...) وهكذا...</li>\n<li><a href=\"http://www.formatoz.com/download.html\">FormatFactory</a>: للتحويل بين العديد من صيغ الملفات الصوتية والمرئية، أستخدمه أساسًا لأنه يدعم تقريبًا كل الأنواع، مرة احتجت إلى تحويل ملف صوتي مسجل بواسطة هاتف بلاحقة .amr ولم يستطع تحويله، فاستخدمت برنامجًا صغيرًا وجدته في نتائج بحث Google (فقط اكتب AMR to MP3 converter أو أي لاحقتين تريد).</li>\n<li><a href=\"http://www.softpedia.com/get/System/Launchers-Shutdown-Tools/Ali-Keshavarz-Auto-Shutdown.shtml\">Auto Shutdown</a>: برنامج صغير يبقى قرب الساعة وبإمكانك ضبطه ليقوم بإيقاف تشغيل الكمبيوتر أو إعادة تشغيله أو أدخاله في وضع السبات أو في وضع النوم متى أردت، أو بعد وقت محدد، أو في كل يوم عند ساعة محددة، أو في كل أسبوع وهكذا... أستخدمه لسببين: أن Windows 7 يستخدم وضع النوم الهجين (Hybrid Sleep) وهذا يعني أنه يحفظ نسخة من الذاكرة على القرص الصلب، ثم يدخل وضع النوم وليس الإسبات (يبقى الجهاز يعمل لكن باستهلاك ضعيف للطاقة)، وعندما يقلع فإنه يستخدم الذاكرة نفسها إن لم يحدث خلل أدى إلى انقطاع التغذية عن الجهاز، أما إذا حدث خلل فإنه يستخدم نسخة القرص الصلب، ولسبب ما فإن Windows على حاسوبي يستخدم نسخة القرص الصلب دومًا وهذا يجعل الإقلاع بطيئًا للغاية؛ في Auto Shutdown يوجد خيار لإجبار الكمبيوتر على الدخول في وضع الإسبات التقليدي، وخيار منفصل لإدخاله في وضع النوم العادي. السبب الآخر هو انقطاع الكهرباء، ولحسن الحظ فإن مواعيد انقطاع الكهرباء لدينا ثابتة تقريبًا وهذا يتيح لي ضبط البرنامج ليدخل الجهاز في وضع السبات قبل 5 دقائق من انقطاع الكهرباء دون الحاجة لتذكر هذا الأمر في كل مرة.</li>\n<li><a href=\"http://cdburnerxp.se/en/download\">CDBurnerXP</a>: لنسخ الأقراص أو كتابتها أو كتابة ملفات ISO على الأقراص.</li>\n</ul>\n","title":"ترتيب الكمبيوتر المفضل لي","filename":"my-pc-setup.json","id":"my-pc-setup","date":"2012-10-21T00:00:00.000Z","image":null,"description":"يبدو العنوان غير مناسب، لأنني لا أعرف كيف أترجم كلمة \"setup\" إلى العربية، هل هي \"إعداد\" أم \"تجهيز\"؟ المهم أنني سأحاكي تدوينة قرأتها مؤخرًا يتحدث فيها الكاتب عن البرامج التي يستعملها على حاسوبه ويشرح كلًّا منها باختصار.","images":0,"videos":0,"tracks":0,"links":39,"type":"text"}