[{"html":"<h1 id=\"-firefox\">كيف تفعّل تعدد المستخدمين في Firefox</h1>\n<p>إحدى أهم ميزات Chrome التي افتقدتها عند الانتقال إلى Firefox إمكانية إنشاء أكثر من مستخدم على المتصفح، بحيث يكون لكل مستخدم حساباته الخاصة وعلاماته وإضافاته وتطبيقاته... وذلك ضمن المستخدم الواحد على النظام، بإمكانك مثلاً أن تستعمل حسابًا للعمل وآخر للبيت على نفس الجهاز، أو حسابًا لأخيك الصغير خوفًا من أن يعرّض حسابك للخطر...<br>كنت في السابق أعلم أن Firefox يدعم تعدد المستخدمين لكن بطريقة مختلفة وتحتاج شيئًا من البحث، وعندما احتجت إلى تعدد المستخدمين، كل ما فعلته أنني بحثت عن إضافة للمتصفح تجعل التبديل بين الحسابات أسهل، ووجدتها خلال دقائق قليلة.</p>\n<ol>\n<li>أولاً: عليك أن تُنشئ الحسابات التي تريد استخدامها، اضغط Win+R في Windows أو Alt+F2 في Ubuntu (ومشتقاته) واكتب firefox -p، الأمر الذي يعني تشغيل Firefox مع العامل p اختصارًا لـprofile والذي يقوم بعرض مدير الملفات الشخصية profiles والتي سنعتبرها حسابات أو مستخدمين.</li>\n<li>ستعرض نافذة صغيرة فيها حسابك الرئيسي الذي تستخدمه، وبإمكانك إنشاء مستخدم جديد بالضغط على زر Create Profile...</li>\n<li>الجميل في Firefox أنه بإمكانك إنشاء الملف الشخصي في أي مجلد تشاء بعكس Chrome، والأمر مفيد لأنه بقليل من النباهة يعني إمكانية أن تستفيد من ذلك بمزامنة ملف الشخصي إلى Dropbox بحيث يكون Firefox على جهازك الأول نسخة طبق الأصل عنه في جهازك الثاني بدون الحاجة لاستخدام أي نوع من إضافات المزامنة أو مزامنة Firefox التي أعتبرها أقل جودة من مقابلها في Chrome.</li>\n<li>بعد إنشاء الحساب ستعود إلى النافذة الصغيرة إيّاها، اختر أي مستخدم تشاء ثم انقر زر Start Firefox، سيبدأ Firefox مستخدمًا الملف الشخصي الذي اخترته، ثم <a href=\"https://addons.mozilla.org/en-US/firefox/addon/profileswitcher/\">ثبّت هذه الإضافة</a> التي تسمح بالانتقال السريع بين &quot;المستخدمين&quot;، حتى دون الاضطرار لإغلاق واحد التبديل للآخر.</li>\n<li>أغلق Firefox ثم نفذ الخطوة الأولى ثانية واختر المستخدم الآخر ثم ثبت الإضافة ثانية على هذا المستخدم.</li>\n</ol>\n<p>في قائمة ملف يظهر خيار التبديل بين المستخدمين، وتتيح هذه الإضافة خيارات جيدة منها إمكانية ضبطها للتبديل بين المستخدمين دون إغلاق أي منهم أو السؤال كل مرة أو إجبار إغلاق الأول قبل الانتقال للثاني.</p>\n","title":"كيف تفعّل تعدد المستخدمين في Firefox","filename":"firefox.json","id":"firefox","date":"2013-03-06T00:00:00.000Z","image":null,"description":"إحدى أهم ميزات Chrome التي افتقدتها عند الانتقال إلى Firefox إمكانية إنشاء أكثر من مستخدم على المتصفح، بحيث يكون لكل مستخدم حساباته الخاصة وعلاماته وإضافاته وتطبيقاته... وذلك ضمن المستخدم الواحد على النظام، بإمكانك مثلاً أن تستعمل حسابًا للعمل وآخر للبيت على نفس الجهاز، أو حسابًا لأخيك الصغير خوفًا من أن يعرّض حسابك للخطر...كنت في السابق أعلم أن Firefox يدعم تعدد المستخدمين لكن بطريقة مختلفة وتحتاج شيئًا من البحث، وعندما احتجت إلى تعدد المستخدمين، كل ما فعلته أنني بحثت عن إضافة للمتصفح تجعل التبديل بين الحسابات أسهل، ووجدتها خلال دقائق قليلة.","images":0,"videos":0,"tracks":0,"links":1,"type":"text","page":3},{"html":"<h1 id=\"-android-\">بعض مشاكل قابلية الاستخدام في Android: زر الرجوع</h1>\n<p>Android نظام تشغيل ناجح للغاية، وقد أحدث ثورةً في مفاهيم الهواتف الذكية، فبعد أن كان الإمكانات المتقدمة التي يمكن لهاتف ذكي أن يؤديها حكرًا على أصحاب iPhone، وكانت هواتف Nokia الذكية أغبى من المتوقع، جاء Android ليضع في يد ملايين المستخدمين من حول العالم إمكانات تقارب ما يمكن لحاسوب أن يفعله، وتتجاوزه من حيث السهولة في كثير من الأحيان.</p>\n<p>لكن لنكون صريحين، فإن Android بعد أن جربته على كثير من الأجهزة بمختلف &quot;نكهاته&quot; التي تصر الشركات المصنعة أن تخلقها، ما زال يعاني من بعض المشاكل في قابلية الاستخدام.</p>\n<p>تكاد قابلية الاستخدام (Usability) تصبح علمًا قائمًا بذاته، ويمكن اعتبارها جزءًا من تجربة المستخدم (User Experience) الشغل الشاغل لمصممي الأنظمة والواجهات في هذه الأيام. إذا أردت قراءة المزيد عن هذا الموضوع بالعربية، فأنصحك بالاطّلاع على <a href=\"http://uxfix.com/\">مدونة الأستاذ مشهور الدبيان</a>، وإن لم تُحدّث منذ زمن.</p>\n<h3 id=\"-\">زر الرجوع</h3>\n<p>وهو المشكلة الكبرى برأيي، لا يحافظ زر الرجوع على نمط معين يمكن التنبؤ به بشكل دائم، وإنما عليك في كل مرة تضغط فيها زر الرجوع أن تضع كافة الاحتمالات في ذهنك، فإذا كنت في برنامج ما، وتصفحت عدة صفحات ضمنه، وأردت الرجوع إلى كل صفحة سابقة، فقد لا يعمل زر الرجوع كما تتوقع، بل ربما يعود بك إلى الصفحة الرئيسية للبرنامج أو ربما يخرج من البرنامج ليعيدك إلى الصفحة الرئيسية للهاتف في حال وصلت إليه من شريط التنبيهات مثلاً، ومما يزيد الطين بلة وجود اختلاف بين برنامج وآخر حتى لو كانت الظروف متماثلة فالأمر هنا متروك للمطورين أنفسهم، وليكون الأمر أسوأ فإن بعض التطبيقات التي تتبع أسلوب Holo (نمط التصميم المستخدم في Android 4.0 وما بعده) تضيف إلى الشريط العلوي زر رجوع آخر، مهمته تختلف من برنامج لآخر ومن صفحة لآخرى ضمن نفس البرنامج، فقد يظهر صفحة جانبية تحوي اختصارات في Google+ وقد يعيدك إلى الخلف في Google+ نفسه بحسب موضعك، ما مهمة زر الرجوع أدناه إذًا؟</p>\n<p>شخصيًا تطوّر عندي &quot;حدس&quot; بحيث يمكنني توقع ما الذي سيفعله زر الرجوع بالضبط، وهذا ينجم عن الخبرة، التي أتمنى أن تمكن بقية المستخدمين من تجاوز هذه المشكلة!</p>\n<p>لمزيد من الشرح <a href=\"https://www.youtube.com/watch?feature=player_detailpage&amp;v=WAslrg10Jps#t=658s\">شاهد هذا الفيديو بدءًا من الدقيقة 11 تقريبًا.</a></p>\n","title":"بعض مشاكل قابلية الاستخدام في Android: زر الرجوع","filename":"android.json","id":"android","date":"2013-02-25T00:00:00.000Z","image":null,"description":"Android نظام تشغيل ناجح للغاية، وقد أحدث ثورةً في مفاهيم الهواتف الذكية، فبعد أن كان الإمكانات المتقدمة التي يمكن لهاتف ذكي أن يؤديها حكرًا على أصحاب iPhone، وكانت هواتف Nokia الذكية أغبى من المتوقع، جاء Android ليضع في يد ملايين المستخدمين من حول العالم إمكانات تقارب ما يمكن لحاسوب أن يفعله، وتتجاوزه من حيث السهولة في كثير من الأحيان.","images":0,"videos":0,"tracks":0,"links":2,"type":"text","page":3},{"html":"<h1 id=\"-2-\">ترتيب الكمبيوتر المفضل لدي (2)</h1>\n<p>بعد <a href=\"http://forabi.blogspot.co.uk/2013/02/gnome-3.html\">التدوينة السابقة</a>، أصبح لا بدّ من إدخال بعض التعديلات على <a href=\"http://forabi.blogspot.co.uk/2012/10/my-pc-setup.html\">ترتيب الكمبيوتر المفضل لديّ</a> والذي كان في السابق يعتمد على Windows وبرامجه.</p>\n<ul>\n<li>نظام التشغيل: Linux Mint 14 Cinnamon نسخة 64 بت مع الاستغناء عن الواجهة الأساسية Cinnamon واستخدام GNOME Shell (أفكر في الانتقال إلى Ubuntu Gnome Remix المؤسسة على Ubuntu ولكنها تستخدم GNOME 3 كواجهة افتراضيّة)</li>\n<li>Dropbox فقط: لا يتوفر إصدار من SkyDrive ولا Google Drive ولا Box على توزيعات لينكس، ويبدو لي إلى الآن أنني لن أحتاج سوى Dropbox؛ على الرغم من أنني أمتلك 50 غيغابايت مدى الحياة على Box لأنني أستخدم هاتف من Sony.</li>\n<li>المتصفح: Chrome وFirefox (لا جديد هنا)</li>\n<li>لا مضاد فيروسات</li>\n<li>ScreenCloud لالتقاط صور للشاشة الذي يعمل بطريقة مشابهة جدًّا لبرنامج LightScreen لكن بخيارات أوسع</li>\n<li>مستعرض/محرر الصور: المستعرض الافتراضي في Mint وShotwell للتعديلات البسيطة.</li>\n<li>التحرير الموسّع للصور: Pinta هو برنامج مستوحى من برنامج Paint.NET على Windows ويمتلك واجهة وخيارات مماثلة للأخير تقريبًا. وإذا لزم الأمر لتحرير أوسع فـGIMP موجود.</li>\n<li>برنامج الأرشفة: يأتي Mint مع دعم لضغط الملفات بعدة صيغ، تحتاج فقط لتثبيت إضافة RAR إن لم تكن موجودة وذلك لتتمكن من فك الملفات المضغوطة بهذه الصيغة، وإضافة 7z لتتمكن من ضغط الملفات وفكها بهذه الصيغة. الجميل في توزيعات Linux أنها تستعمل برنامجًا موحّدًا لكل الصّيغ.</li>\n<li>مشغل الصوت والفيديو: المشغل الافتراضي في GNOME والذي يتمتع بواجهة بسيطة ودعم لمعظم الأنواع بعد تثبيت codecs المناسبة، وكذلك VLC.</li>\n<li>قارئ PDF: برنامج Evince القارئ الافتراضي في Mint سريع ويتذكر موضع القراءة ولكن ينقصه ميزة إضافة الملاحظات والتظليل، Okular قارئ KDE الافتراضي يتمتع بهذه الميزة لكنّ هذه التعديلات لا تحفظ إلى الملف، بمعنى أنه بمجرد تغيير موقع الملف فإنك ستفقد كل الملاحظات والتظليلات. Adobe Reader يمكن تثبيه عن طريق Wine في حال واجهت مشاكل في توافق بعض الملفات.</li>\n<li>القاموس: StarDic وGoldenDict (الأخير لا يعمل لسبب ما!)</li>\n<li>محرر النصوص: Gedit المحرر الافتراضي في Gnome والذي يمكن توسيع إمكاناته بعدد كبير من الإضافات (لتحرير النصوص البرمجية أو غير المنسقة، كمفكرة Windows)، وAbiWord الذي يشبه Word لكنه أقل خيارات منه، وكذلك LibreOffice Writer الذي أعتبره كافيًا ومنافسًا لـWord بالنسبة لحاجاتي.</li>\n<li>بديل CCleaner هو BleachBit والذي يعمل بطريقة مشابهة جدًّا.</li>\n</ul>\n","title":"ترتيب الكمبيوتر المفضل لدي (2)","filename":"2.json","id":"2","date":"2013-02-24T00:00:00.000Z","image":null,"description":"بعد التدوينة السابقة، أصبح لا بدّ من إدخال بعض التعديلات على ترتيب الكمبيوتر المفضل لديّ والذي كان في السابق يعتمد على Windows وبرامجه.","images":0,"videos":0,"tracks":0,"links":2,"type":"text","page":3},{"html":"<h1 id=\"gnome-3-\">GNOME 3: فرصة أخرى للمصادر المفتوحة على الحواسيب</h1>\n<p>يبدو أنني كنت مخطئًا بشأن Linux على سطح المكتب، ويبدو أن حكمي كان صادرًا عن شعور بالإحباط بعد تجربتي لكثير من التوزيعات التي يُفترض أن تكون سهلة الاستخدام، وبعد المشاكل التي واجهتني، فقد كنت قررت أن أترك توزيعات Linux إلى الأبد، لكنني منذ أقل من شهر اضطررت لإعادة تثبيت Windows تخلصًا من كثير من البرامج التي ثبتتها فيما مضى ولم أعد محتاجًا لها. كنت أريد إعادة تثبيت Windows 7 لكنني قررت أن أمنح Linux فرصة أخرى، وأن أثبته إلى جانب Windows، لكنني قمت بتثبيت Linux Mint 14 أولاً وقررت تجربتها، ولم أقم بتثبيت Windows بعدها.</p>\n<p>هذه المرة قررت أن أجرب GNOME 3.6، وهي النسخة الأحدث من بيئة سطح المكتب الأكثر شهرة بين مستخدمي Linux، وهذه النسخة بالتحديد لم تلقَ قبول المستخدمين القدامى، بسبب التغييرات الجذرية التي أدخلتها على مفاهيم استخدامها؛ وكان من بين الرافضين لها لينوس تورفالدز نفسه، والذي كان يستعمل GNOME 2. وكذلك فإن GNOME شقت لنفسها طريقًا مختلفًا عمّا سلكه مطوّرو Ubuntu الذين قرّروا إنشاء واجهتهم الخاصة Unity.</p>\n<p>كنت منذ أكثر من سنة ونصف جربت GNOME 3 في نسخة أولية منها، وكانت مليئة بالثغرات والأخطاء، أشياء بسيطة لم تكن تعمل، وكانت بطيئة وغير عمليّة. كان وضع GNOME حينئذٍ حرجًا، بعد أن هجرها مستخدموها القدامى، ولم تفلح في جذب مستخدمين جدد بسبب أدائها غير المستقرّ.</p>\n<p>لكن الوضع فيما بعد تحسّن، حتى أن لينوس تورفالدز الذي كان انتقدها في إصدارات سابقة عاد ليبدي رضاه إلى حدّ ما على التحسينات اللاحقة.</p>\n<p>مؤخرًا ثبتت النسخة المستقرة الأحدث 3.6 واستخدمتها على Linux Mint 14 كنظام تشغيل وحيد على جهازي، وإلى الآن أستخدمها ولم أحتج إلى Windows.</p>\n<p>من التغييرات الجذرية التي أدخلت على GNOME 3 حذف شريط المهام التقليدي الذي يُشاهد في Windows وMac OS X وKDE والنسخ القديمة من GNOME، وكذلك حذف زر تصغير النافذة، بمعنى إلغاء فكرة تصغير النوافذ.</p>\n<p>السبب في هذه التغييرات هو الاتجاه السائد حاليًا نحو التركيز على الهواتف الذكية، حتى أن الأفكار التي وُجدت على هذه الهواتف ومن بعدها على الحواسب اللوحية بدأت تظهر على الحواسيب الشخصية، وإذا نظرنا إلى الأمور من هذه الجهة فإننا نلاحظ أن مستخدمي الهواتف الذكية الجديدة لا يقومون &quot;بتصغير&quot; البرامج عند الانتقال من واحد لآخر، وكذلك فإنه لا وجود لشريط مهام في هاتف ذكي، وعليه فإن هذا المستخدم يألف نمطًا من التعامل مع التطبيقات يختلف عما يُشاهد على الحواسيب، وإذا أردنا منع حصول هذا التعارض، فعلينا إيجاد رؤية موحدة لمفاهيم التعامل مع التطبيقات المتعددة.</p>\n<p>لا داعي لتصغير النوافذ، فقط انتقل من تطبيق إلى آخر، خصوصًا أن التطبيقات اليوم معظمها يحتاج لأن يملأ الشاشة، كمتصفح الويب ومشغل الفيديو وقارئ المستندات...  </p>\n<p>وكذلك فإنّه لا داعي لوجود شريط للمهام للتنقل بين البرامج، كل ما عليك فعله هو أن تضغط على زر Super (زر Windows) في لوحة المفاتيح أو أن تسحب مؤشر الفأرة نحو الزاوية العلوية اليمنى من الشاشة (أو اليسرى في اللغات التي تكتب من اليسار إلى اليمين)، وستحصل على ما يُسمى باسم Activities Overview، وهو شاشة تعرض للمستخدم نظرة عامة على التطبيقات المفتوحة بمعاينات كبيرة نسبيًّا وحيّة (تتغيّر لحظيًّا وليست جامدة) وإلى طرف الشاشة البرامج المفضلة التي قام المستخدم بتثبيتها إلى هذا الطرف، مع أيقونات البرامج المفتوحة ذاتها، وإلى الطرف المقابل لوحٌ يعرض مساحات العمل التي تٌُستخدم، وهي ديناميكية، بحيث إن عددها يساوي عدد مساحات العمل الممتلئة زائدة واحدًا، في حال رغب المستخدم بإضافة تطبيقات إلى مساحة فارغة، فتظهر مساحة أخرى فارغة، وهكذا...<br>إن التخلص من شريط المهام يزيد في المساحة العمودية التي يمكن للتطبيقات أن تملأها مقارنة بـWindows، وهذا له قيمة كبيرة على شاشات الأجهزة المحمولة Laptops التي يكون ارتفاع الشاشة فيها محدودًا.  </p>\n<p>أيضًا في منتصف الشاشة من أعلى مربع بحث وكل ما عليك أن تبدأ بكتابة حرف لتظهر التطبيقات المثبتة ونتائج البحث في الملفات والبرامج وما إلى ذلك، وليس عليك بالضرورة أن تضغط على مربع البحث لتبدأ في الكتابة فيه.</p>\n<p>إذًا لفتح برنامج جديد: اضغط زر Super ثم اكتب بضع حروف منه، واضغط Enter لفتح أول نتيجة (تمامًا كما في Windows وواجهة Unity في Ubuntu).</p>\n<p>وللتنقل بين البرامج المفتوحة: اضغط زر Super واختر البرنامج، أو اسحب مؤشر الفأرة إلى الزاوية العلوية اليمنى ثم اختر البرنامج، وهذا يقابل في Windows شريط المهام ما عدا أنك لا تحتاج إلى المرور على معاينات كل برنامج لتجد ما تبحث عنه، بل ستحصل على نظرة عامة لكل البرامج المفتوحة، وكذلك إن لم تجد البرنامج مفتوحًا فكل ما عليك أن تفعله هو أن تبدأ في كتابة بضعة حروف، فإذا كان البرنامج مفتوحًا انتقلت إليه، وإلا فإنه سيُفتح.</p>\n<p>من خلال التجربة يبدو هذا النموذج في الاستخدام عمليًّا وأكثر سرعة من كل من Unity وWindows، ففي Unity إذا أردت التنقل بين مساحات العمل عليك أن تضغط على زر التنقل بينها في المشغل، أو تضغط Super+S، وهذا يُعتبر أثناء العمل أكثر استهلاكًا للوقت والجهد، ويعني ضغط زرين أو التحرك بالفأرة والنقر (خطوتان).<br>حاليًا انتقلت للعمل على Unity لأن GNOME Shell لم تعد تعمل بسب انتقالي إلى تحديثات شبه يومية (من مخزن غير مستقرّ)، وعادةً فإن هذه المخازن تكون موجهة للمطورين والراغبين في التجربة حتى لو كانت على حساب تعطل الواجهة بالكامل، وأنا منهم :)</p>\n<p>أنتظر بشوق 27 آذار موعد صدور النسخة الجديدة من GNOME Shell التي ستشمل تحسينات كبيرة على البحث والخصوصية، سأعود لأكتب عنها قريبًا.</p>\n","title":"GNOME 3: فرصة أخرى للمصادر المفتوحة على الحواسيب","filename":"gnome-3.json","id":"gnome-3","date":"2013-02-21T00:00:00.000Z","image":null,"description":"يبدو أنني كنت مخطئًا بشأن Linux على سطح المكتب، ويبدو أن حكمي كان صادرًا عن شعور بالإحباط بعد تجربتي لكثير من التوزيعات التي يُفترض أن تكون سهلة الاستخدام، وبعد المشاكل التي واجهتني، فقد كنت قررت أن أترك توزيعات Linux إلى الأبد، لكنني منذ أقل من شهر اضطررت لإعادة تثبيت Windows تخلصًا من كثير من البرامج التي ثبتتها فيما مضى ولم أعد محتاجًا لها. كنت أريد إعادة تثبيت Windows 7 لكنني قررت أن أمنح Linux فرصة أخرى، وأن أثبته إلى جانب Windows، لكنني قمت بتثبيت Linux Mint 14 أولاً وقررت تجربتها، ولم أقم بتثبيت Windows بعدها.","images":0,"videos":0,"tracks":0,"links":0,"type":"text","page":3},{"html":"<h1 id=\"-2-\">ملخصات (2)</h1>\n<p>وعدت أنني سأكتب هذه الملخصات كلما توفرت لدي مجموعة من المقالات المناسبة للقراءة، والهدف من تلخيصها إعفاء القارئ من عناء قراءة المقالة كاملة، مع إتاحة الرابط إليها إن أحبّ. هذه المرة لن أكتفي بما حفظته في Diigo، بل سأدرج بعض الروابط من أرشيف ما قرأته في Pocket. كما أنني هذه المرة سأكتب شيئًا من أفكاري وأضمّن الروابط في سياق الحديث في بعض المواضع.</p>\n<h3 id=\"-firefox-os-mozilla-\">لمحة عن نظام Firefox OS من Mozilla للهواتف المحمولة</h3>\n<p><a href=\"https://www.youtube.com/results?search_query=firefox+os\">Firefox OS</a> نظام تشغيل للهواتف المحمولة تنوي Mozilla طرحه في بداية العام القادم، يستخدم نفس محرك الرسم (rendering engine) للمتصفح الشهير Firefox. في الحقيقة أجد هذا النظام مثيرًا جدًّا بسبب فكرته: التطبيقات (والنظام) في الحقيقة هي مواقع على الويب أو مجموعة صفحات ويب مكتوبة باللغات المعروفة HTML مع CSS وJavaScript. هناك عشرات الآلاف من مطوري الويب ومصممي المواقع.</p>\n<p>لا أستطيع أن أشرح ضمن الملخصات لماذا أتابع أخبار هذا النظام باهتمام كبير، والحقيقة أن موضوعًا كهذا يحتاج أكثر من تدوينة كذلك. الفكرة الأساسية التي أهتم بها هي أن النظام هو متصفح ويب، على غرار Chrome OS للحواسب، مما يتيح التخلص من طبقة كاملة من المكتبات والواجهات البرمجية المكتوبة بلغات أخرى، ويسرع زمن الإقلاع، ويوسع قاعدة التطبيقات لتشمل آلاف المواقع على الإنترنت التي يمكن تحويلها إلى تطبيقات ببضع سطور برمجية. إذا كُتب لهذا النظام أن يستمر، واستطاع أن يضمن حصته في سوق الهواتف المحمولة الذي يشهد تنافسًا شديدًا على مستوى الهواتف الذكية بين الأنظمة الشهيرة Android وiOS وWindows Phone، فإنه سيغير من معنى الويب لتصبح البيئة الموحّدة للتطبيقات على مختلف الأجهزة. بتبني واجهات Mozilla البرمجية المفتوحة المصدر والمتاحة للجميع، وبناء تطبيقات ويب معتمدة عليها، لن يعود هناك حاجة لكتابة تطبيق لكل نظام تشغيل للهواتف المحمولة.</p>\n<p>لنأخذ على سبيل المثال Dropbox، أحد أشهر التطبيقات العابرة للمنصات (cross-platform، بمعنى أنه يعمل على أكثر من تركيب من الأجهزة والأنظمة). مطورو التطبيق يصدرون تطبيقات لهواتف Android وiPhone والأجهزة اللوحية، وكذلك يطورون واجهة موقع الويب ونسخة خاصة من موقع الويب للهواتف المحمولة، وكل من هذه الإصدارات التي تؤدي بالأساس شيئًا واحدًا، تحتاج إلى جهد ومتابعة دائمة وصيانة وإصدار تحديثات مستمرة. لو اعتمد المطورون على واجهات Firefox OS واستخدموا المفاهيم الحديثة في تصميم الويب (مثل Responsive design ومفاهيم أخرى)، فسيصبح بالإمكان توحيد الجهود لصنع نسخة واحدة من الخدمة (لم أذكر هنا تطبيقات Dropbox لأنظمة Windows وMac OS X وLinux لأن الحاجة إليها ستبقى موجودة). عندما تتحد الجهود بدلاً من أن تتشتت، وعندما يُقبل آلاف المبرمجين على تصميم تطبيقات ويب موحّدة، فإن وتيرة تطور التقنيات المستخدمة لتصميم هذه التطبيقات ستزداد بسرعة كبيرة وسنشاهد تطبيقات عملية لهذه التقنيات ربما لم نكن لنشاهدها إلا بعد عشرة أعوام.</p>\n<p>لكن هل تمتلك Mozilla موارد كافية لفعل هذا؟ وهل لديها تقنيات منافسة لتقنيات Google أو Apple؟ على الأقل هم يفهمون موقعهم، ويحاولون الدفع بالنظام في سوق الهواتف البسيطة، ثم الهواتف الذكية فيما بعد.</p>\n<p>استطعت <a href=\"https://ftp.mozilla.org/pub/mozilla.org/b2g/nightly/latest-mozilla-central/\">تجربة النظام على الكمبيوتر</a> البارحة، وعلى الرغم من كون <a href=\"https://plus.google.com/111992038052913129304/posts/GbGCWWTYMvw\">النسخة التي جربتها</a> قديمة، إلا أنها تسمح بإعطاء فكرة عن النظام وواجهاته. ضمن <a href=\"https://wiki.mozilla.org/B2G\">صفحة المشروع</a> وجدت بعض الصور <a href=\"https://wiki.mozilla.org/Gaia\">لواجهة للنظام</a> بإصدارات أحدث (أو لما يفترض أن يصبح عليه) والمستندات التي تشرح مفاهيم تصميمه.<br>كنت <a href=\"http://www.it-scoop.com/2011/07/mozilla-boot-to-gecko/\">كتبت في المجلة التقنية</a> عن المشروع بعد بضعة أيام من الإعلان عنه (على الرغم من أن الفكرة كانت غامضة إلى حد ما بالنسبة لي).</p>\n<h3 id=\"-windows-phone-8-windows-8\">الكشف عن Windows Phone 8 وWindows 8</h3>\n<p>Windows Phone يتميز بواجهة جميلة تجمع بين البساطة والعملية، المربعات والمستطيلات المختلفة الألوان المصفوفة جنبًا إلى جنب والتحديثات التي تظهر عليها تجعل الشاشة غنية بالمعلومات التي تحتاجها سريعًا، في Android وiOS تحتاج إلى عدة نقرات على الشاشة لتصل إلى تذكير أو ملاحظة أو معلومة تحتاجه على الفور. في شرح <a href=\"https://www.youtube.com/watch?v=SQZEkXCE_fY\">ما الجديد في الإصدار 8</a>، يتحدث أحد المشرفين على التطوير عن كون التجربة شخصية، ويسخر من كلا النظامين المنافسين Android وiOS بقوله إنه من الصعب التمييز بين عدة هواتف موضوعة معًا على طاولة واحدة، أتساءل هل من الممكن حقًّا التمييز بين عدة هواتف Windows Phone تتشابه جميعها في المربعات والمستطيلات ولا يمكن فيها رؤية صورة خلفية؟ التفريق الوحيد يكون في لون الجهاز وهو شيء حسن. أما في Android فيمكنك صنع ما تشاء بواجهة هاتفك وتخصيصها، وهذا واقعي لأنني لم أجد هاتفين متشابهين في محتوى الشاشة يعملان بنظام Android.</p>\n<p>في المقابل، لا أرى الشيء الذي يدفعني لاستخدام Windows 8 بالفأرة ولوحة المفاتيح، هل تفكر Microsoft بمئات الملايين من المستخدمين الذين لا يملكون شاشات تعمل باللمس؟ الواجهة تحتاج إلى تعلّم من جديد دون أن تحقق شيئًا أكثر إفادة، أما واجهة Windows 7 فهي مألوفة ومفهومة وتؤدي نفس المهمات. إذا لم يكن لديك شاشة تعمل باللمس، فلا تنتقل إلى Windows 8.  </p>\n<blockquote>\n<p>&quot;Now, they don&#39;t have too many options left, but they still have a cash cow. And if they insist on trying out whole new UIs, then do it, but let Windows become a quiet reliable and invisible platform, and do experimentation elsewhere.&quot; -- <a href=\"http://threads2.scripting.com/2012/october/microsoftKeepsBlowingIt\">Microsoft keeps blowing it</a></p>\n</blockquote>\n<p>بالحديث عن الحاجة لتعلم الواجهة الجديدة، مررت منذ عدة أيام بمدونة بالإنكليزية تحمل عنوان <a href=\"http://linuxhaters.blogspot.co.uk/\">&quot;كاره لينكس&quot;</a>، وعلى الرغم من عشرات الشتائم والكلمات البذيئة التي يطلقها الكاتب في كل تدوينة، فإنه بالفعل يملك رؤية دقيقة لما يجب أن تكون عليه أنظمة التشغيل، فيما يلي بعض <a href=\"http://linuxhaters.blogspot.co.uk/2008/09/its-all-about-determination.html\">مما كتبه حول الانتقال إلى Linux</a>:</p>\n<blockquote>\n<p>عادة، ليصبح الناس أكثر إنتاجًا [بالانتقال إلى Linux]، فإما ألّا يحتاجوا إلى تعلم شيء جديد ليستطيعوا تحقيق شيء أفضل قليلاً مما كانوا يحققونه دومًا، وإما أن يحتاجوا إلى تعلم القليل مجدّدًا ليستطيعوا تحقيق شيء لم يكونوا قادرين على تحقيقه.</p>\n<p>الانتقال إلى Linux بالنسبة لبعض الناس لا يحقق أيًّا من الأمرين السابقين، عليك تعلم الكثير لتفعل ما كنت تفعله. وعندما تنتقل إليه، تخسر الكثير جدًّا من التطبيقات، مما يقلل إمكانياتك.</p>\n<p>[ساخرًا] أوه صحيح، لكنه بالفعل يتيح لك أن تضيّع الكثير من أيام العطلة في محاولة لتعلم البرمجة لتصحيح الأخطاء البرمجية والمساهمة في كتابة النصوص البرمجية بحيث يصبح لديك برنامج قادر على تنفيذ ما كنت قادرًا على فعله قبل أن تبدأ بهذا. لا، للأسف ليس هنا تعليمة لاستعادة الأيام الضائعة.</p>\n</blockquote>\n<p>الكاتب يفكر هنا بصورة منطقيّة، وهو غالبًا مستخدم قديم لـLinux ومبرمج كذلك، وربما يصف تجربته التعيسة.</p>\n<h3 id=\"-http-www-livestrong-com-article-532439-the-recommended-percentages-of-fiber-protein-carbohydrates-fat-\"><a href=\"http://www.livestrong.com/article/532439-the-recommended-percentages-of-fiber-protein-carbohydrates-fat/\">النسب المفضلة للألياف والبروتين والنشويات والدهون</a></h3>\n<p><a href=\"http://loseit.com/\">Lose It!</a> يسمح بمراقبة ما تتناوله خلال اليوم على Android وiPhone وعبر الموقع، كما يسمح بمراقبة النسب المئوية للعناصر الغذائية في ما تتناوله، وتحديد هدف للوزن الذي تريد الوصول إليه، وإنشاء أطباق وأطعمة مخصصة في حال لم تعثر على ما تريده في قائمة الطعام (لأن معظم الأطعمة فيه متلائمة مع الحياة الغربية). التطبيق رائع بكل معنى الكلمة وأفضل ما فيه أنه متوفر لـAndroid مما يغني المستخدم عن الحاجة لزيارة الموقع في كل مرة يريد فيها إدخال ما تناوله. قمت بالبحث عن النسب المثالية للعناصر الغذائية لأحرص على الالتزام بها ما أمكنني.</p>\n<h4 id=\"-\">البروتينات</h4>\n<ul>\n<li>يجب أن تساهم البروتينات بما نسبته <strong>10% إلى 35%</strong> من إجمالي الحريرات [يوميًّا].</li>\n<li>يجب أن تستهلك 0.8 غ من البروتين لكل 1 كغ من وزنك.</li>\n<li>اختر البروتينات الصافية، كلحوم الدواجن المنزوعة الجلد، والسمك، والمكسرات والبقوليات وزبدة الفول السوداني والألبان القليلة الدسم. قلل استهلاك البروتينات المترافقة مع نسبة عالية من الدسم، مثل اللحوم الحمراء والحليب كامل الدسم.</li>\n</ul>\n<h4 id=\"-\">الدهون</h4>\n<ul>\n<li>الدهون، وهي العنصر الغذائي الأكثر كثافة من حيث الحريرات، يجب أن تتراوحه نسبته في الغذاء [اليومي] <strong>بين 20% و35%</strong> من كامل الحريرات. يجب أن تؤلف الدهون المشبعة أقل من 10% من كامل الدهون المتناولة، والدهون المتحولة يجب أن تكون أقل من 1%.</li>\n<li>تجنب مصادر الدهون غير الصحية كالزبدة والكريمة والحليب كامل الدسم واللحوم الحمراء.</li>\n</ul>\n<h4 id=\"-\">السكريات</h4>\n<ul>\n<li>(...) <strong>بين 45% و65%</strong> من إجمالي الحريرات [يوميًّا]. يجب أن يبقى الأشخاص الذين يكثرون الجلوس ولا يتحركون كثيرًا عند الحد الأدنى، أما أولئك الذين يتحركون بكثرة والرياضيون فيجب أن يسعوا إلى الحد الأعلى.</li>\n<li>عند اختيار الأغذية الحاوية على السكريات، اختر الفواكه والخضار والحبوب الكاملة والألبان قليلة الدسم وتجنب السكريات المكررة والبسيطة لأنها لا تقدم قيمة غذائية وتسبب زيادة في الوزن عند الإفراط في تناولها.</li>\n</ul>\n<h3 id=\"-\">روابط أخرى</h3>\n<ul>\n<li><a href=\"https://www.youtube.com/playlist?list=PLFC0917E83BCC66DE\">‫ورشة عمل تطبيقات أندرويد‬‎ - YouTube</a> (بالعربية): قائمة بأكثر من 30 مقطع فيديو لورشة عمل حول Android. سأحاول مشاهدتها بما أنني نجحت مؤخرًا في تركيب بيئة Eclipse IDE للتطوير بلغة Java وتركيب إضافة تطوير Android عليها وتحميل طقم تطوير Android، وتصميم برنامج بسيط جدًّا وتجربته على هاتفي، واكتسبت أساسيات Java.</li>\n<li><a href=\"https://www.youtube.com/course?list=EC2F07DBCDCC01493A&amp;feature=plcp\">Android Application Development Tutorials</a> (بالإنكليزية): 200 مقطع فيديو تشرح خطوة بخطوة كيفية تركيب بيئة تطوير Eclipse وتطوير برامج Android.</li>\n<li><a href=\"http://www.shabayek.com/blog/2012/10/29/%D9%83%D8%AA%D8%A7%D8%A8%D8%A9-%D9%87%D8%AF%D9%81%D9%83-%D9%88%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B9%D8%AF%D8%A7%D8%AF-%D9%84%D9%84%D9%85%D8%B4%D8%A7%D9%83%D9%84-%D9%8A%D8%A4%D8%AF%D9%8A-%D9%84%D9%84/\">كتابة هدفك والاستعداد للمشاكل يؤدي للنجاح -- مدونة شبايك</a></li>\n<li><a href=\"http://ardroid.aitnews.com/2012/10/30/matias-duarte-answers-nexus-questions/\">لماذا يعمل حاسب نيكسوس 10 اللوحي بواجهة الهاتف؟ ولماذا لا تدعم أجهزة نيكسوس الذواكر الخارجية؟ غوغل تجيب | Ardroid | أردرويد</a>: هل تهتم Google حقًا بتجربة المستخدم؟ كما يذكر أحد المعلقين، فإن Google قدمت Honeycomb (النسخة 3.0 من Android) بواجهات مختلفة كليًّا عن النظام السابق Gingerbread لأن تجربة استخدام الجهاز اللوحي مختلفة عن Gingerbread وشاعت السخرية من كون واجهة iPad نسخة مكبرة عن iPhone، إذا لماذا عادت Google الآن لتجعل حاسبها اللوحي نسخة مكبرة عن هواتفها؟ حلال على Google وحرام على Apple؟</li>\n</ul>\n","title":"ملخصات (2)","filename":"digest-2.json","id":"digest-2","date":"2012-11-01T00:00:00.000Z","image":null,"description":"وعدت أنني سأكتب هذه الملخصات كلما توفرت لدي مجموعة من المقالات المناسبة للقراءة، والهدف من تلخيصها إعفاء القارئ من عناء قراءة المقالة كاملة، مع إتاحة الرابط إليها إن أحبّ. هذه المرة لن أكتفي بما حفظته في Diigo، بل سأدرج بعض الروابط من أرشيف ما قرأته في Pocket. كما أنني هذه المرة سأكتب شيئًا من أفكاري وأضمّن الروابط في سياق الحديث في بعض المواضع.","images":0,"videos":0,"tracks":0,"links":16,"type":"text","page":3},{"html":"<h1 id=\"-play-\">طرق لتجاوز حظر سوق Play في سوريا (للمبتدئين)</h1>\n<p>مستخدمو Android في سوريا يعانون من صعوبة العثور على تطبيقات ذات جودة عالية وبسهولة، وغالبًا ما يلجأون إلى استخدام متاجر بديلة مثل <a href=\"http://1mobile.com/\">1Mobile</a> و<a href=\"http://getjar.com/\">GetJar</a>، ولكن هذه التطبيقات تحتوي برامج من نوعية رديئة جنبًا إلى جنب مع البرامج العالية الجودة وقد تحمل نسخًا غير متوافقة مع الجهاز الذي تستخدمه. بكل الأحوال تبقى هذه المتاجر خيارًا جيًّدا لتحميل التطبيقات الشهيرة وبسرعة دون الحاجة إلى طرق معقدة. لكنني هنا سأشرح طريقة الوصول لأي تطبيق متوافق مع جهازك وتحميله مباشرة من سوق Play الرسمي، هكذا تضمن أنك ستحصل على أحدث الإصدارات من البرامج المتوافقة مع جهازك.</p>\n<p><strong>تحذير: لست مسؤولاً عن أي خلل فيزيائي أو برمجي يطرأ على جهازك نتيجة اتباع هذه الخطوات.**</strong>إذا لم تعرض الصور في هذه الصفحة (غالبًا تكون محجوبة)، استخدم برنامجًا لتجاوز الحجب.<strong>  \n</strong>هذه الطرق للمبتدئين، والمقصود أنني قمت بشرح كل الخطوات بالتفصيل الممل وأتوقع من المبتدئين الالتزام بها بحذافيرها، أما المستخدمون الأكثر خبرة فبإمكانهم تجاوز أو تغيير بعض الخطوات، أو استخدام طرق أخرى. **  </p>\n<p><strong>هذه ليست الطرق الوحيدة المتاحة للوصول إلى سوق Play، ربما توجد طرق أسرع وأفضل، لكنني أقدم لك الطرق التي تصلح لمعظم الأجهزة وتكون مضمونة دومًا ومتاحة في المستقبل على عكس بعض الطرق التي تمنح المستخدمين وصولاً مؤقتًا.</strong>  </p>\n<h3 id=\"-\">الطريقة الأولى: التحميل من الهاتف/اللوحي مباشرة</h3>\n<p><strong>ما تحتاجه (لا يهم الترتيب الذي تنفذ فيه، المهم أن تكون جميعها متوفرة في جهازك في النهاية):</strong></p>\n<ul>\n<li><strong>جهاز حديث بصلاحيات root:</strong> لن أشرح في هذه التدوينة كيفية فعل هذا، فهناك على الويب عشرات المقالات بالعربية التي تشرح لك كيف تحصل على صلاحيات root خطوةً بخطوة، كذلك تختلف الطرق من جهاز لآخر وإن تشابهت. ربما أفرد تدوينة مستقلة لاحقًا، لكن إن كنت تستطيع الحصول على صلاحيات root في جهازك، فهذه الطريقة مناسبة لك؛ أو انتقل إلى <a href=\"http://ardroid.aitnews.com/2010/08/22/the-complete-guide-to-android-market/\">هذه المقالة الممتازة على أردرويد</a> إن أحببت <em>(المقالة قديمة وقد لا تعمل بشكل مباشر، حاول أن تستخدم برامج بديلة، بإمكانك أيضًا تفكيك الطرق في هذه المقالة مع الطرق في مقالة أردرويد وإعادة دمجها بما تسمح به خبرتك!)</em>. ذكرت أن الجهاز يجب أن يكون &quot;حديثًا&quot;، أي أنه يحمل النسخة 2.2 على الأقل من Android، قد تصلح الطريقة لنسخ أقدم لكنني غير متأكد من هذا.</li>\n<li><strong>البرامج: MarketEnabler وTransparent Proxy وOrbot</strong> (للتحميل <a href=\"https://www.dropbox.com/sh/tk20lr2g8t0zozs/5AX80gwP6i\">انقر هنا</a>، سأحاول تحديث الإصدارات من وقت لآخر، لكن في حال صدور نسخ أحدث من Orbot، جرب <a href=\"http://www.1mobile.com/search.php?keywords=orbot\">تحميلها من متجر 1Mobile</a>). ربّما لا تحتاج Transparent Proxy وهذا يحدده طبيعة جهازك (بعبارة أكثر دقة: دعم نواة جهازك لخاصية معينة)، لكن تثبيته لن يضر جهازك. أيضًا تستطيع استخدام برامج VPN أوSSH كبديل عن Orbot وTransparent Proxy معًا، لكن معظم هذه التطبيقات محدودة أو غير مجانية أو محجوبة في سوريا. أنصحك باستخدام Orbot مع Transparent Proxy في حال كان لديك اتصال سريع بالإنترنت لأن Orbot بطيء وقد تحتاج لتكرار محاولة تحميل التطبيق من السوق أكثر من مرة. MarketEnabler ضروري مهما كان جهازك.</li>\n<li><strong>حساب على Google للدخول إلى سوق Play</strong>، يفضل أن تنشئ حسابًا جديدًا غير مرتبط برقم هاتف سوري، ولا تقم بتعيين البلد إلى سوريا أثناء إنشاء الحساب، وإذا أمكن قم بانشائه باستخدام برنامج VPN أو SSH أو أي طريقة تسمح لك بإخفاء رقم IP السوري. لا أعرف بالضبط إن كانت هذه الخطوة بكل تفاصيلها ضرورية، لكنها مضمونة أكثر وهذا ما فعلته.</li>\n</ul>\n<p><strong>الكيفية:</strong></p>\n<ul>\n<li>تأكد أنك حصلت على صلاحيات root بالفعل، ابحث عن تطبيق Superuser أو SuperSU في قائمة التطبيقات على هاتفك، فإن لم تجده فهذا يعني أنك لم تنجح في الحصول على الصلاحيات (أو ربما حصلت عليها لكن التطبيق الذي يدير الصلاحيات لم يُثبّت على جهازك)، وإن وجدته فهذا يعني غالبًا أنك نجحت في ذلك.</li>\n<li>ثبت التطبيقات التي حملتها (من الفقرة الأولى) بأي ترتيب.</li>\n<li>شغل Orbot، ستشاهد أول مرة شاشة الإعداد، يمكنك تجاوزها (سيخبرك البرنامج أنه من الأفضل طلب صلاحيات root ليعمل كما يجب، لا توافق على هذا، لأننا سنستخدم Transparent Proxy ليؤدي الوظيفة نفسها التي سيؤديها Orbot عندما يحصل على صلاحيات root).</li>\n<li>ستشاهد شاشة Orbot الرئيسية الآن، اضغط مطوّلاً على الزر الكبير ذي اللون الرمادي، سيتحول إلى اللون الأصفر الذي يشير إلى أن التطبيق يحاول الاتصال الآن، عند نجاح الاتصال (الذي سيستغرق وقتًا أطول في المرة الأولى) سيتحول اللون إلى الأخضر.<img src='content/images/screenshot_2012-10-29_0017.png' title='null' text=''/></li>\n</ul>\n<p>Orbot قبل الاتصال</p>\n<p><img src='content/images/screenshot_2012-10-29_0018.png' title='null' text=''/></p>\n<p>Orbot يحاول الاتصال</p>\n<p><img src='content/images/screenshot_2012-10-29_0018_2.png' title='null' text=''/></p>\n<p>Orbot متصل</p>\n<ul>\n<li><p>الآن Orbot يعمل، لكن هذا لا يكفي، والسبب أنك بحاجة إلى تطبيق Transparent Proxy ليقوم بتحويل طلبات الاتصال بالإنترنت إلى Orbot الذي يقوم بتشفيرها وتعميتها وبالتالي يخفي هويتك عن سوق Play  (وجميع البرامج الأخرى) ويسمح بتجاوز الحجب.</p>\n</li>\n<li><p>انتقل إلى تطبيق Transparent Proxy دون الخروج من Orbot (أي اتركه يعمل في الخلفية ولا تختر Exit من القائمة، عندما يعمل Orbot في الخلفية تظهر في منطقة التنبيهات إشارة معلومات مرفقة بعبارة Connected to the Tor network).</p>\n</li>\n<li>الشاشة الرئيسية لتطبيق Transparent Proxy تحوي عدة مجموعات من الخيارات، نحتاج أولاً إلى ضبط إعداداته ليعمل مع Orbot.<img src='content/images/screenshot_2012-10-29_0020.png' title='null' text=''/></li>\n</ul>\n<p>الشاشة الرئيسية لتطبيق Transparent Proxy</p>\n<ul>\n<li>انقر على Proxy Type واختر HTTP</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_1.png' title='null' text=''/></p>\n<ul>\n<li>انقر على Proxy Host واكتب localhost (كلمة واحدة) ثم OK</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_5.png' title='null' text=''/></p>\n<ul>\n<li>انقر على Proxy Port واكتب 8118 ثم OK</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_4.png' title='null' text=''/></p>\n<ul>\n<li>فعل التطبيق بالنقر على Proxy في أول القائمة، عند تشغيله أول مرة ستظهر نافذة تخيرك إذا كنت تريد السماح للبرنامج بالوصول إلى صلاحيات root، ونحن نريد هذا بالطبع، لذا اختر Grant أو Allow للسماح له.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0020_6.png' title='null' text=''/></p>\n<ul>\n<li>الآن نحتاج أن نتأكد من أننا قمنا بالخطوات بشكل صحيح، اذهب إلى متصفح الويب واكتب العنوان <a href=\"https://check.torproject.org/\">https://check.torproject.org</a>، إذا شاهدت النص المكتوب بخط أخضر (Congratulations. Your browser is configured to use Tor.) فهذا يعني أننا انتهينا من إعداد Orbot وTransparent Proxy، وبقي أن ننتقل إلى MarketEnabler.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0021.png' title='null' text=''/></p>\n<p>الصفحة التي تشاهدها عندما تضبط Orbot مع Transparent Proxy بشكل صحيح</p>\n<ul>\n<li>أما إذا لم يتمكن المتصفح من تحميل الصفحة، أو ظهرت عبارة بخط أحمر (Sorry. You are not using Tor.)، فهذا يعني أنك ارتكبت خطأ ما عند اتباعك الخطوات، أو أن جهازك بوضعه الحالي غير قادر على تنفيذ هذه الخطوات.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0019.png' title='null' text=''/></p>\n<p>كيف تظهر الصفحة عندما لا يعمل Orbot مع Transparent Proxy كما يجب </p>\n<ul>\n<li>بعد نجاح الخطوات السابقة، انتقل إلى MarketEnabler، ثم انقر على تبويب (Settings list)، انقر مطولاً على أي عنصر في القائمة (أفضّل الأوّل)، ثم اختر fake this provider now. في المرة الأولى ستظهر نافذة مماثلة لتلك التي ظهرت عندما فعلت Transparent Proxy تسألك إذا كنت تريد السماح للبرنامج بالوصول إلى صلاحيات root. اختر Allow أو Grant؛ سيبدأ بعدها التطبيق بالعمل لبضع ثوانٍ ليخبرك في رسالة أنه تم ضبط الإعدادات بنجاح (Done and all set). <em>عند إعادة تشغيل الجهاز يفقد MarketEnabler إعداداته وستحتاج إلى تكرار هذه الخطوة في كل مرة تعيد فيها تشغيل الجهاز (وربّما تحتاج لإعادتها حتى دون إعادة تشغيل الجهاز في بعض الأحيان، لم أفهم آلية عمل التطبيق بشكل كامل)</em>.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0024_1.png' title='null' text=''/></p>\n<p>انقر على تبويب Settings list</p>\n<p><img src='content/images/screenshot_2012-10-29_0024_2.png' title='null' text=''/></p>\n<p>بعد النقر مطولاً على أول عنصر في القائمة، اختر fake this provider now</p>\n<p><img src='content/images/screenshot_2012-10-29_0025_1.png' title='null' text=''/></p>\n<p>انتظر ريثما ينهي البرنامج عمله</p>\n<p><img src='content/images/screenshot_2012-10-29_0025.png' title='null' text=''/></p>\n<p>الرسالة Done and all set تظهر عند نجاح العملية</p>\n<ul>\n<li>انتقل الآن إلى سوق Play، سيبدأ التحميل. انقر على زر القائمة في جهازك واختر Accounts، ثم اختر حساب Google الذي أنشأته حديثًا كما في بداية شرح هذه الطريقة، إن لم تكن قد أضفته، فإذهب إلى إعدادات النظام > الحسابات والمزامنة ثم أضف الحساب الجديد بإدخال اسم المستخدم وكلمة المرور. الآن أنت تستخدم السوق بالحساب الجديد، سيستغرق التحميل للمرة الأولى فترة طويلة نسبيًّا والسبب أن السوق يقوم بتحديث نفسه وتنزيل آخر إصدار، بعدها يُفترض أن يكون وقت التحميل أقل، يعتمد الأمر على سرعة الاتصال بالإنترنت لديك في الحالتين.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0022_2.png' title='null' text=''/></p>\n<p>بعد الضغط على زر القائمة، اختر Accounts</p>\n<p><img src='content/images/screenshot_2012-10-29_0022_3.png' title='null' text=''/></p>\n<p>اختر الحساب الجديد الذي أنشأته</p>\n<p><img src='content/images/screenshot_2012-10-29_0025_2.png' title='null' text=''/></p>\n<p>انتظر ريثما يعيد السوق التحميل مجدّدًا</p>\n<ul>\n<li>بعد أن ظهرت أقسام السوق، ابحث عن التطبيق أو الكتاب أو أي محتوى تريد تحميله ثم انقر عليه لتظهر لك تفاصيله، ستشاهد زر Install إن لم يكن التطبيق مثبّتًا لديك، أو زر Update إن كانت نسخته لديك قديمة، أو زر Open لفتح التطبيق إن كان مثبتًا. اضغط Install في الحالة الأولى لتثبيت التطبيق.<img src='content/images/screenshot_2012-10-29_0026.png' title='null' text=''/></li>\n</ul>\n<p>الصفحة الرئيسية لقسم التطبيقات في سوق Play</p>\n<p><img src='content/images/screenshot_2012-10-29_0027_2.png' title='null' text=''/></p>\n<ul>\n<li>ستظهر شاشة تعرض معلومات عن الصلاحيات التي يتطلبها البرنامج (الوصول للإنترنت، تخزين المعلومات على بطاقة الذاكرة... إلخ.) وهي تختلف من برنامج لآخر، كن حذرًا ولا تقم بتثبيت تطبيقات غير مأمونة. اضغط Accept &amp; download للموافقة على تثبيت التطبيق والبدء بتحميله.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0027_3.png' title='null' text=''/></p>\n<ul>\n<li>يبدأ تحميل التطبيق وبالإمكان مشاهدة تقدم التحميل (إذا أردت أن يقوم السوق بتحديث التطبيق كلما صدرت نسخة جديدة، فاختر Allow automatic updating، وهذا يحتاج أن تكون متصلاً دومًا عبر Orbot وTransparent Proxy وأن يكون Market Enabler مضبوطًا).</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0027_4.png' title='null' text=''/></p>\n<p>يبدأ تحميل التطبيق</p>\n<p><img src='content/images/screenshot_2012-10-29_0027_5.png' title='null' text=''/></p>\n<p>يجري تحميل التطبيق</p>\n<p><img src='content/images/screenshot_2012-10-29_0028.png' title='null' text=''/></p>\n<p>خيار Allow automatic updating يسمح بالتحديث التلقائي للتطبيق</p>\n<ul>\n<li>سيقوم السوق بتثبيت التطبيق مباشرة بعد نهاية التحميل ودون أن يعرض لك نافذة التثبيت؛ عند الانتهاء من تحميل التطبيق وتثبيته تظهر أزرار Open لفتح التطبيق وUninstall لإزالته.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0028_2.png' title='null' text=''/></p>\n<p>تم تثبيت التطبيق</p>\n<ul>\n<li>بعد الانتهاء من تحميل التطبيقات التي تحتاجها، انتقل إلى Transparent Proxy وألغِ الخيار Proxy في أول القائمة، ثم انتقل إلى Orbot وقم بالنقر مطوّلاً على الزر الأخضر الكبير لإطفائه. هذه الخطوة اختيارية لكنها أفضل من حيث أنك ستعود إلى السرعة الطبيعيّة لاتصال الإنترنت الذي تستخدمه، لكنّها أسوأ من حيث أنّ Orbot يقدّم تشفيرًا لكلّ البيانات المتبادلة عن طريقه، كما أنّك ستحتاج إلى إعادة جميع الخطوات كلّما أردت تحميل تطبيق من السوق.<img src='content/images/screenshot_2012-10-29_0029.png' title='null' text=''/></li>\n</ul>\n<p>أزل الإشارة من خيار Proxy</p>\n<p><img src='content/images/screenshot_2012-10-29_0029_2.png' title='null' text=''/></p>\n<p>أطفئ Orbot بالضغط مطوّلاً على الزر الكبير لجعله رماديّ اللون</p>\n<p><strong>ملاحظات:</strong></p>\n<ul>\n<li>إذا فقدت القدرة على تصفح الويب واستخدام الإنترنت على الجهاز فهذا لأنك نسيت تعطيل Transparent Proxy بعد أن قمت بإيقاف Orbot. عد إلى تطبيق Transparent Proxy وأزل إشارة &quot;صح&quot; من الخيار Proxy في بداية القائمة.</li>\n<li>عندما يفشل Orbot في الاتصال أو يستغرق وقتًا أطول من المعتاد جرب أن تعيد تشغيل الجهاز (لا تنسى إعادة ضبط MarketEnabler بعد إعادة التشغيل كذلك).</li>\n<li>أحيانًا تظهر رسالة خطأ في المتجر (&quot;Connection timed out.&quot;) وهذا يشير إلى بطء الاتصال بالإنترنت، أغلق البرامج التي تستخدم الإنترنت في جهازك وبقية الأجهزة المتصلة بنفس الشبكة ثم أعد المحاولة بالضغط على زر Retry.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0023.png' title='null' text=''/></p>\n<ul>\n<li>إذا ظهرت الرسالة &quot;Authentication is required. You need to sign into your Google Account.&quot;، فهذا يعني أحد احتمالين: إما أنك لم تضبط MarketEnabler أو التطبيقين الآخرين بشكل صحيح (كرر الخطوة الموافقة) أو  إن حسابك مرتبط برقم هاتف سوري أو بالبلد سوريا ربّما.</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_0024.png' title='null' text=''/></p>\n<h3 id=\"-\">الطريقة الثانية: تحميل التطبيقات من جهاز كمبيوتر ثم نقلها إلى الجهاز</h3>\n<p>في هذه الطريقة، تحتاج إلى تنفيذ معظم الخطوات في الطريقة الأولى لمرة واحدة فقط، على الرغم من أنك ستحتاج إلى صلاحيات root  وجميع البرامج التي استخدمتها في الطريقة الأولى، إلا أنك تحتاج إلى فعل هذا مرة واحدة فقط، بعدها يمكنك تصفح البرامج التي ترغب بتحميلها من الكمبيوتر وتحميلها ثم نقلها إلى هاتفك؛ هذه الطريقة مريحة أكثر وغالبًا ما تكون أسرع.</p>\n<p><strong>ما تحتاجه:</strong></p>\n<ul>\n<li>جميع <a href=\"https://www.dropbox.com/sh/tk20lr2g8t0zozs/5AX80gwP6i\">البرامج من الطريقة الأولى</a>، </li>\n<li>وبرنامج DeviceID (انظر رابط التحميل في نهاية هذه الفقرة)،</li>\n<li>متصفح Chrome على جهاز الكمبيوتر </li>\n<li>إضافة APK Downloader لمتصفح Chrome على الكمبيوتر</li>\n<li><p>برنامجًا مثل Pshiphon 3 أو UltraSurf أو HotSpot Shield أو أي برنامج آخر يوفّر اتصالاً عبر VPN أو SSH.لتحميل القسم الثاني من البرامج والإضافات، <a href=\"https://www.dropbox.com/sh/748nbk5dhtxfgfk/zHyMQwgpsT?m\">انقر هنا</a>.<br><strong>الكيفية:</strong></p>\n</li>\n<li><p>أعد جميع الخطوات في الطريقة الأولى حتى تصل إلى شاشة سوق Play الرئيسية التي تعرض الأقسام (عليك فعل هذا مرة واحدة فقط).</p>\n</li>\n<li>ثبت DeviceID على جهازك وافتحه، تحت العنوان DeviceID ستجد مجموعة من الحروف والأرقام المتصلة عددها 16 حرفًا، احفظ هذا الرقم لديك على ورقة أو أرسله إلى نفسك عبر البريد الإلكتروني من زر Share المجاور أو أبقِ هاتفك بالقرب من الكمبيوتر (<em>المهم أن يكون في متناول يدك لأننا سنحتاج لإدخاله في الكمبيوتر</em>).</li>\n</ul>\n<p><img src='content/images/screenshot_2012-10-29_2301.png' title='null' text=''/></p>\n<ul>\n<li><p>أغلق Chrome بشكل نهائي، <em>إن كان يعمل في الخلفية فانقر على رمزه في زاوية النظام بالزر الأيمن للفأرة واختر Exit وانتظر بضع دقائق</em>.</p>\n</li>\n<li><p>اذهب إلى اختصار Chrome على سطح المكتب أو في شريط المهام أو في قائمة ابدأ (الاختصار الذي تستخدمه عادةً لفتح Chrome)</p>\n</li>\n<li>انقر على الاختصار بالزر الأيمن واختر Properties أو خصائص (إذا كان مثبّتًا في شريط المهام، ستحتاج إلى النقر على الرمز المصغر)</li>\n</ul>\n<p><img src='content/images/screenshot.178.jpg' title='null' text=''/></p>\n<ul>\n<li>نحتاج إلى إجبار Chrome على تجاوز التحقق من شهادات المواقع (<em>قد تعرض هذه الخطوة حاسوبك للخطر عند تصفح الويب إذ لا يقوم Chrome بتحذيرك عند زيارة مواقع مشبوهة</em>) في حقل Target أو الهدف، أضف إلى نهاية المسار (بعد C:\\...\\chrome.exe) مسافة ثم العبارة التالية كما هي دون تغيير:</li>\n</ul>\n<p>--ignore-certificate-errors --allow-running-insecure-content</p>\n<p><img src='content/images/screenshot.188.jpg' title='null' text=''/></p>\n<p>أدخل مسافة ثم العبارة كاملة في نهاية الحقل &quot;Target&quot;</p>\n<ul>\n<li><p>شغل Chrome من الاختصار الذي قمت بتعديله للتوّ، ثم ثبّت إضافة APK Downloader لمتصفح Chrome؛ النسخ الحديثة في Chrome لا تسمح بتثبيت الإضافات من خارج سوق Chrome الإلكتروني، لكن يمكن تجاوز هذا ببساطة: افتح صفحة الإضافات ثم اسحب ملف APK Downloader (وهو ملف بلاحقة .crx) من مدير الملفات في الكمبيوتر وأسقطه ضمن نافذة الإضافات، ثم اختر موافق لتثبيت الإضافة.</p>\n</li>\n<li><p>الآن عليك ضبط الإضافة لمرة واحدة فقط: حدث صفحة الإضافات وابحث عن APK Downloader ثم اختر Options.</p>\n</li>\n<li><p>اكتب عنوان البريد الإلكتروني لحساب Google الذي استخدمته في الخطوة الأولى لدخول سوق Play وكلمة المرور الموافقة. أدخل معرف الجهاز (Device ID) الذي حصلت عليه من برنامج Device ID في الحقل الموافق في إعدادات إضافة APK Downloader، ثم اضغط على زر Login.</p>\n</li>\n</ul>\n<p><img src='content/images/screenshot.166.jpg' title='null' text=''/> </p>\n<ul>\n<li>إذا تم تسجيل الدخول بنجاح، ستتغير شاشة الإعدادات لتعرض حقلين جديدين في الأسفل، وزر Save Settings. انقر على زر Save Settings فقط (<em>لا تنسى النقر عليه وإلا ستضطر لإعادة فتح خيارات الإضافة وملء الحقول</em>).</li>\n</ul>\n<p><img src='content/images/screenshot.170.jpg' title='null' text=''/></p>\n<ul>\n<li>ستظهر رسالة تخبرك بنجاح الضبط. إذا ظهرت رسالة خطأ فأعد المحاولة وتحقق من تنفيذك للخطوات بشكل صحيح.</li>\n</ul>\n<p><img src='content/images/screenshot.171.jpg' title='null' text=''/></p>\n<ul>\n<li>الآن شغل برنامج Psiphon 3 أو أي برنامج آخر قررت استخدامه، <em>تأكد من أنه يعمل مع المتصفح</em>.</li>\n<li>اذهب إلى سوق Play واختر البرنامج الذي تريده، ثم افتح صفحته وانتظر حتى يكتمل تحميل الصفحة، ستظهر عند ذلك أيقونة الإضافة APK Downloader في أقصى شريط العنوان في Chrome، انقر عليها لتنتقل إلى صفحة التحميل وليبدأ تحميل التطبيق مباشرة.<img src='content/images/screenshot.172.jpg' title='null' text=''/></li>\n</ul>\n<p>انقر على الصورة لتكبيرها</p>\n<p><img src='content/images/screenshot.174.jpg' title='null' text=''/></p>\n<p>انقر على الصورة لتكبيرها</p>\n<p><img src='content/images/screenshot.177.jpg' title='null' text=''/></p>\n<p>انقر على الصورة لتكبيرها</p>\n<ul>\n<li>تهانينا!<strong>ملاحظة:</strong></li>\n</ul>\n<p>إن واجهت أي مشكلة فلا تردد في ترك تعليق على التدوينة، لكن أولاً ارجع إلى الخطوات وتحقق منها واقرأ العبارات <em>المكتوبة بخط مائل</em> بتمعّن وتأكد من أنك نفذّتها.<br>لا تنسى مشاركة التدوينة مع أصدقائك!</p>\n","title":"طرق لتجاوز حظر سوق Play في سوريا (للمبتدئين)","filename":"access-google-play-in-syria.json","id":"access-google-play-in-syria","date":"2012-10-30T00:00:00.000Z","image":"content/images/screenshot_2012-10-29_0017.png","description":"مستخدمو Android في سوريا يعانون من صعوبة العثور على تطبيقات ذات جودة عالية وبسهولة، وغالبًا ما يلجأون إلى استخدام متاجر بديلة مثل 1Mobile وGetJar، ولكن هذه التطبيقات تحتوي برامج من نوعية رديئة جنبًا إلى جنب مع البرامج العالية الجودة وقد تحمل نسخًا غير متوافقة مع الجهاز الذي تستخدمه. بكل الأحوال تبقى هذه المتاجر خيارًا جيًّدا لتحميل التطبيقات الشهيرة وبسرعة دون الحاجة إلى طرق معقدة. لكنني هنا سأشرح طريقة الوصول لأي تطبيق متوافق مع جهازك وتحميله مباشرة من سوق Play الرسمي، هكذا تضمن أنك ستحصل على أحدث الإصدارات من البرامج المتوافقة مع جهازك.","images":37,"videos":0,"tracks":0,"links":8,"type":"text","page":3},{"html":"<h1 id=\"-\">ترتيب الكمبيوتر المفضل لي</h1>\n<p>يبدو العنوان غير مناسب، لأنني لا أعرف كيف أترجم كلمة &quot;setup&quot; إلى العربية، هل هي &quot;إعداد&quot; أم &quot;تجهيز&quot;؟ المهم أنني سأحاكي <a href=\"http://zenhabits.net/essential-mac/\">تدوينة</a> قرأتها مؤخرًا يتحدث فيها الكاتب عن البرامج التي يستعملها على حاسوبه ويشرح كلًّا منها باختصار.  </p>\n<h3 id=\"-windows-7\">نظام التشغيل: Windows 7</h3>\n<p>للأسف ليس <a href=\"http://www.ubuntu.com/\">Ubuntu</a> أو توزيعة Linux أخرى، والسبب بسيط: لقد <a href=\"http://tirania.org/blog/archive/2012/Aug-29.html\">انتهى عصر Linux على الحواسيب الشخصية</a> (الرابط لتدوينة كتبها مؤسس Gnome)، بينما يبدو مستقبله واعدًا جدًّا على الهواتف الذكية والأجهزة اللوحية. يحتاج الأمر الكثير من الشرح، لكنني بعد تجربة Ubuntu و<a href=\"http://www.linuxmint.com/\">Mint</a> و<a href=\"http://www.fedora.org/\">Fedora</a> وغيرها وواجهتي KDE وGnome، واجهت مشاكل في كل نسخة قد لا توجد في أخرى، والخلاصة أنني لم أجد توزيعة يُعتمد عليها كبديل لنظام Windows بشكل نهائي، المشاكل الأساسية تتعلق بأداء القرص الصلب وحرارته على جهاز Dell، والحاجة إلى استعمال الطرفية (Terminal) في كل مرة، والتي يدّعي الكثير من عشّاق Linux أنها أكثر كفاءة من استعمال الواجهات المرئية، وقد تبين لي أنّ هذا غير صحيح، ليس لقلة خبرتي في كتابة الأوامر (وهذا صحيح)، لكن فكرة اللجوء إليها لتثبيت برنامج أو إزالته، أو لتصحيح خطأ أصليّ في التوزيعة، أو حتى لتجميل الخط العربي القبيح، لا تبدو فكرة مقبولة لي ولكثير من المستخدمين الجدد.</p>\n<blockquote>\n<p>&quot;I spent a month experiencing Linux as a desktop OS. What I learned from the <a href=\"http://www.pcworld.com/businesscenter/article/229187/30_days_with_ubuntu_linux_day_1.html\">30 Days With Ubuntu Linux</a> experiment is that Linux is, in fact, capable of being a desktop OS. But, the whole 30 days <a href=\"http://www.pcworld.com/businesscenter/article/234885/ubuntu_linux_day_30_what_i_learned_from_30_days_with_ubuntu_linux.html\">felt like I was swimming upstream</a>--<strong>constantly tinkering and finding workarounds to get everyday tasks done</strong>.&quot; -- <a href=\"https://www.pcworld.com/article/252516/why_linux_on_the_desktop_is_dead.html\">PC World: Why Linux on the Desktop Is Dead</a> </p>\n</blockquote>\n<p>في المقابل، يبدو Windows 7 نظامًا مستقرًا وآمناً ولم أواجه خلال استخدامي له منذ صدوره مشاكل جدّيّة.  </p>\n<h3 id=\"dropbox-skydrive\">Dropbox وSkyDrive</h3>\n<p><a href=\"https://www.dropbox.com/\">Dropbox</a> خدمة تتيح لك مزامنة ملفاتك بين عدة أجهزة والاحتفاظ بها ضمن مساحة خاصة بك على مخدمات الشركة، بحسب قراءتي لتاريخ الخدمة، يبدو أنّها أقدم خدمة قدمت هذه الفكرة، ولا أجد هذا مستغربًا مع كل الأمان والثبات والذكاء الذي يقدمه تطبيق الخدمة على Windows وLinux وMac. الفكرة باختصار، أنه عند تثبيت البرنامج على جهازك، فإنه ينشئ لك مجلدًا عاديًّا على أي موضع تحدده، ثم تحفظ ملفاتك في هذا المجلد وسيقوم البرنامج برفعها إلى المخدم فورًا وتحميلها على بقية الحواسيب المتصلة، أي إنك ستجد ملفاتك التي حفظتها في هذا المجلد على كل أجهزتك وكذلك على الويب إذا كنت بعيدًا عنها واحتجتها؛ كذلك بإمكانك مشاركة مجلد فرعيّ مع الأصدقاء بحيث يمكنهم إضافة ملفات إليه. Dropbox يجب أن يوجد في كل نظام تشغيل أستعمله وفي كل جهاز أستعمله سواء هاتف أو كمبيوتر، لم يعد بإمكاني الاستغناء عنه.</p>\n<p><a href=\"https://apps.live.com/skydrive/app/9a65e47d-606a-4816-a246-90f54bf7a3ea\">SkyDrive</a> هو خدمة من Microsoft تقوم بالضبط بما يقوم به Dropbox، ويمكنك بالإضافة إلى هذا تحرير مستندات Word وPowerPoint وExcel من داخل المتصفح بعمليات التحرير الأساسية، بمعنى أنك قد لا تحتاج إلى شراء وتثبيت Office لديك إن كنت لا تهتم بكل الميزات المتقدمة التي توفرها، وأيضًا يمكنك مشاركة مستند مع أصدقائك ليقرأوه من الموقع مباشرة دون الحاجة لتثبيت Office لديهم.</p>\n<p>أفضل Dropbox عن غيره لأنه ذكي بما يكفي ليدرك أي جزء من الملف قد تغير فلا يعيد رفعه من الصفر (طبعًا هذا لا يصلح لكل أنواع الملفّات)، وكذلك فإنه ينسخ الملفات دون الحاجة لتحميلها ثانية للإنترنت إذا كان الجهاز متصلين عبر نفس الشبكة (بكلا الحالتين سيحتاج إلى وجود اتصال بالإنترنت ليُدرك أنه أٌجريت تغييرات في المجلد فيبدأ بالمزامنة)؛ بمعنى أنه - على عكس الخدمات المنافسة - لا يقوم بتحميل الملفات نفسها مرارًا إذا كنت تستعمل حاسوبين في المنزل، بل ينسخها ببساطة من أحدهما للآخر وبالاتجاهين. كذلك فإن كلاً من Dropbox وSkyDrive عند فقد بياناتهما أو تثبيت نظام تشغيل جديد لا يتجاهلان وجود الملفات ضمن مجلداتهما، بل يتعرفان عليها ولا يعيدان التحميل من الصفر.</p>\n<h3 id=\"-chrome-firefox\">المتصفح: Chrome وFirefox</h3>\n<p><a href=\"http://www.google.com/chrome\">Chrome</a> بشكل أساسيّ، مع عدد كبير من الإضافات وعدد قليل من التطبيقات (ربّما يحتاج الأمر تدوينة مستقلة!). <a href=\"http://www.firefox.com/\">Firefox</a> أستعمله على الجهاز المكتبي لأنه أقلّ ثقلاً على الذاكرة، خصوصًا أنني أستعمله مع عدد قليل من الإضافات أهمها <a href=\"https://addons.mozilla.org/en-US/firefox/addon/downthemall/\">DownThemAll!</a> للتحميل و<a href=\"http://www.diigo.com/\">Diigo</a> لتظليل الصفحات وإضافة الملاحظات إليها وحفظها.</p>\n<p>بعد صدور <a href=\"http://windows.microsoft.com/en-US/internet-explorer/downloads/ie-9/worldwide-languages\">Internet Explorer 9</a> لم يعد اختيار المتصفح أمرًا مهمًّا، فالصفحات أصبحت تُعرض في كل المتصفحات بالطريقة نفسها. <a href=\"http://www.opera.com/\">Opera</a> متصفح سريع وخفيف.</p>\n<h3 id=\"-microsoft-security-essentials\">مضاد الفيروسات: Microsoft Security Essentials</h3>\n<p>نعم لا تستغرب، لا يهمني كثيرًا أن أستعمل أقوى مضاد فيروسات أو أكثرها ميزات، ما يهمني حقًا هو أن يبقى أداء جهازي ضمن الحدود المقبولة، والأمر الآخر المهم هو أن يقوم مضاد الفيروسات بمنع التشغيل التلقائي للفيروسات على ذواكر التخزين، فقط لا غير. في السابق كنت أستخدم النسخة المجانية من Avira؛ أما برامج مثل BitDefender وKaspersky فهي أشياء تخلصت منها منذ أكثر من عامين.</p>\n<p><a href=\"http://windows.microsoft.com/mse\">Security Essentials</a> من Microsoft وكذلك الجدار الناري المدمج مع Windows يقدّمان ما أحتاجه وأكثر.</p>\n<h3 id=\"lightscreen\">Lightscreen</h3>\n<p>أداة لالتقاط صور الشاشة وحفظها مباشرة دون الحاجة إلى فتح الرسام ولصقها ثم تسميتها وحفظها في مجلد، بدل ذلك، فقط قم بتحديد المجلد الذي تريد الحفظ فيه، واضغط زر التقاط الشاشة على لوحة المفاتيح، وستجد كل صور الشاشة محفوظة في هذا المجلد. يمكنك أيضًا التقاط صورة لنافذة واحدة أو لأي جزء من الشاشة دون غيره. الفكرة التي أطبقها: جعل مجلد صور الشاشة مجلدًا فرعيَّا في مجلد Dropbox على جميع أجهزتي، وهكذا تبقى صور الشاشة من جميع الأجهزة في مجلد واحد ويمكنني الرجوع إليها في أي وقت (أستفيد منها في الشروح وفي التدوينات ولحفظ اقتباسات من كتب إلكترونية أقرأها). طبعًا <a href=\"http://lightscreen.sourceforge.net/\">Lightscreen</a> يستطيع أن يتعرف وجود صور في هذا المجلد فلا يستبدل صورًا من جهاز بصور من جهاز آخر، بل يسميها بالأرقام (&quot;screenshot12.png&quot;، &quot;screenshot13.png&quot;) أو أي اسم ولاحقة تحددهما.  </p>\n<h3 id=\"-\">مستعرض/محرر الصور</h3>\n<p>لا أستغني عن <a href=\"http://www.filehippo.com/download_picasa/\">Picasa</a>، عارض الصور فيه سريع للغاية ويقدم تجربة مريحة ومجموعة من المميزات العملية كتكبير الصورة بعجلة الفأرة ورفعها إلى ألبومات بيكاسا على الويب ومزامنة الألبومات كاملة والتعرف المذهل على الوجوه وتجميعها بحسب الشخص ثم اقتراح اسم الشخص بالاعتماد على صوره السابقة (حسنًا قد لا تكون هذه ميزة عمليّة حقًّا، لكنا تبقى رائعة!).</p>\n<p>محرر الصور في Picasa يحوي عشرات التأثيرات الجاهزة وإمكانية التصحيح التلقائي للصور، كما أن ميزة إزالة العين الحمراء تتعرف تلقائيًّا على موضع العيون الحمراء وتصححها، دون الحاجة إلى الإشارة إلى مواضع العيون ثم تصحيح كلّ منها كما في البرامج الأخرى.</p>\n<p>تقنيات البرنامج الواسعة وسرعته هي ما يستهويني، لأنها تشير إلى ذكاء مهندسيه، ويبدو أن هذا كان سببًا كافيًا لتستحوذ عليه Google.  </p>\n<h3 id=\"-\">التحرير الموسّع للصور</h3>\n<p><a href=\"http://www.getpaint.net/download.html\">Paint.NET</a> هو برنامج بسيط لكنه يحوي العمليات الأساسية التي يؤديها Photoshop ومجموعة من الأدوات المشابهة، تستطيع قص الصور وتعديل التباين والسطوع والإشباع وعكس الألوان وإضافة بعض التأثيرات بخصائص موسّعة مثل Blur بأنواعه وما إلى ذلك، بالإضافة إلى تحديد أجزاء الصورة وإضافة الطبقات (layers)... وبالإمكان أيضًا تثبيت <a href=\"http://forums.getpaint.net/index.php?/forum/7-plugins-publishing-only/\">إضافات</a> للبرنامج توسع قدراته.</p>\n<p>Paint.NET هو برنامج أكثر تقدمًا من الرسام بالّطبع، لكنه يقع قبل <a href=\"http://gimp.org/\">GIMP</a> من حيث التقدّم، والذي بدوره يقع قبل Photoshop.</p>\n<h3 id=\"-\">برنامج الأرشفة</h3>\n<p>برنامج <a href=\"http://www.filehippo.com/search?q=7zip\">7z</a> المجاني والمفتوح المصدر يدعم قراءة عدة أنواع من ملفات الأرشيف بما فيها zip وrar، وبإمكانه ضغط الملفات بتنسيقي zip و7z الخاص به والذي يعطي عند إنشاء ملف مضغوط حجمًا قريبًا جدًّا (وأحيانًا أصغر) من ملفات rar. البرنامج سريع وبسيط ولا يحتاج إلى شرح.</p>\n<p>عمومًا أفضل استخدام صيغة zip عند ضغط ملف ونشره على الويب لأنها متوافقة بشكل مدمج مع كل أنظمة التشغيل، ولا يحتاج المستخدم برامج مستقلة لقرائتها.</p>\n<h3 id=\"-\">مشغل الصوت والفيديو</h3>\n<p>Media Player Classic المضمن ضمن حزمة <a href=\"http://filehippo.com/download_klite_mega_codec/\">K-Lite Mega Codec Pack</a> كبرنامج افتراضي لجميع أنواع الصوت والفيديو لدي، خفيف وسريع وبإمكانه أن يعيدك إلى حيث وصلت في الملف الصوتي أو في الفيديو عند فتحه مرة أخرى (تحتاج إلى تفعيل هذا من الخيارات أولاً).</p>\n<p>أحيانًا أنسى وجود Windows Media Player، لم أستعمله منذ نحو سنتين أو أكثر.</p>\n<p><a href=\"http://www.videolan.org/\">VLC Media Player</a> برنامج مفتوح المصدر لكنه لا يعرض الترجمة العربية بشكل صحيح دائمًا، وكذلك فإنّه أبطئ من Media Player Classic.</p>\n<h3 id=\"-pdf\">قارئ PDF</h3>\n<p>حتى وقت قريب كنت أستخدم <a href=\"http://get.adobe.com/reader\">Adobe Reader</a>، وهذا يعني الحاجة المستمرة للتحديث وحجمًا كبيرًا للتحميل وبرنامج يسرع بدءه في بداية تشغيل Windows، وفوق هذا لا يتذكر الموضع الذي توقفت عنده ضمن الكتاب، أي أنني أضطر إلى تذكر أين وصلت في القراءة ثم الذهاب إلى هذا الموضع كل مرة أفتح فيها الكتاب.</p>\n<p>الآن أستخدم <a href=\"http://blog.kowalczyk.info/software/sumatrapdf/download-free-pdf-viewer.html\">Sumatra PDF</a> وهو برنامج خفيف جدًّا ويقدم الميزات الأساسيّة لأيّ قارئ PDF، وهو أيضًا مفتوح المصدر وعندما تفتح كتابًا مرة أخرى سيعيدك إلى حيث وصلت فيه، لكن ينقصه ميزة توجد في Adobe Reader هي إمكانية إضافة الملاحظات وتظليل النصوص ضمن الكتاب وحفظها والرجوع إليها في أي وقت.</p>\n<p><a href=\"http://www.foxitsoftware.com/Secure_PDF_Reader/\">Foxit Reader</a> خفيف لكنه لا يدعم التعليقات العربية على الملفات بشكل جيد. يبقى Sumatra PDF خياري حتى الآن.</p>\n<h3 id=\"-\">القاموس</h3>\n<p>عند وجود الإنترنت، فإن <a href=\"http://translate.google.com/\">Google Translate</a> يكفي لترجمة الكلمات والجمل القصيرة خصوصًا مع إمكانية قراءة الكلمة الإنكليزية بطريقة تبدو طبيعيّة تقريبًا ولا يبدو أنها مركّبة آليًّا. عند انقطاع الإنترنت أستخدم برنامج <a href=\"http://goldendict.org/download.php\">GoldenDict</a> المجاني والمفتوح المصدر بعد أن أضيف له قواميس منوّعة، المميز في هذا البرنامج أنه يستطيع التعامل مع قواميس Babylon ذاتها وقواميس عدة برامج أخرى، وكذلك يجلب لك نتائج Wikipedia، كل هذا في واجهة بسيطة ودون أن يؤثر على الأداء.</p>\n<h3 id=\"-\">محرر النصوص</h3>\n<p>محرر النصوص البسيط الّذي أستخدمه جنبًا إلى جنب مع مفكرة Windows (البسيطة أكثر من اللازم) هو <a href=\"http://notepad-plus-plus.org/download/v6.2.html\">Notepad++</a>. يفيد في تحرير النصوص البرمجية وكذلك النصوص العادية، وهو سريع للغاية ومريح وعند تثبيته يضيف إلى قائمة السياق للملفات خيارًا للتحرير بواسطته، دون الحاجة إلى تعيينه كبرنامج افتراضي أو النقر على &quot;فتح باستخدام...&quot; واختياره، وهذا يجعله مفيدًا عندما تريد تحرير ملف بشكل بسيط وبسرعة.</p>\n<p>أما لكتابة المقالات وغيرها، فإما أن أستخدم <a href=\"https://docs.google.com/\">محرر مستندات Google</a> أو Word عندما أحتاج لخيارات أوسع.  </p>\n<h3 id=\"ccleaner\">CCleaner</h3>\n<p>أداة خفيفة الحجم تقوم بحذف الملفات المؤقتة التي ينشئها النظام والبرامج في الأقراص وحذف تاريخ التصفح لعدد من متصفحات ويب الشهيرة و<a href=\"https://en.wikipedia.org/wiki/Data_remanence\">مسح المساحة الفارغة في الأقراص</a> والتحكم بالبرامج التي تبدأ مع Windows وإزالة البرامج. يمكنك السماح له بالعمل عند كل بدء تشغيل للنظام وسيقوم بمسح الملفات من المواقع التي حددتها له في المرة السابقة، لكن كن حذرًا وأزل خيارات مسح بيانات المتصفح إن لم تكن ترغب في ذلك.</p>\n<h3 id=\"-\">برامج أخرى</h3>\n<p>برامج لا أعتمد عليها في مهامي اليوميّة، لكنني أحتاجها بين فترة وأخرى: </p>\n<ul>\n<li><a href=\"http://mediago.sony.com/enu/download\">MediaGo</a>: برنامج من Sony لتحميل ومشاهدة الأغاني والفيديو والخلاصات الصوتية (Podcasts)، ومزامنة الصور والموسيقى من هواتف Sony. عمليًّا أحتاجه لتحميل الخلاصات الصوتية لبعض المواقع الّتي أهتم بمتابعتها (مثل <a href=\"http://www.eslpod.com/\">ESLPod</a>) ونقلها لهاتفي للاستماع إليها متى شئت. من عيوبه حجمه الكبير (بالطبع سيبدو حجمه كبيرًا بالنسبة للمهمة الوحيدة التي أحتاج فيها إليه) وكذلك عدم قدرته على الاتصال بالهاتف لاسلكيًّا، أتمنى أن أجد برنامج أفضل.</li>\n<li><a href=\"http://www.den4b.com/?x=products&amp;product=renamer\">ReNamer</a>: برنامج صغير وخفيف يقوم بإعادة تسمية مجموعة من الملفات دفعةً واحدة وفقًا لقواعد أو صفات تتصف بها، مثلاً يمكنك إعادة تسمية مجموعة من الأغاني وفقًا لأسمائها وأسماء مؤدّيها، أو مجموعة من الصور بحسب تاريخ التقاطها مع رقم مميز (1، 2، 3...) وهكذا...</li>\n<li><a href=\"http://www.formatoz.com/download.html\">FormatFactory</a>: للتحويل بين العديد من صيغ الملفات الصوتية والمرئية، أستخدمه أساسًا لأنه يدعم تقريبًا كل الأنواع، مرة احتجت إلى تحويل ملف صوتي مسجل بواسطة هاتف بلاحقة .amr ولم يستطع تحويله، فاستخدمت برنامجًا صغيرًا وجدته في نتائج بحث Google (فقط اكتب AMR to MP3 converter أو أي لاحقتين تريد).</li>\n<li><a href=\"http://www.softpedia.com/get/System/Launchers-Shutdown-Tools/Ali-Keshavarz-Auto-Shutdown.shtml\">Auto Shutdown</a>: برنامج صغير يبقى قرب الساعة وبإمكانك ضبطه ليقوم بإيقاف تشغيل الكمبيوتر أو إعادة تشغيله أو أدخاله في وضع السبات أو في وضع النوم متى أردت، أو بعد وقت محدد، أو في كل يوم عند ساعة محددة، أو في كل أسبوع وهكذا... أستخدمه لسببين: أن Windows 7 يستخدم وضع النوم الهجين (Hybrid Sleep) وهذا يعني أنه يحفظ نسخة من الذاكرة على القرص الصلب، ثم يدخل وضع النوم وليس الإسبات (يبقى الجهاز يعمل لكن باستهلاك ضعيف للطاقة)، وعندما يقلع فإنه يستخدم الذاكرة نفسها إن لم يحدث خلل أدى إلى انقطاع التغذية عن الجهاز، أما إذا حدث خلل فإنه يستخدم نسخة القرص الصلب، ولسبب ما فإن Windows على حاسوبي يستخدم نسخة القرص الصلب دومًا وهذا يجعل الإقلاع بطيئًا للغاية؛ في Auto Shutdown يوجد خيار لإجبار الكمبيوتر على الدخول في وضع الإسبات التقليدي، وخيار منفصل لإدخاله في وضع النوم العادي. السبب الآخر هو انقطاع الكهرباء، ولحسن الحظ فإن مواعيد انقطاع الكهرباء لدينا ثابتة تقريبًا وهذا يتيح لي ضبط البرنامج ليدخل الجهاز في وضع السبات قبل 5 دقائق من انقطاع الكهرباء دون الحاجة لتذكر هذا الأمر في كل مرة.</li>\n<li><a href=\"http://cdburnerxp.se/en/download\">CDBurnerXP</a>: لنسخ الأقراص أو كتابتها أو كتابة ملفات ISO على الأقراص.</li>\n</ul>\n","title":"ترتيب الكمبيوتر المفضل لي","filename":"my-pc-setup.json","id":"my-pc-setup","date":"2012-10-21T00:00:00.000Z","image":null,"description":"يبدو العنوان غير مناسب، لأنني لا أعرف كيف أترجم كلمة \"setup\" إلى العربية، هل هي \"إعداد\" أم \"تجهيز\"؟ المهم أنني سأحاكي تدوينة قرأتها مؤخرًا يتحدث فيها الكاتب عن البرامج التي يستعملها على حاسوبه ويشرح كلًّا منها باختصار.","images":0,"videos":0,"tracks":0,"links":39,"type":"text","page":3},{"html":"<h1 id=\"-1-\">ملخصات (1)</h1>\n<p>هذه مجموعة من المقالات التي قرأتها مؤخرًا وتتناول مواضيع متنوعة، وقمت بتلخيصها باستخدام <a href=\"http://www.diigo.com/\">Diigo</a> وأخذت منها ما يهمني وقررت أن أنشرها لكي أريحك من عناء قراءة المقالات كاملة، على أية حال، يمكنك قراءة المقالات كاملة بالضغط على الروابط في العناوين الفرعية. سأكتب هذه الملخصات في كل مرة أجمع فيها عددًا مناسبًا من المقالات المفيدة.  </p>\n<h3 id=\"-http-lifehacker-com-5853250-how-to-sound-like-you-know-what-youre-talking-about-even-when-you-dont-\"><a href=\"http://lifehacker.com/5853250/how-to-sound-like-you-know-what-youre-talking-about-even-when-you-dont\">كيف تبدو وكأنك تفهم ما تقوله؟ (وإن كنت لا تفهمه)</a></h3>\n<blockquote>\n<p>يعلم الخبراء أنهم يلفتون انتباه الناس، ولهذا أثران: الأول أنهم يعلمون أن سمعتهم على المحك كل مرة ينطقون فيها كلمة، بمعنى آخر: سيخضع كل ما يقولونه للتمحيص والتدقيق؛ وثانيًا أنهم يعلمون أيضًا أن الناس يأخذون ما يقولونه على محمل الجد وربمًا يتصرفون على أساسه، ولهذا يشعرون بمسؤولية كبيرة تجبرهم على تقديم معلومات جيدة. </p>\n</blockquote>\n<h3 id=\"-http-lifehacker-com-5951066-how-to-lie-without-actually-telling-a-lie-\"><a href=\"http://lifehacker.com/5951066/how-to-lie-without-actually-telling-a-lie\">كيف تكذب دون أن تنطق بالكذبة؟</a></h3>\n<ul>\n<li>يحتاج الكذب جهدًا، عندما تصدق فإنك ببساطة تتذكر شيئًا ما وتقوله. أما عندما تكذب فإنك تأخذ في الحسبان الحقيقة، وما إذا كنت تريد قولها أو لا، ثم تقرر أنك لا تريد ذلك، وبعدها تلفق كذبة ثم تحاول أن تقولها بطريقة توحي أنك صادق.</li>\n<li>يصبح الكذب صعبًا جدًّا في مواقف معينة لأنك تحتاج أولاً أن تتذكر الكذبة لتقولها لكل شخص يسألك وثانيًا عليك أن تذكر على من كذبت ومن قلت له الحقيقة.</li>\n<li>عليك أن تقول ما تريد قوله بطريقة طبيعية لا توحي بأنك متوتر أو مذنب.</li>\n</ul>\n<h3 id=\"-agps-http-en-wikipedia-org-wiki-assisted_gps-\"><a href=\"http://en.wikipedia.org/wiki/Assisted_GPS\">aGPS (ويكيبيديا)</a></h3>\n<ul>\n<li>aGPS تعني Assisted GPS أي نظام GPS مع مساعدة من أنظمة تحديد موقع أخرى مثل الأنظمة المعتمدة على Wi-Fi وBluetooth وغيرها.</li>\n<li>المساعدة تقع في فئتين: الأولى: تسريع طلب المعلومات من القمر الصناعي، والثانية: حساب الموقع الذي تلقاه الحساس من القمر الصناعي في مخدم (server) تُرسل إليه البيانات عن طريق الإنترنت مثلاً.</li>\n<li>GPS التقليدي (دون مساعدة)، يقدم الموقع أول مرة خلال 30-40 ثانية.</li>\n<li>سرعة نقل البيانات من القمر الصناعي المستخدم في نظام GPS هي 50 بت/ثانية فقط.</li>\n<li>إذا تعرضت إشارة القمر الصناعي للتشويش أو الضياع والانقطاع خلال تحديد الموقع، فإن المعلومات التي يتلقاها حساس GPS في الجهاز المستقبل تُتجاهل ويعاد طلب تحديد الموقع من البداية (وهذه نقطة ضعف في نظام GPS التقليدي)</li>\n</ul>\n<h3 id=\"-https-en-wikipedia-org-wiki-hybrid_positioning_system-\"><a href=\"https://en.wikipedia.org/wiki/Hybrid_positioning_system\">نظام تحديد الموقع الهجين (ويكيبيديا)</a></h3>\n<ul>\n<li>GPS دقيق جدًّا في تحديد الموقع في الأماكن المفتوحة، لكنه أدائه يضعف جدًّا في الأماكن المغلقة وبين الأبنية العالية.</li>\n<li>أنظمة تحديد الموقع بالاعتماد على Wi-Fi قد تعطي موقعًا دقيقًا للغاية، لكن فقط في المدن التي فيها كثافة عالية من شبكات Wi-Fi، كما أنّها تتطلب قاعدة بيانات واسعة تتضمن تفاصيل انتشار هذه الشبكات.</li>\n</ul>\n<h3 id=\"-http-lifehacker-com-5952115-simple-ways-to-eat-less-without-noticing-\"><a href=\"http://lifehacker.com/5952115/simple-ways-to-eat-less-without-noticing\">طرق بسيطة لتأكل أقل دون أن تلاحظ</a></h3>\n<ul>\n<li>استخدم أطباقًا أصغر</li>\n<li>أنقص 20% من الوجبة</li>\n<li>استخدم كؤوسًا أطول</li>\n<li>تناول البروتينات على الفطور: وحدها وجبات الفطور الحاوية على نسبة عالية من البروتين تقلل الشهية خلال اليوم</li>\n<li>تناول ثلاث وجبات في اليوم: لم يثبت أن لتناول أكثر من ثلاث وجبات في اليوم فائدة، وقد يكون أكثر سوءًا من حيث التحكم بالشهية</li>\n<li>أخفِ الوجبات السريعة عن نظرك: كثير من الدراسات أثبتت أن الناس يأكلون أكثر بكثير عندما يكون الطعام أمامهم منه عندما يكون بعيدًا عن نظرهم، حتى لو كانوا يعرفون مكانه.</li>\n<li>امضغ بتأنٍّ</li>\n<li>لا تأكل من العلبة: إن لم تكن تدرك الكمية التي تتناولها فإنك غالبًا تتناول أكثر من حاجتك (ضعفين وربما ثلاثة أضعاف الكمية التي ستتناولها لو أنك كلفت نفسك عناء أخذ حصة من العلبة وسكبها في الطبق)</li>\n<li>لا تأكل أمام التلفزيون</li>\n<li>لا تهتم بالوجبات التي تدعي الشركات المنتجة لها أنّها &quot;صحية&quot;، فهي في معظم الأحيان تكون وجبات سريعة عُبئت بشكل أجمل من الوجبات البديلة. وأيضًا، يبدو أن الناس يأكلون من الوجبات &quot;الصحية&quot; أكثر مما يجب، ولا يعيرون اهتمامهم للسعرات الحرارية فيها طالما أنها &quot;صحية&quot;؛ لكي تكون في صحة حقيقية، تناول طعامًا بسيطًا ودون ادعاءات كاذبة.</li>\n</ul>\n<h3 id=\"-facebook-http-gizmodo-com-5530178-top-ten-reasons-you-should-quit-facebook-\"><a href=\"http://gizmodo.com/5530178/top-ten-reasons-you-should-quit-facebook\">عشرة أسباب تدفعك لترك Facebook</a></h3>\n<ul>\n<li>تنص شروط خدمة Facebook على أنهم لا يمتلكون بياناتك فحسب، بل إنك إن لم تقم بتحديثها ولم تحرص على إبقائها دقيقة فإنهم قد يغلقون حسابك.</li>\n<li>ببساطة، هم يعتبرون أن المستخدمين موظفون غير مأجورين لديهم لتجميع المعلومات واستخدامها في الإعلانات.</li>\n<li>لمؤسس Facebook تاريخ موثق يوحي بتصرفات غير أخلاقية (بحسب ما فهمت: محاولة الدخول إلى عناوين البريد الإلكتروني لبعض منافسيه بتوقع كلمات مرور الحسابات بالاعتماد على بياناتهم على Facebook)</li>\n<li>عرض Paul Warden (مبرمج) كيف يمكنه الحصول على بيانات من Facebook قيل إنها عُممت بالخطأ، فقاضته الشركة، فلماذا يقاضى مطور تطبيقات لأنه جعل بيانات يريد Facebook في الأصل جعلها عامة كما تنص شروط خدمته بعد تحديثها الأخير؟</li>\n<li>عندما تستخدم Facebook فإنك لا تثق فيه فحسب، بل تثق في كل مطوري التطبيقات عليه والذين يكون كثيرٌ منهم صغيرًا جدًا ليهتم بالحفاظ على بياناتك سرية ومؤمنة.</li>\n<li>إما أنهم لا يهتمون كثيرًا بخصوصيّتك، أو أنهم ليس لديهم مهندسون جيّدون، أو كلا الأمرين.</li>\n<li>يجعل Facebook حذف حسابك صعبًا ومعقّدًا، فهو يوحي للمستخدم بأن تعطيل الحساب (deactivation) هو إزالته وهكذا يعتقد المستخدم أنه تخلص منه ولكن بياناته محفوظة لدى الموقع، أما إذا أردت حذفه حقيقة، فعليك العثور على رابط مخفيّ ضمن مركز المساعدة.</li>\n<li>تعطيل الحساب لا يختلف كثيرًا عن الامتناع عن تسجيل الدخول لفترة معينة.</li>\n<li>Facebook حاليًا لا يعطيني أي فائدة على الإطلاق. وهو مزعج أكثر من أي شيء آخر.</li>\n<li>يُصرّ Facebook بوضوح على إضافة كل ميزة من الشبكات الاجتماعية المنافسة في محاولة للسيطرة على الويب.</li>\n<li>يمكنهم أن يفعلوا ما يشاؤون، ضمن إطار القانون (خصوصًا أن القوانين المتعلقة بالإنترنت والشبكات الاجتماعية غامضة وغير محددة تمامًا)</li>\n</ul>\n<h3 id=\"-\">روابط أخرى</h3>\n<p><a href=\"http://lifehacker.com/5940565/why-you-should-start-using-a-vpn-and-how-to-choose-the-best-one-for-your-needs\">لماذا يجب أن تبدأ باستخدام VPN؟ وكيف تختار الخدمة المناسبة لحاجتك؟</a> (بالإنكليزية)</p>\n<p><a href=\"http://lifehacker.com/5911639/the-stupid-things-you-do-on-facebook-and-how-to-fix-them\">الحماقات التي ترتكبها على Facebook وكيف تصلحها</a> (بالإنكليزية)</p>\n<p><a href=\"http://rawkes.com/articles/there-is-something-magical-about-firefox-os\">موظف في Mozilla يتحدث عن نظام Firefox OS للهواتف المحمولة القادم في مطلع العام 2013</a> (بالإنكليزية)</p>\n","title":"ملخصات (1)","filename":"digest-1.json","id":"digest-1","date":"2012-10-17T00:00:00.000Z","image":null,"description":"هذه مجموعة من المقالات التي قرأتها مؤخرًا وتتناول مواضيع متنوعة، وقمت بتلخيصها باستخدام Diigo وأخذت منها ما يهمني وقررت أن أنشرها لكي أريحك من عناء قراءة المقالات كاملة، على أية حال، يمكنك قراءة المقالات كاملة بالضغط على الروابط في العناوين الفرعية. سأكتب هذه الملخصات في كل مرة أجمع فيها عددًا مناسبًا من المقالات المفيدة.","images":0,"videos":0,"tracks":0,"links":10,"type":"text","page":3},{"html":"<h1 id=\"-ifttt-com\">شرح IFTTT.com</h1>\n<p>IFTTT.com هو موقع ويب حديث نسبيًّا، يتيح لمستخدمه أتمتة نشاطاته باستخدام جملة شرطية بسيطة: if this then that، ومعناها &quot;إذا كان هذا، فافعل هذا&quot;. ما معنى هذا الكلام الغامض؟<br>أحب دومًا أن أبدأ بالأمثلة، فهي تغني عن الشرح...<br>مثلاً: عندما تكتب تدوينة جديدة، وتريد نشرها على Facebook وTwitter؛ ماذا تفعل عادة؟  </p>\n<blockquote>\n<p>تذهب إلى رابط التدوينة الجديدة بعد نشرها، وتنسخ رابط الصفحة وتلصقه في Facebook ثم تضغط على زر المشاركة! ثم تذهب إلى Twitter وتلصق الرابط نفسه وتكتب عنوان التدوينة وتنشرها</p>\n<p>أو إذا اخترت إضافة أزرار المشاركة على مدونتك، ستضغط على زر Facebook وتتابع عملية النشر في نافذة أخرى، وكذلك الأمر مع Twitter</p>\n</blockquote>\n<p>لكن ماذا إذا كنت تكتب كثيرًا؟ وتجد صعوبة في تكرار هذه الخطوات في كلّ مرّة؟ الحلّ بأتمتة النشر: أي ستنشر كل تدوينة تكتبها تلقائيًّا إلى حساباتك الاجتماعية، دون أي تدخل لاحق منك... فقط أتمم إعداد IFTTT ليقوم بهذا.<br>ربّما لا تهتم بالتدوين، ولكي لا تظن أن هذا المثال هو كل ما يستطيع IFTTT فعله، فسأضرب أمثلة أخرى...  </p>\n<blockquote>\n<p>ما رأيك في أن تصلك رسالة على عنوان بريدك الإلكتروني كل صباح فيها أحوال الطقس المتوقعة لليوم؟</p>\n<p>هل تريد أن تحتفظ بنسخة من صورك على Facebook في مجلد خاص بك على Dropbox؟</p>\n<p>أو ربما ترغب في حفظ كل ما تكتبه على Twitter في ملف نصي على Dropbox!</p>\n<p>هل تريد أن تقول لمتابعيك الجدد على Twitter... شكرًا لك على المتابعة؟</p>\n</blockquote>\n<p>&gt;</p>\n","title":"شرح IFTTT.com","filename":"iftttcom.json","id":"iftttcom","date":"2012-08-10T00:00:00.000Z","image":null,"description":"IFTTT.com هو موقع ويب حديث نسبيًّا، يتيح لمستخدمه أتمتة نشاطاته باستخدام جملة شرطية بسيطة: if this then that، ومعناها \"إذا كان هذا، فافعل هذا\". ما معنى هذا الكلام الغامض؟أحب دومًا أن أبدأ بالأمثلة، فهي تغني عن الشرح...مثلاً: عندما تكتب تدوينة جديدة، وتريد نشرها على Facebook وTwitter؛ ماذا تفعل عادة؟","images":0,"videos":0,"tracks":0,"links":0,"type":"text","page":3},{"html":"<h1 id=\"-facebook-\">كيف تتحكّم بحياتك الاجتماعيّة على Facebook؟</h1>\n<p>في البداية كان البريد الإلكترونيّ وسيلة أساسيّة للتّواصل، ولأنّ المستخدم هو من يختار، فإنّ بإمكانه استخدامه لأشياء مختلفة: للعمل أو للتّرفيه أو لنشر الأخبار (أو الأكاذيب) أو للتّواصل مع من يعرفهم ولكنّهم بعيدون عنه.<br>لم يترافق انتشار البريد الإلكتروني على حدّ علمي بوصف Social (اجتماعيّ) الّذي يتردّد اليوم بكثرة، بدايات ما يسمّى &quot;الحياة الاجتماعيّة على ويب&quot; كانت مع برامج الدردشة، أصبحت حدود الأشياء الّتي بإمكانك فعلها بالدّردشة أوسع: التّواصل لحظيّ؛ وستحتاج دومًا أن تبقى أمام شاشة جهازك لتردّ على كلّ رسالة في وقتها، وسيفعل الطّرف الثّاني الشّيء نفسه، ثمّ تكتشفان أنّه ما من داعٍ لإهدار الوقت هكذا، إذ لا فائدة فعليّة تحقّقها الدّردشة عادةً؛ فكلّ برامج الدّردشة يروّج لها بكلمات مثل connect وmeet وfun... وهي لا توحي بفائدة على الاطلاق.<br>في 2004 ظهرت &quot;الشّبكات الاجتماعيّة&quot; كمفهوم وكنماذج هي Facebook وTwitter، ربّما كانت MSN شبكة اجتماعيّة بدائيّة لكنّها لم تضع مفهوم الحياة الاجتماعيّة كما هو اليوم.<br>Facebook بحدّ ذاته أصبح مفهومًا وتجاوز حدود النّموذج، على العكس من ذلك أرى أنّ الشّبكات الاجتماعيّة الجديدة تحاول نسخ Facebook: على سبيل المثال: Google+.<br>Twitter لا يتمتّع بشهرة كبيرة في المجتمع السّوريّ، إلّا مؤخّرًا بدأت تظهر مئات الحسابات بأسماء زائفة وغالبًا يبدأ مستخدم Twitter بعمل retweet لتغريدات المشاهير، ثمّ ينطلق فيه ويدخل مرحلة التّعلّق وربّما الإدمان.<br>لكنّني أريد في هذه التّدوينة الحديث عن Facebook بالذّات لأنّه أصبح يمثّل الوجهة الأولى (وربّما الوحيدة) لكثير من النّاس.  </p>\n<h3 id=\"-facebook-\">لماذا ينشِئ المرء حسابًا على Facebook؟</h3>\n<p>لأمور كثيرة، قد يكتشف لاحقًا أنّه كان بالإمكان إنجازها بطرق أكثر كفاءة وسرعة، منها:</p>\n<h4 id=\"-facebook-facebook-\"><strong>التّواصل مع الأصدقاء والعائلة وزملاء العمل</strong>هذا بالأساس ما أُنشئ Facebook من أجله، تعلّمتُ أن أعود للغايات في كلّ مرّة أضلّ فيها الطّريق؛ فإذا كان Facebook وضع أساسًا لهذا، فلماذا أستخدمه لأغراض أخرى؟ لماذا نكتب بأسماء وهميّة ونصادث أشخاصًا لا نعرفهم؟ ما القيمة الّتي تضيفها لحياتي معرفة أنّ (شخصًا ما) لم ألتقِ به قطّ قد أنهى امتحاناته؟ أو أنّه قد تناول الغداء مع شخص آخر لا أعرفه كذلك؟ هنا أريد أن أقف وأصرخ بغضب: توقفوا عن هذه السّخافات، أنهوا هذه المهزلة!</h4>\n<h4 id=\"-\"><strong>الاطّلاع على الأخبار</strong></h4>\n<p>الشّبكات الاجتماعيّة هي أيضًا وسائل إعلامٍ قويّة، قد يُختَلف حول ما إذا كانت أقوى من الإعلام التّقليديّ أو أنّها ليست كذلك. لا يهمّ، ما يهمّني هو أن المستخدمين سيقرؤون شيئًا يُدعى News feed (نشرة الأخبار) وللحظة سيبدو لهم أنّهم يمتلكون زمام أمورهم وأنّهم اختاروا بالفعل ما يقرؤونه، لكنّ الأمر أعقد من هذا بكثير. الحقيقة أنّ الموضوع يحتاج منّي الكثير من الشّرح لكنّ الفكرة راسخة لديّ: مع الوقت ستصبح أسيرًا لدى Facebook، سيُطلَق سراحك فقط بعدما تكتشف أنّك أسير، وستحتاج الكثير من الجهد لفكّ الوثاق.</p>\n<p>باستطاعتي ضرب عدّة أمثلة: هل فعلاً نستغلّ فضاء الإنترنت الحرّ للحصول على ما يفيدنا أمّ أنّ أوّل ما نفعله عند فتح المتصفّح هو كتابة حرف f عند البدء وسيكمل المتصفّح الكلمة لأنّنا أدمنّا Facebook؟</p>\n<p>في نفس الوقت لا يبدو لي أنّ Facebook كموقع ويب وبأفكاره وأسسه موقع غير مفيد، لكنّ الطّبيعة البشريّة وعامل &quot;الحياة الاجتماعيّة&quot; والتّركيز على عالمك كفرد، كلّ هذا وأكثر، يجعلك تصاب بمرض Facebook.</p>\n<p>لا أعرف إن كان أحد قد سبقني بتشخيص هذا المرض، لكنّني أصبحت متأكّدًا من كونه مرضًا حقيقيًّا نفسيًّا وله أعراض؛ من هذه الأعراض: حبّ النّفس والأنانيّة والنفاق والتّعصّب. لأنّك تحبّ نفسك، ستحرص على أن تُظهِر منها فقط ما يجعلها راضية، وستخفي عيوبك قدر المستطاع، لن تنشر تفاصيل حياتك الكئيبة والمظلمة، تصفّح الملفّات الشّخصيّة لأصدقائك وستعتقد لوهلة أنّهم لم يعانوا مرّة في حياتهم بل هم أشخاص سعيدون وناجحون. هذا هو النّفاف الّذي ذكرتُه. نحن ملايين من المنافقين في حياتنا الاجتماعيّة وبينما نعيش حياتنا الحقيقيّة بحلوها ومرّها، نعيش حياتنا على Facebook بحلوها فقط، وربّما بسكّر زيادة! وهذا يبدو لي سبب الإدمان الأصليّ وليس كما يظنّ كثيرون &quot;إضاعة الوقت&quot;.</p>\n<p>لديّ الكثير لأقوله لكنّني عاجز عن جمعه كلّه، لكن بعد أن عرفتُ كلّ هذا بدأت تتكوّن لديّ الإرادة لفكّ الوثاق، إن عرفتَ كلّ هذا وصدّقته ثمّ لم تقعل شيئًا فأنت عبدٌ يحبُّ أن يبقى أسيرًا. على كلّ حال، لا أنتظر من أحد، ولا أتوقّع إطلاقًا أن تُحدِث هذه المقالة لدى أحد ممّن قرأها رغبة فوريّة في التّغيير، لكنّها بداية الطّريق، وطرقة على باب الفكر المقفل، سيتبعها طرقات أخرى.</p>\n<h3 id=\"-\">ماذا أفعل الآن؟</h3>\n<p>أقول إنّني اكتشفت العلاج الشّافي لمرض Facebook، لكن يجب قبل تعاطيه البدء أخذ بعض المقويّات إلى أن يحين وقت العلاج.</p>\n<p>المقويّات هي:</p>\n<ol>\n<li>استخدم قوائم الأصدقاء وقوائم الاهتمامات: نعم، Facebook فعل شيئًا جيّدًا جدًّا مؤخّرًا، ويبدو لي هذا من آثار التّنافس المحمود مع Google+. قوائم الأصدقاء تسمح لك بتصنيف من أضفتهم على Facebook إلى مجموعات: الأصدقاء المقرّبون، العائلة، زملاء الدّراسة، زملاء العمل؛ هذه هي القواءم الأساسيّة وبإمكانك (ويجب أن تفعل هذا إذا أردت الشفاء) صنع قوائم جديدة. من القوائم الّتي أنشأتها أنا: المهتمّون بالتّقنيّة، من لا أعرفهم شخصيًّا، أصدقاء عرفتهم عبر Twitter. القائمة الثّانية (من لا أعرفهم شخصيًّا) مهمّة جدًّا للمرضى: ابحث عن هؤلاء وأضفهم إلى القائمة ولا تستثنِ منهم أحدًا. فيما بعد سيكون بإمكانك إخفاء معلومات ومنشورات محدّدة عن قوائم تختارها أو إظهارها لها دون غيرها أو الاطّلاع على منشورات أفرادها على حدة.</li>\n<li>هذا هو محور العلاج: أن تطلع على أخبار من يهمّك وتتجاهل أخبار هؤلاء الّذين ينشرون صور اختباراتهم وأصدقائهم الّذين لم تقابلهم مرّة وقصص حيواناتهم الأليفة وهراءً مشابهًا (حسنًا أعتقد أنّني بالغت قليلاً!)</li>\n<li>شخصيًّا من يهمّنى الاطّلاع على نشاطهم وأخبارهم هم أصدقائي المقرّبون وعائلتي وزملاء الدّراسة، وأمّا من تبقّى فلا تعنيني حياتهم الشّخصيّة في شيء ولا أعتقد أنّ باستطاعتهم إثراء حياتي.</li>\n<li>لاحظ أنّك أنت نفسك ستكون من هؤلاء بالنّسبة للآخرين فلا تهتمّ، فقد اكتشفت أنّ العدوى تنتشر ببطء لكنّها تنتشر واسعًا، واللّقاح الوحيد هو أن تملأ وقت فراغك بشيء أكثر إفادة قبل أن تنضمّ لـFacebook، لا لقاح آخر حاليًّا!و</li>\n<li>الآن وقد بدأت بتناول المقويّات، ستبدأ بالصّراع مع نفسك فالمرض يقاوم إرادتك وعليك أن تبدأ بالعلاج! ستشعر بالحنين لأيّاك القديمة بعد هذا التّغيير، ربّما يفيدك عندئذٍ أن تطّلع على خطّك الزّمنيّ (Timeline، وهو أيضًا شيء مفيد أضافه Facebook) لتكتشف كم كنت مريضًا وكم تحسّنت. عندها ستضعف رغبتك بالعودة.</li>\n<li>أمّا العلاج الشّافي، فهو الهدف النّهائيّ الأكثر صعوبة، لكنّني لم أجد غير التّخلّص من الحساب نهائيًّا علاجًا شافيًا لمرض Facebook، لا شيء غير ذلك مع الأسف. لكنّ عليك الانتباه أنّك لا تستطيع فعل هذا بين ليلة وضحاها، لأنّ القفز من علٍ إلى الدّرك (وهنا يجب أن أقول العكس) مؤلمٌ للغاية، عليك استخدام الدّرج!</li>\n<li>تذكّر: عليك أيضًا أن تجد بديلاً لكلّ غاية سليمةٍ استخدمت Facebook من أجلها، ويشترط فيها أن تخلوَ من جراثيم المرض!</li>\n</ol>\n","title":"كيف تتحكّم بحياتك الاجتماعيّة على Facebook؟","filename":"facebook.json","id":"facebook","date":"2012-06-08T00:00:00.000Z","image":null,"description":"في البداية كان البريد الإلكترونيّ وسيلة أساسيّة للتّواصل، ولأنّ المستخدم هو من يختار، فإنّ بإمكانه استخدامه لأشياء مختلفة: للعمل أو للتّرفيه أو لنشر الأخبار (أو الأكاذيب) أو للتّواصل مع من يعرفهم ولكنّهم بعيدون عنه.لم يترافق انتشار البريد الإلكتروني على حدّ علمي بوصف Social (اجتماعيّ) الّذي يتردّد اليوم بكثرة، بدايات ما يسمّى \"الحياة الاجتماعيّة على ويب\" كانت مع برامج الدردشة، أصبحت حدود الأشياء الّتي بإمكانك فعلها بالدّردشة أوسع: التّواصل لحظيّ؛ وستحتاج دومًا أن تبقى أمام شاشة جهازك لتردّ على كلّ رسالة في وقتها، وسيفعل الطّرف الثّاني الشّيء نفسه، ثمّ تكتشفان أنّه ما من داعٍ لإهدار الوقت هكذا، إذ لا فائدة فعليّة تحقّقها الدّردشة عادةً؛ فكلّ برامج الدّردشة يروّج لها بكلمات مثل connect وmeet وfun... وهي لا توحي بفائدة على الاطلاق.في 2004 ظهرت \"الشّبكات الاجتماعيّة\" كمفهوم وكنماذج هي Facebook وTwitter، ربّما كانت MSN شبكة اجتماعيّة بدائيّة لكنّها لم تضع مفهوم الحياة الاجتماعيّة كما هو اليوم.Facebook بحدّ ذاته أصبح مفهومًا وتجاوز حدود النّموذج، على العكس من ذلك أرى أنّ الشّبكات الاجتماعيّة الجديدة تحاول نسخ Facebook: على سبيل المثال: Google+.Twitter لا يتمتّع بشهرة كبيرة في المجتمع السّوريّ، إلّا مؤخّرًا بدأت تظهر مئات الحسابات بأسماء زائفة وغالبًا يبدأ مستخدم Twitter بعمل retweet لتغريدات المشاهير، ثمّ ينطلق فيه ويدخل مرحلة التّعلّق وربّما الإدمان.لكنّني أريد في هذه التّدوينة الحديث عن Facebook بالذّات لأنّه أصبح يمثّل الوجهة الأولى (وربّما الوحيدة) لكثير من النّاس.","images":0,"videos":0,"tracks":0,"links":0,"type":"text","page":3}]