[{"html":"<h1 id=\"-\">تجربتي لأشهر خدمات التّخزين السّحابيّ</h1>\n<p>عالم الحوسبة السّحابيّة بدأ بالنّضوج والتّوجّهُ نحو الاعتماد الكلّيّ على تطبيقات ويب آخذ بالانتشار منذ عرفنا Chrome، بالطّبع ليس Chrome وحده هو من يدفعنا إلى السّحابة، لكنّه هو بالذّات من بدأ التّنافس المحموم بين المتصفّحات لتتسابق على دعم فكرة تطبيقات الويب. لا شكّ أنّ الاعتماد على تطبيقات الويب (وهي بديل التّطبيقات الّتي تستخدمها بعد تثبيتها على نظام التّشغيل غير السّحابيّ) سيحتاج بالمقابل لوسيط تخزين سحابيّ، يقابل القرص الصّلب الّذي تثبّت عليه برامجك... لن تثبّت عليه تطبيقات الويب طبعًا، لكنّك ستحتفظ فيه بملفّاتك الّتي ستتكامل تطبيقات الويب شيئًا فشيئًا لتدعم قراءتها وتحريرها.<br>طرحت Google الأمس بديلها عن القرص الصّلب في جهازك لتدخل عالم التّخزين السّحابيّ بمفهومه الشّخصيّ، Google Drive ستتيح لك رفع ملفّاتك وقراءة بعضها وتحرير بعضها مباشرة عبر تطبيق الويب الموافق (وهو Docs سابقًا).<br>لم تكن Google أوّل من طرح متصفّح ويب، لكنّ Chrome يقاتل بشراسة ليضمن حصّته، فهل ستحذو Drive حذوه؟ الأمر ليس بهذه البساطة والاختلافات هنا أوسع. لا أخفي أنّني أعتمد على منتجات Google بشكل كبير وبالذّات على تكامل خدماتها سويّة... Google تقدّم حياة على الويب كاملة تغنيك عن التّشتّت بين عدّة شركات (ليس هذا إيجابيًّا بالضّرورة، لكنّه يناسبني تمامًا)؛ لكن عندما يتعلّق الأمر بالتّخزين السّحابيّ والمزامنة بين هاتفي الجوّال وحاسبيّ فإنّ ليّ متطلّبات خاصّة، وهي ما دفعني لتجربة أربعٍ من خدمات المزامنة والتّخزين السّحابيّ الشّهيرة:<br><img src='content/images/screenshot.57.jpg' title='null' text=''/></p>\n<p>من اليمين: Dropbox ثمّ SkyDrive ثمّ Google Drive ثمّ SugarSync</p>\n<h4 id=\"dropbox\">Dropbox</h4>\n<p>أشهر من نار على علم، Dropbox هو الخدمة الّتي أعتمد عليها حاليًّا لأنّها أوّلى الخدمات الّتي استعملتها.</p>\n<p>يقدّم 2 GB مجّانًا في البداية، و500 MB عندما تبدأ باستخدام ميزة Camera Upload في تطبيق الهاتف المحمول الخاصّ. هذه الميزة مفيدة جدًّا لي إذ تقوم برفع الصّور الّتي ألتقطها بكاميرا الهاتف المحمول إلى مجلّد في Dropbox لتزامن تلقائيًّا مع الأجهزة المرتبطة، يعني أن الصّور ستوجد على هاتفي وعلى جهاز الكمبيوتر أيضًا.</p>\n<p>ميزة أخرى ينفرد بها Dropbox: الحدّ من سرعة الرّفع والتّحميل الّتي يستخدمها تطبيق الكمبيوتر، التّطبيقات الأخرى قد تستهلك سرعة الإنترنت لديك أثناء المزامنة دون أن تشعر.</p>\n<p>أمّا الميزة الّتي أستفيد منها بشكل كبير فهي المزامنة عبر الشّبكة المحلّيّة: قمت بتثبيت تطبيق Dropbox على حاسبي المكتبيّ وعلى Laptop وقام التّطبيق بمزامنة الملفّات بينهما دون استخدام الإنترنت لأنّهما مرتبطان بنفس الشّبكة. هذا يوفّر الكثير من الوقت وربّما المال إذا لم تكن تستخدم اتّصالاً غير محدود إلى الإنترنت.</p>\n<p>تطبيق Dropbox لنظام Android سهل الاستخدام ومستقرّ إلى درجة كبيرة كما أنّه ذكيّ، يعيبه شيء وحيد: أنّه يرفع الصّور ومقاطع الفيديو من الكاميرا ولا يمكن استثناء مقاطع الفيديو من الرّفع، وهذا سيستهلك بطّاريّة الهاتف وسرعة الإنترنت، ولا أحتاج إلى رفع مقاطع الفيديو بطبيعة الحال.</p>\n<h4 id=\"skydrive\">SkyDrive</h4>\n<p>تطبيق SkyDrive لنظام Windows صدر قبل عدّة أيّام من صدور Google Drive، معنى هذا أنّ SkyDrive لم تكن خدمة مزامنة بالمعنى الفعليّ، كانت مع Office Live شيئًا أشبه بـGoogle Docs.</p>\n<p>الشّيء الّذي تنفرد به هذه الخدمة هو السّعة الكبيرة (25 GB مجّانًا، وقيل إنّها ستخفّض إلى 7 GB، تبقى أكبر من الجميع في الحالتين)، من مميّزاتها أيضًا أنّها من إنتاج Microsoft لأنظمة Windows وهذا يعني توافقًا واستقرارًا أكبر (على الأقلّ بالنّسبة لي).</p>\n<p>تطبيق Windows مستقرّ وشبيه إلى درجة كبيرة بتطبيق Dropbox من حيث الفكرة والمهمّة. من عيوب الخدمة غياب تطبيق Android وLinux، لذا قرّرت الاستغناء عنها.</p>\n<h4 id=\"google-drive\">Google Drive</h4>\n<p>خدمة من Google، واعتمادي على Google شجّعني على تجربتها، قمت بتثبيت التّطبيق ورفعت وزامنت مجموعة من ملفّاتي، لم أواجه مشاكل تذكر، لكن لا تتوفّر في تطبيق Android ميزة شبيهة بـCamera Upload في Dropbox وهو ما يضطرني للاعتماد على Dropbox حتّى الآن، على أيّة حال في تطبيق Google+ لنظام Android ميزة اسمها Instant Upload وهي مشابهة لتلك في Dropbox، لكنّني لم أجد استخدامها مريحًا لأنّه لا يمكن مزامنتها إلى جهاز الكمبيوتر عبر تطبيق Drive.</p>\n<p>Drive تقدّم 5 GB مجّانًا.</p>\n<h4 id=\"sugarsync\">SugarSync</h4>\n<p>يبدو أنّ الشّركة كريمة جدًّا بخصوص المساحات، 5 GB مجّانًا و250 MB عند تثبيت تطبيق الهاتف المحمول والكثير من الهدايا، من مميّزات تطبيق Windows أنّه لا يزامن مجلّدًا خاصًّا، بل بإمكانك مزامنة أكثر من مجلّد من المجلّدات موجودة لديك مسبقًا مثل مجلّدي الموسيقى والصّور ومجلّدات أخرى تحدّدها، بإمكانك بالطّبع إنشاء مجلّد جديد فارغ للمزامنة.</p>\n<p>تطبيق Android غير مستقرّ بشكل كافٍ وواجهته لا تبدو طبيعيّة ومناسبة لتصميم Android، لكنّه جيّد جدًّا.</p>\n<p>يبدو أنّ Dropbox خياري المثاليّ والّذي سأعتمد عليه حتّى إشعار آخر!</p>\n","title":"تجربتي لأشهر خدمات التّخزين السّحابيّ","filename":"blog-post.json","id":"blog-post","date":"2012-04-25T00:00:00.000Z","image":"content/images/screenshot.57.jpg","description":"عالم الحوسبة السّحابيّة بدأ بالنّضوج والتّوجّهُ نحو الاعتماد الكلّيّ على تطبيقات ويب آخذ بالانتشار منذ عرفنا Chrome، بالطّبع ليس Chrome وحده هو من يدفعنا إلى السّحابة، لكنّه هو بالذّات من بدأ التّنافس المحموم بين المتصفّحات لتتسابق على دعم فكرة تطبيقات الويب. لا شكّ أنّ الاعتماد على تطبيقات الويب (وهي بديل التّطبيقات الّتي تستخدمها بعد تثبيتها على نظام التّشغيل غير السّحابيّ) سيحتاج بالمقابل لوسيط تخزين سحابيّ، يقابل القرص الصّلب الّذي تثبّت عليه برامجك... لن تثبّت عليه تطبيقات الويب طبعًا، لكنّك ستحتفظ فيه بملفّاتك الّتي ستتكامل تطبيقات الويب شيئًا فشيئًا لتدعم قراءتها وتحريرها.طرحت Google الأمس بديلها عن القرص الصّلب في جهازك لتدخل عالم التّخزين السّحابيّ بمفهومه الشّخصيّ، Google Drive ستتيح لك رفع ملفّاتك وقراءة بعضها وتحرير بعضها مباشرة عبر تطبيق الويب الموافق (وهو Docs سابقًا).لم تكن Google أوّل من طرح متصفّح ويب، لكنّ Chrome يقاتل بشراسة ليضمن حصّته، فهل ستحذو Drive حذوه؟ الأمر ليس بهذه البساطة والاختلافات هنا أوسع. لا أخفي أنّني أعتمد على منتجات Google بشكل كبير وبالذّات على تكامل خدماتها سويّة... Google تقدّم حياة على الويب كاملة تغنيك عن التّشتّت بين عدّة شركات (ليس هذا إيجابيًّا بالضّرورة، لكنّه يناسبني تمامًا)؛ لكن عندما يتعلّق الأمر بالتّخزين السّحابيّ والمزامنة بين هاتفي الجوّال وحاسبيّ فإنّ ليّ متطلّبات خاصّة، وهي ما دفعني لتجربة أربعٍ من خدمات المزامنة والتّخزين السّحابيّ الشّهيرة:","images":1,"videos":0,"tracks":0,"links":0,"type":"text","page":2},{"html":"<h1 id=\"-facebook-\">لا أعبدُ Facebook!</h1>\n","title":"لا أعبدُ Facebook!","filename":"facebook.json","id":"facebook","date":"2012-02-03T00:00:00.000Z","image":null,"images":0,"videos":0,"tracks":0,"links":0,"type":"text","page":2},{"html":"<h1 id=\"-\">الحوسبة السّحابيّة</h1>\n<p>حياتنا الرّقميّة تتطوّر بسرعة، في البدء كان استخدام الحاسوب محدودًا في المجالات العلميّة واليوم بإمكان هاتف صغير يحمله شابّ أن ينفّذ في ثوانٍ ما كانت حواسيب الأمس تعجز عن تنفيذه في أيّام، في البدء اخترِع الويب وشاع استخدام الإنترنت -بسرعات لا تتعدّى 56 كيلوبت في الثّانية- للحصول على المعلومات في صفحات خالية تقريبًا من الألوان والصّور (أما مقاطع الفيديو على الويب فكانت يومها شيئًا مستحيل الوجود) ثمّ بدأت سرعات الإنترنت بالنّمو وأسعارها بالانخفاض وكان من الطّبيعيّ أن يترافق هذا بظهور صفحات ذات محتوى أغنى (صور أكثر، مقاطع صوت، وحتّى مقاطع فيديو)، وهذا التّطوّر لا بدّ من أن يرافقه لغات برمجة أحدث وقدرات أوسع لمتصفّحات الويب لتستطيع رسم المحتويات بسرعة مناسبة وتلبّي احتياجات الاستخدام. الخلاصة أنّه لا يمكن فصل العمليّتين عن بعضهما: فتطوّر محتوى الصّفحات وتطوّر متصفّحات الويب متزامنان وكلاهما يؤثّر بالآخر.<br>في السّنوات القليلة الماضية بدأ كلّ شيء بالتّغيّر: لم نعد نزور &quot;صفحات&quot; ويب تقليديّة، بل أصبحنا نستعمل &quot;تطبيقات&quot; ويب. التّطبيق ليس مجرّد صفحة كتب فيها بعض النّصوص وأُضيفَ إليها بعض الصّور، بل هو تطبيق كأيّ تطبيق تثبّته على جهازك وفيه القدرة على <strong>تنفيذ المهام</strong> وليس فقط عرض المعلومات، ولعلّ الميزة الثّانية المهمّة في التّطبيقات هي القدرة على التّخصيص بما يناسب احتياجات المستخدم.<br>ماذا يعني هذا؟ الأمثلة ستوضّح أكثر: ما البرنامج الّذي تستعمله لكتابة المستندات وطباعته؟ لنقل إنّه Microsoft Word. شخصيًّا أستعمل Google Docs وهو تطبيق ويب يؤدّي نفس المهمّة بالضّبط (وإن تفاوتت القدرات). كلّ ما عليك أن تزور <a href=\"http://docs.google.com/\">http://docs.google.com</a> وتسجّل دخولك ثمّ تنشئ مستندًا جديدًا وتبدأ بالكتابة والتّنسيق وترقيم الصّفحات وإضافة الألوان والصّور والرّوابط، ثمّ إذا انتهيت يمكنك طباعته؛ ويُحفظ الملفّ على أجهزة Google بحسابك الّذي تستخدمه في Gmail ويمكنك الرّجوع إليه وتعديله طالما توفّر لديك الاتّصال بالإنترنت. بالطّبع Google Docs هو واحد من هذه التّطبيقات ويمكنك استعمال تطبيقات أخرى مثل Office Live من Microsoft أو غيره. ويمكن القول إنّ في تطبيقات الويب هذه ما يميّزها عن التّطبيقات التّقليديّة كخواصّ المشاركة مع الأصدقاء وسعات التّخزين.<br>هذا كان مثالاً واحدًا، لكنْ لا تقتصر تطبيقات الويب على تحرير المستندات بالطّبع، فهناك تطبيقات ويب لترتيب المهام وتطبيقات التقويم وألعاب وتطبيقات تعليم اللّغات والكثير غيرها. ما يثير حماسي أنّ كلّ هذا حدث في فترة قصيرة وهذا يعطي فكرة عن التّطوّر الّذي سنشهده في السّنوات العشر القادمة.<br>مفهوم الحوسبة السّحابيّة<br>عادة يُشار إلى الإنترنت في مخطّطات الشّبكة التّوضيحيّة بشكل سحابة تُرسم في وسط المخطّط. أمّا مفهوم الحوسبة السّحابيّة فيعني نقل عمليّات المعالجة والحساب والتّخزين (الّتي اعتدنا تنفيذها على حواسيبنا العاديّة سابقًا) إلى طبقة السّحاب (الإنترنت) ثمّ الحصول على نتائج هذه الحوسبة على أجهزتنا. هذا يضمن سعات تخزين أكبر وأداءً أسرع في المعالجة خصوصًا مع البيانات الضّخمة وبهذا تفتح الحوسبة السّحابيّة عالمًا جديدًا بالكامل لأنّها تعطي المستخدمين قدرات فائقة لم يكن من الممكن الحصول على مثيلها قبل عهد الحوسبة السّحابيّة. ليس هذا كلّ شيء، بل إنّ الاعتماد على الحوسبة السّحابيّة يعني تمكّنك من الوصول لبياناتك من أيّ جهاز متوافق فيه وصول للإنترنت (لست بحاجة إلى الاقتصار على جهاز واحد) ويعني أيضًا أنّها محميّة ما دامت المخدّمات موثوقة ومُصانة ضدّ الأعطال والهجمات. المغزى أنّنا نحصل من الحوسبة السّحابيّة على قدرات معالجة وسعات تخزين <strong>كخدمة</strong> لا كمنتج، بمعنى أنّ الشّركات تقدّم لكلّ مستخدم حصّة من موارد المعالجة والتّخزين مع التّطبيقات بدل تقديم منتج.<br>مع الحوسبة السّحابيّة ننتقل إلى تطبيقات سحابيّة، تطبيقات تعالج البيانات على المخدّمات وتخزّنها فيها ثمّ تعطي النّاتج للمستخدمين. في السّابق كنّا ننشئ مستنداتنا على Word، تقوم معالجات أجهزتنا بمعالجتها ثمّ تخزّنها على أقراص صلبة ضمن أجهزتنا الشّخصيّة؛ في الحوسبة السّحابيّة سننشئ مستنداتنا على Google Docs (أو غيرها)، تعالجها مخدّمات Google وتخزّنها.<br>التّطبيق العمليّ للحوسبة السّحابيّة<br>كلّ التّطبيقات تعمل ضمن بيئات محدّدة، وتطبيقات الويب تعمل في بيئة متصفّح الويب. الاعتماد على الحوسبة السّحابيّة مفهومٌ حديث ولعلّ رائد هذا التّحول هو متصفّح Chrome ومن ورائه عملاق الويب Google.<br>أقلّ ما يقال عن Chrome أنّه متصفّح ثوريّ، والحقيقة أنّه ليس متصفّحًا؛ بل هو نظام تشغيل سحابي متكامل: فمع متجر التّطبيقات الخاصّ به، يؤسّس Chrome لمرحلة جديدة كلّيًّا في عالم الحوسبة السّحابيّة؛ افتح متجر التّطبيقات وثبّت ما تشاء من التّطبيقات المجّانيّة واشترِ تطبيقات أخرى... تطبيقات لمئات المهامّ: هذا تطبيق لتحرير المستندات وذلك لتنظيم مواعيدك وآخر يعرض حالة الطّقس ورابع قارئ للكتب وخامس للاستماع للأغاني.<br>ما هي إلّا سنوات قليلة ويصبح متصفّح الويب كافيًا لتنفيذ المهامّ اليوميّة الأساسيّة بغنى عن نظام التّشغيل، أي أنّ متصفّح الويب سيصبح نظام التّشغيل ذاته، وهذه هي فكرة Google Chrome OS الّذي تروّج له Google مع <a href=\"http://www.google.com/chromebook/\">أجهزة Chromebooks</a>، وما هو إلّا متصفّح Chrome مع نواة Linux على جهاز كمبيوتر محمول. اقرأ عن تجربتي لهذا النّظام <a href=\"http://forabi.blogspot.com/2011/08/chromium-os.html\">هنا</a>.<br>سلبيّات الحوسبة السّحابيّة<br>مع كلّ جديد في عالم التّقنيّة، يطول الجدل عن قضايا الخصوصيّة، وأهمّ ما يُناقش في الحوسبة السّحابيّة هو مشاكل الخصوصيّة الّتي تطرحها: فما الّذي يضمن خصوصيّة مستنداتي على مخدّمات الشّركات؟ عندما أحفظ المستندات على جهازي فهذا حتمًا يضمن لي تحكّمًا أوسع في خصوصيّتها؛ ثمّ ماذا عن الحماية؟ ماذا إن تعطّلت مخدّمات شركة ما في ساعة ما فلم أستطع الوصول إلى بياناتي في هذه السّاعة (وهذا حدث وما زال يحدث)؟<br>بالطّبع ستتعرّض هذه التّقنيّات إلى هجوم عنيف من قبل المدافعين عن حرّيّة المصادر من مثل منظّمة البرامج الحرّة، إذ ينتقد Richard Stallman، مؤسّس المنظّمة، نظام Chrome OS بسبب مسائل الخصوصيّة ويقول إن لا شيء جيّدًا فيه سوى اعتماده على نواة Linux (مفتوحة المصدر بمعظم أجزائها).<br>دعك من كلّ هذا: رأيي الشّخصيّ أنّ الخصوصيّة على الويب ضرب من الخيال وإن ما تضيفه إليه لا يُنسى ولا يُمحى، وإنّنا قادمون إلى عصر تنتقل معه حياتنا الرّقميّة إلى السّحاب، شئنا أم أبينا!</p>\n","title":"الحوسبة السّحابيّة","filename":"blog-post.json","id":"blog-post","date":"2012-01-10T00:00:00.000Z","image":null,"description":"حياتنا الرّقميّة تتطوّر بسرعة، في البدء كان استخدام الحاسوب محدودًا في المجالات العلميّة واليوم بإمكان هاتف صغير يحمله شابّ أن ينفّذ في ثوانٍ ما كانت حواسيب الأمس تعجز عن تنفيذه في أيّام، في البدء اخترِع الويب وشاع استخدام الإنترنت -بسرعات لا تتعدّى 56 كيلوبت في الثّانية- للحصول على المعلومات في صفحات خالية تقريبًا من الألوان والصّور (أما مقاطع الفيديو على الويب فكانت يومها شيئًا مستحيل الوجود) ثمّ بدأت سرعات الإنترنت بالنّمو وأسعارها بالانخفاض وكان من الطّبيعيّ أن يترافق هذا بظهور صفحات ذات محتوى أغنى (صور أكثر، مقاطع صوت، وحتّى مقاطع فيديو)، وهذا التّطوّر لا بدّ من أن يرافقه لغات برمجة أحدث وقدرات أوسع لمتصفّحات الويب لتستطيع رسم المحتويات بسرعة مناسبة وتلبّي احتياجات الاستخدام. الخلاصة أنّه لا يمكن فصل العمليّتين عن بعضهما: فتطوّر محتوى الصّفحات وتطوّر متصفّحات الويب متزامنان وكلاهما يؤثّر بالآخر.في السّنوات القليلة الماضية بدأ كلّ شيء بالتّغيّر: لم نعد نزور \"صفحات\" ويب تقليديّة، بل أصبحنا نستعمل \"تطبيقات\" ويب. التّطبيق ليس مجرّد صفحة كتب فيها بعض النّصوص وأُضيفَ إليها بعض الصّور، بل هو تطبيق كأيّ تطبيق تثبّته على جهازك وفيه القدرة على تنفيذ المهام وليس فقط عرض المعلومات، ولعلّ الميزة الثّانية المهمّة في التّطبيقات هي القدرة على التّخصيص بما يناسب احتياجات المستخدم.ماذا يعني هذا؟ الأمثلة ستوضّح أكثر: ما البرنامج الّذي تستعمله لكتابة المستندات وطباعته؟ لنقل إنّه Microsoft Word. شخصيًّا أستعمل Google Docs وهو تطبيق ويب يؤدّي نفس المهمّة بالضّبط (وإن تفاوتت القدرات). كلّ ما عليك أن تزور http://docs.google.com وتسجّل دخولك ثمّ تنشئ مستندًا جديدًا وتبدأ بالكتابة والتّنسيق وترقيم الصّفحات وإضافة الألوان والصّور والرّوابط، ثمّ إذا انتهيت يمكنك طباعته؛ ويُحفظ الملفّ على أجهزة Google بحسابك الّذي تستخدمه في Gmail ويمكنك الرّجوع إليه وتعديله طالما توفّر لديك الاتّصال بالإنترنت. بالطّبع Google Docs هو واحد من هذه التّطبيقات ويمكنك استعمال تطبيقات أخرى مثل Office Live من Microsoft أو غيره. ويمكن القول إنّ في تطبيقات الويب هذه ما يميّزها عن التّطبيقات التّقليديّة كخواصّ المشاركة مع الأصدقاء وسعات التّخزين.هذا كان مثالاً واحدًا، لكنْ لا تقتصر تطبيقات الويب على تحرير المستندات بالطّبع، فهناك تطبيقات ويب لترتيب المهام وتطبيقات التقويم وألعاب وتطبيقات تعليم اللّغات والكثير غيرها. ما يثير حماسي أنّ كلّ هذا حدث في فترة قصيرة وهذا يعطي فكرة عن التّطوّر الّذي سنشهده في السّنوات العشر القادمة.مفهوم الحوسبة السّحابيّةعادة يُشار إلى الإنترنت في مخطّطات الشّبكة التّوضيحيّة بشكل سحابة تُرسم في وسط المخطّط. أمّا مفهوم الحوسبة السّحابيّة فيعني نقل عمليّات المعالجة والحساب والتّخزين (الّتي اعتدنا تنفيذها على حواسيبنا العاديّة سابقًا) إلى طبقة السّحاب (الإنترنت) ثمّ الحصول على نتائج هذه الحوسبة على أجهزتنا. هذا يضمن سعات تخزين أكبر وأداءً أسرع في المعالجة خصوصًا مع البيانات الضّخمة وبهذا تفتح الحوسبة السّحابيّة عالمًا جديدًا بالكامل لأنّها تعطي المستخدمين قدرات فائقة لم يكن من الممكن الحصول على مثيلها قبل عهد الحوسبة السّحابيّة. ليس هذا كلّ شيء، بل إنّ الاعتماد على الحوسبة السّحابيّة يعني تمكّنك من الوصول لبياناتك من أيّ جهاز متوافق فيه وصول للإنترنت (لست بحاجة إلى الاقتصار على جهاز واحد) ويعني أيضًا أنّها محميّة ما دامت المخدّمات موثوقة ومُصانة ضدّ الأعطال والهجمات. المغزى أنّنا نحصل من الحوسبة السّحابيّة على قدرات معالجة وسعات تخزين كخدمة لا كمنتج، بمعنى أنّ الشّركات تقدّم لكلّ مستخدم حصّة من موارد المعالجة والتّخزين مع التّطبيقات بدل تقديم منتج.مع الحوسبة السّحابيّة ننتقل إلى تطبيقات سحابيّة، تطبيقات تعالج البيانات على المخدّمات وتخزّنها فيها ثمّ تعطي النّاتج للمستخدمين. في السّابق كنّا ننشئ مستنداتنا على Word، تقوم معالجات أجهزتنا بمعالجتها ثمّ تخزّنها على أقراص صلبة ضمن أجهزتنا الشّخصيّة؛ في الحوسبة السّحابيّة سننشئ مستنداتنا على Google Docs (أو غيرها)، تعالجها مخدّمات Google وتخزّنها.التّطبيق العمليّ للحوسبة السّحابيّةكلّ التّطبيقات تعمل ضمن بيئات محدّدة، وتطبيقات الويب تعمل في بيئة متصفّح الويب. الاعتماد على الحوسبة السّحابيّة مفهومٌ حديث ولعلّ رائد هذا التّحول هو متصفّح Chrome ومن ورائه عملاق الويب Google.أقلّ ما يقال عن Chrome أنّه متصفّح ثوريّ، والحقيقة أنّه ليس متصفّحًا؛ بل هو نظام تشغيل سحابي متكامل: فمع متجر التّطبيقات الخاصّ به، يؤسّس Chrome لمرحلة جديدة كلّيًّا في عالم الحوسبة السّحابيّة؛ افتح متجر التّطبيقات وثبّت ما تشاء من التّطبيقات المجّانيّة واشترِ تطبيقات أخرى... تطبيقات لمئات المهامّ: هذا تطبيق لتحرير المستندات وذلك لتنظيم مواعيدك وآخر يعرض حالة الطّقس ورابع قارئ للكتب وخامس للاستماع للأغاني.ما هي إلّا سنوات قليلة ويصبح متصفّح الويب كافيًا لتنفيذ المهامّ اليوميّة الأساسيّة بغنى عن نظام التّشغيل، أي أنّ متصفّح الويب سيصبح نظام التّشغيل ذاته، وهذه هي فكرة Google Chrome OS الّذي تروّج له Google مع أجهزة Chromebooks، وما هو إلّا متصفّح Chrome مع نواة Linux على جهاز كمبيوتر محمول. اقرأ عن تجربتي لهذا النّظام هنا.سلبيّات الحوسبة السّحابيّةمع كلّ جديد في عالم التّقنيّة، يطول الجدل عن قضايا الخصوصيّة، وأهمّ ما يُناقش في الحوسبة السّحابيّة هو مشاكل الخصوصيّة الّتي تطرحها: فما الّذي يضمن خصوصيّة مستنداتي على مخدّمات الشّركات؟ عندما أحفظ المستندات على جهازي فهذا حتمًا يضمن لي تحكّمًا أوسع في خصوصيّتها؛ ثمّ ماذا عن الحماية؟ ماذا إن تعطّلت مخدّمات شركة ما في ساعة ما فلم أستطع الوصول إلى بياناتي في هذه السّاعة (وهذا حدث وما زال يحدث)؟بالطّبع ستتعرّض هذه التّقنيّات إلى هجوم عنيف من قبل المدافعين عن حرّيّة المصادر من مثل منظّمة البرامج الحرّة، إذ ينتقد Richard Stallman، مؤسّس المنظّمة، نظام Chrome OS بسبب مسائل الخصوصيّة ويقول إن لا شيء جيّدًا فيه سوى اعتماده على نواة Linux (مفتوحة المصدر بمعظم أجزائها).دعك من كلّ هذا: رأيي الشّخصيّ أنّ الخصوصيّة على الويب ضرب من الخيال وإن ما تضيفه إليه لا يُنسى ولا يُمحى، وإنّنا قادمون إلى عصر تنتقل معه حياتنا الرّقميّة إلى السّحاب، شئنا أم أبينا!","images":0,"videos":0,"tracks":0,"links":3,"type":"text","page":2},{"html":"<h1 id=\"-3-\">يوم في حياة طالب جامعي (3) - الثلاثاء مملّ كبقيّة أيّام الأسبوع</h1>\n<p>7:15 ص - منبّه الهاتف يدعوني للنّهوض، أبحث عن الهاتف بيدي، أجده، أفتح عينًا، أمسح زرّ التأجيل على الشّاشة، هكذا أكسب ربع ساعة إضافيّة من النّوم.7:30 ص - منبّه الهاتف مرّة ثانية، أنهض هذه المرّة بتثاقل لأغسل وجهي ثمّ أغيّر ثيابي، وأنا أبحث عن أغراضي أكتشف أنّني سأتأخّر على صديقي الّذي ينتظرني عند باب البيت. أين الصّينيّة؟ القبضة؟ لا هذه ليست القبضة... يبدو أنّني تركتها خارج علبتها... سأبحث عن الأسنان... ها هي القبضة... أين الأسنان؟ أبحث في كلّ الغرف...<br>7:35 ص - ما زلت أبحث، هذه المرّة عن اللّفحة والجوارب. صديقي يتّصل، لا أردّ.<br>7:40 ص - صديقي يتّصل ثانيةً. لا أردّ.<br>7.45 ص - خرجت من المنزل، هل نسيت شيئًا؟ لا أظنّ. أسلّم على صديقي ونمضي معًا.<br>8:00 ص - قطعنا نصف الطريق... أنظر إلى صديقي: يبدو أنّني نسيت لباس المختبر! ما العمل؟ إن عدت سأتأخّر، إذًا من الأفضل أن أتّصل بصديق آخر وأطلب منّه أن يجلب معه ثوبًا احتياطيًّا لديه. أفعلُ هذا.<br>8:20 ص - وصلنا إلى الكلّيّة. جوّ المقابر ذاته، أتّجه إلى خزنتي، بصعوبة بالغة أتمكّن من فتح القفل... ألبس ثوب المختبر وآخذ صينيّة الأدوات معي وأصعد بسرعة إلى المختبر.<br>في أثناء الجلسة يخبرني المشرف بأنّ سنبلة العمل خشنة، والقبضة بحاجة إلى صيانة، دعك من أنّ المحرّك على طاولتك نصف معطّل. أقول لنفسي: &quot;ضع في ذهنك: عليك أن تصلح القبضة وتشتري سنابل جديدة وتنتقل إلى طاولة أخرى في الجلسة القادمة، إيّاك أن تنسى!&quot;، طبعًا سأنسى.<br>9:00 ص - منذ قليل بدأت العمل، لا تسألني هل سينجح... لا أعرف ولست مهتمًّا كثيرًا؛ أحيانًا أسأل نفسي: ماذا أفعل هنا تحديدًا؟<br>10:00 ص - أتنفّس الصّعداء... لقد انتهت الجلسة، وأصبحت حرًّا طليقًا! أسرع إلى خزنتي: صرت الآن معتادًا على طريقة فتح قفلها: آخذ مسافة أمان، أُخلي دائرة قطرها متر ثمّ أشمّر عن ساعدي وأسمّي الله وأبذل قوّتي ليُفتح بإذن الله. هكذا تكون الحياة! هناك أيضًا من ينتظرني لأنتهي من إعادة أدواتي لكي يفتح خزنته التي تقع تحت خزنتي أنا بالذّات! عليّ أيضًا أن أعتذر له لأنّهم اختاروا لي هذه الخزنة. كلّ شيء من حولي يصرّ على أن يزعجني.<br>11:15 ص - أنا في البيت لا ألوي على شيء. الخيارات الأساسيّة المتاحة أمامي: النّوم والإنترنت والدّراسة (مستبعدة جدًّا).<br>هكذا تمضي أيّام الثّلاثاء مملّة كئيبة، وقد تقطع الكهرباء فتزيدها لياليها ظلمة. خلال هذه السّاعات أتوصّل إلى نتيجة عامّة: الملل مصطلح يطلق على شعورك عندما تكون مستيقظًا! ألا توافقني؟</p>\n","title":"يوم في حياة طالب جامعي (3) - الثلاثاء مملّ كبقيّة أيّام الأسبوع","filename":"3.json","id":"3","date":"2011-12-13T00:00:00.000Z","image":null,"description":"7:15 ص - منبّه الهاتف يدعوني للنّهوض، أبحث عن الهاتف بيدي، أجده، أفتح عينًا، أمسح زرّ التأجيل على الشّاشة، هكذا أكسب ربع ساعة إضافيّة من النّوم.7:30 ص - منبّه الهاتف مرّة ثانية، أنهض هذه المرّة بتثاقل لأغسل وجهي ثمّ أغيّر ثيابي، وأنا أبحث عن أغراضي أكتشف أنّني سأتأخّر على صديقي الّذي ينتظرني عند باب البيت. أين الصّينيّة؟ القبضة؟ لا هذه ليست القبضة... يبدو أنّني تركتها خارج علبتها... سأبحث عن الأسنان... ها هي القبضة... أين الأسنان؟ أبحث في كلّ الغرف...7:35 ص - ما زلت أبحث، هذه المرّة عن اللّفحة والجوارب. صديقي يتّصل، لا أردّ.7:40 ص - صديقي يتّصل ثانيةً. لا أردّ.7.45 ص - خرجت من المنزل، هل نسيت شيئًا؟ لا أظنّ. أسلّم على صديقي ونمضي معًا.8:00 ص - قطعنا نصف الطريق... أنظر إلى صديقي: يبدو أنّني نسيت لباس المختبر! ما العمل؟ إن عدت سأتأخّر، إذًا من الأفضل أن أتّصل بصديق آخر وأطلب منّه أن يجلب معه ثوبًا احتياطيًّا لديه. أفعلُ هذا.8:20 ص - وصلنا إلى الكلّيّة. جوّ المقابر ذاته، أتّجه إلى خزنتي، بصعوبة بالغة أتمكّن من فتح القفل... ألبس ثوب المختبر وآخذ صينيّة الأدوات معي وأصعد بسرعة إلى المختبر.في أثناء الجلسة يخبرني المشرف بأنّ سنبلة العمل خشنة، والقبضة بحاجة إلى صيانة، دعك من أنّ المحرّك على طاولتك نصف معطّل. أقول لنفسي: \"ضع في ذهنك: عليك أن تصلح القبضة وتشتري سنابل جديدة وتنتقل إلى طاولة أخرى في الجلسة القادمة، إيّاك أن تنسى!\"، طبعًا سأنسى.9:00 ص - منذ قليل بدأت العمل، لا تسألني هل سينجح... لا أعرف ولست مهتمًّا كثيرًا؛ أحيانًا أسأل نفسي: ماذا أفعل هنا تحديدًا؟10:00 ص - أتنفّس الصّعداء... لقد انتهت الجلسة، وأصبحت حرًّا طليقًا! أسرع إلى خزنتي: صرت الآن معتادًا على طريقة فتح قفلها: آخذ مسافة أمان، أُخلي دائرة قطرها متر ثمّ أشمّر عن ساعدي وأسمّي الله وأبذل قوّتي ليُفتح بإذن الله. هكذا تكون الحياة! هناك أيضًا من ينتظرني لأنتهي من إعادة أدواتي لكي يفتح خزنته التي تقع تحت خزنتي أنا بالذّات! عليّ أيضًا أن أعتذر له لأنّهم اختاروا لي هذه الخزنة. كلّ شيء من حولي يصرّ على أن يزعجني.11:15 ص - أنا في البيت لا ألوي على شيء. الخيارات الأساسيّة المتاحة أمامي: النّوم والإنترنت والدّراسة (مستبعدة جدًّا).هكذا تمضي أيّام الثّلاثاء مملّة كئيبة، وقد تقطع الكهرباء فتزيدها لياليها ظلمة. خلال هذه السّاعات أتوصّل إلى نتيجة عامّة: الملل مصطلح يطلق على شعورك عندما تكون مستيقظًا! ألا توافقني؟","images":0,"videos":0,"tracks":0,"links":0,"type":"text","page":2},{"html":"<h1 id=\"-2-\">حياة طالب جامعيّ (2) - فلسفة</h1>\n<p>أمضى آخر أسبوع ينام باكرًا ويستيقظ في الصّباح، في محاولة منه للتّكيّف مع دوام الجامعة؛ لكنّه قرّر أن يسهر في أوّل يوم من العام الجامعيّ، لا يعرف السّبب... ربّما تحتاج ساعته البيولوجيّة لإصلاح!<br>تعوّد أن لا دوام في أوّل أسبوعين من العام، هذا عرفٌ اتّفق عليه الطّلاب منذ فجر البشريّة، منذ بداية التّدريس بالأحرى. الطّلّاب هم من يحدّدون الدّوام: إن لم يحضر أحد، فلا دوام... فلماذا يحضرون؟! هذه غريزة حبّ الدّوام، يومًا ما سيعدّ بحثًا حول هذا الموضوع.<br>أمضى أسبوعين في البيت يأكل وينام ويكتب ويقرأ كلّ شيء. ولأنّه متميّز ولأنّ وقته ثمين، فليس من المعقول أن يبدأ الدّوام من بداية الأسبوع الثّالث، سينتظر حتّى يقرّر الطّلاب أنّهم بدؤوا ثمّ يبدأ؛ وهكذا يعطي لنفسه يومين إضافيّين من الرّاحة.<br>في اليوم الثّالث من الأسبوع، سيبدأ دوامه. لم ينم في اللّيل لأنّه يدرك أنّه إن نام سيفوته الدّوام. هكذا يمضي اللّيل يقرأ حتّى يأتيَ الصّباح فيغيّر ثيابه وينطلق. اتّفق مع صديقيه أن يذهبوا معًا.<br>كلّما رأى صديقه تساءل كيف أصبحا صديقين؟ هذا يحبّ الدّراسة ويودّ لو أنّ الدّوام يبدأ في السّاعة السّادسة صباحًا، أمّا هو فيكره الدّوام والجامعة وكلّ شيء ويتمنّى لو اختفت الكلّيّة أو سافر عبر الزّمن لينهي دراسته أو -في أحسن الأحوال- حياته.<br>يقول لنفسه في الطّريق: لا بأس، سيكون يومًا قصيرًا.<br>يصل مع صديقيه إلى باب الكلّيّة ويشعر أنّه يدخل مقبرة، الجو هنا يشبه المقابر باستثناء أنّهم يتكلّفون الحياة كي لا يظهروا كالموتى. شعور بالخوف والانقباض وفراغ وصمت، أشجار ومقاعد قديمة... لو زرتها ليلاً لقلت إنّها مقبرة.<br>عزاؤه الوحيد في هذه المقبرة أن يرى أصدقاء المدرسة وقد أصبحوا معه، لكنّه يحزن لأنّهم تخلّفوا عنه بعام كامل.<br>يسأل نفسه: هل الحجاب هو قطعة من قماش توضع على الرّأس لكي يُقال عمّن تضعها أنّها محجّبة؟ أصبح الحجاب (بهذا التّعريف) شيئًا والاحتشام شيء آخر، الأوّل فرض والثّاني مكروه على ما يبدو.<br>يمضي إلى المختبر وهو يعرف أنّ عليه أن يتنازل عن ربع ساعة من حياته في كلّ مرّة ينتظر فيها قدوم المشرف. يتساءل: هل هذا طبيعيّ؟ هل تأخّر كلّ مشرف ربع ساعة من الأمور الطّبيعيّة؟ هل خُلقَ الإنسان يتأخّر عن مواعيده؟ ما الفائدة إذًا من تحديد الموعد قبل ربع ساعة من الحضور؟<br>المشرف يشرح خطوط الإنهاء وزوايا التّحضير وأنواع الإكريل والسّنابل الماسّية والشّرائط المُسندة؛ هذا جميل ومفهوم... يقول لنفسه، لكنّ سؤالاً يلحّ في ذهنه: ما الفائدة من معرفة هذه الأمور؟ عندها يتذكّر أنّه سيصبح طبيب أسنان، وأنّ طبيب الأسنان يعالج أسنان النّاس، وعلاج أسنانهم يسمح لهم بمتابعة أعمالهم لكي يعمّروا الأرض إلى أن يموتوا ويُحاسبوا. اقتنع بهذا الجواب.<br>لاحظ أنّه يسأل نفسه كثيرًا.<br>يتنفّس الصّعداء عندما يسمع المشرف يقول &quot;انتهينا&quot;، هذه هي كلمة السّرّ، الّتي إن سمعها شعر بشيء من الارتياح.<br>بعدها يدخل مختبر النُّسج، المشرفة تُعيد ما تعلّمه في السّنة الماضية، هذا يعني أنّه يخسر ساعتين إضافيّتين من حياته في إعادة ما يعرفه.<br>&quot;انتهينا&quot; مرّة ثانية، يُسرع في الخروج، يخسر نصف ساعة من وقته إلى أن تبدأ الجلسة التّالية، بعدها يستمع إلى المشرف يتّحدّث عن الدّم ومكوّناته، الكريّات الحمراء والكريّات البيضاء وغيرها... هذا سُخف، لن يضيع وقته في سماعه، لكن لا مفرّ!<br>&quot;انتهينا&quot; مرّة ثالثة.<br>يحمد الله ويعود للبيت، ويخسر 5 ساعات من حياته نائمًا. لكنّه يسأل نفسه لآخر مرّة: هل يستحقّ ما تعلّمه اليوم أن يخسر من وقته ما خسره في هذا اليوم؟</p>\n","title":"حياة طالب جامعيّ (2) - فلسفة","filename":"2.json","id":"2","date":"2011-10-13T00:00:00.000Z","image":null,"description":"أمضى آخر أسبوع ينام باكرًا ويستيقظ في الصّباح، في محاولة منه للتّكيّف مع دوام الجامعة؛ لكنّه قرّر أن يسهر في أوّل يوم من العام الجامعيّ، لا يعرف السّبب... ربّما تحتاج ساعته البيولوجيّة لإصلاح!تعوّد أن لا دوام في أوّل أسبوعين من العام، هذا عرفٌ اتّفق عليه الطّلاب منذ فجر البشريّة، منذ بداية التّدريس بالأحرى. الطّلّاب هم من يحدّدون الدّوام: إن لم يحضر أحد، فلا دوام... فلماذا يحضرون؟! هذه غريزة حبّ الدّوام، يومًا ما سيعدّ بحثًا حول هذا الموضوع.أمضى أسبوعين في البيت يأكل وينام ويكتب ويقرأ كلّ شيء. ولأنّه متميّز ولأنّ وقته ثمين، فليس من المعقول أن يبدأ الدّوام من بداية الأسبوع الثّالث، سينتظر حتّى يقرّر الطّلاب أنّهم بدؤوا ثمّ يبدأ؛ وهكذا يعطي لنفسه يومين إضافيّين من الرّاحة.في اليوم الثّالث من الأسبوع، سيبدأ دوامه. لم ينم في اللّيل لأنّه يدرك أنّه إن نام سيفوته الدّوام. هكذا يمضي اللّيل يقرأ حتّى يأتيَ الصّباح فيغيّر ثيابه وينطلق. اتّفق مع صديقيه أن يذهبوا معًا.كلّما رأى صديقه تساءل كيف أصبحا صديقين؟ هذا يحبّ الدّراسة ويودّ لو أنّ الدّوام يبدأ في السّاعة السّادسة صباحًا، أمّا هو فيكره الدّوام والجامعة وكلّ شيء ويتمنّى لو اختفت الكلّيّة أو سافر عبر الزّمن لينهي دراسته أو -في أحسن الأحوال- حياته.يقول لنفسه في الطّريق: لا بأس، سيكون يومًا قصيرًا.يصل مع صديقيه إلى باب الكلّيّة ويشعر أنّه يدخل مقبرة، الجو هنا يشبه المقابر باستثناء أنّهم يتكلّفون الحياة كي لا يظهروا كالموتى. شعور بالخوف والانقباض وفراغ وصمت، أشجار ومقاعد قديمة... لو زرتها ليلاً لقلت إنّها مقبرة.عزاؤه الوحيد في هذه المقبرة أن يرى أصدقاء المدرسة وقد أصبحوا معه، لكنّه يحزن لأنّهم تخلّفوا عنه بعام كامل.يسأل نفسه: هل الحجاب هو قطعة من قماش توضع على الرّأس لكي يُقال عمّن تضعها أنّها محجّبة؟ أصبح الحجاب (بهذا التّعريف) شيئًا والاحتشام شيء آخر، الأوّل فرض والثّاني مكروه على ما يبدو.يمضي إلى المختبر وهو يعرف أنّ عليه أن يتنازل عن ربع ساعة من حياته في كلّ مرّة ينتظر فيها قدوم المشرف. يتساءل: هل هذا طبيعيّ؟ هل تأخّر كلّ مشرف ربع ساعة من الأمور الطّبيعيّة؟ هل خُلقَ الإنسان يتأخّر عن مواعيده؟ ما الفائدة إذًا من تحديد الموعد قبل ربع ساعة من الحضور؟المشرف يشرح خطوط الإنهاء وزوايا التّحضير وأنواع الإكريل والسّنابل الماسّية والشّرائط المُسندة؛ هذا جميل ومفهوم... يقول لنفسه، لكنّ سؤالاً يلحّ في ذهنه: ما الفائدة من معرفة هذه الأمور؟ عندها يتذكّر أنّه سيصبح طبيب أسنان، وأنّ طبيب الأسنان يعالج أسنان النّاس، وعلاج أسنانهم يسمح لهم بمتابعة أعمالهم لكي يعمّروا الأرض إلى أن يموتوا ويُحاسبوا. اقتنع بهذا الجواب.لاحظ أنّه يسأل نفسه كثيرًا.يتنفّس الصّعداء عندما يسمع المشرف يقول \"انتهينا\"، هذه هي كلمة السّرّ، الّتي إن سمعها شعر بشيء من الارتياح.بعدها يدخل مختبر النُّسج، المشرفة تُعيد ما تعلّمه في السّنة الماضية، هذا يعني أنّه يخسر ساعتين إضافيّتين من حياته في إعادة ما يعرفه.\"انتهينا\" مرّة ثانية، يُسرع في الخروج، يخسر نصف ساعة من وقته إلى أن تبدأ الجلسة التّالية، بعدها يستمع إلى المشرف يتّحدّث عن الدّم ومكوّناته، الكريّات الحمراء والكريّات البيضاء وغيرها... هذا سُخف، لن يضيع وقته في سماعه، لكن لا مفرّ!\"انتهينا\" مرّة ثالثة.يحمد الله ويعود للبيت، ويخسر 5 ساعات من حياته نائمًا. لكنّه يسأل نفسه لآخر مرّة: هل يستحقّ ما تعلّمه اليوم أن يخسر من وقته ما خسره في هذا اليوم؟","images":0,"videos":0,"tracks":0,"links":0,"type":"text","page":2},{"html":"<h1 id=\"-facebook-\">جديد Facebook وقوائمه</h1>\n<p>لم يستغرق الأمر سوى بضعة أسابيع <a href=\"http://www.it-scoop.com/2011/09/facebook-google-plus/\">ليضيف خلالها Facebook معظم خصائص Google+</a>. الأمر لم يتوقّف هنا، إذ تابع Facebook إضافة ميّزات جديدة، منها إضافة القوائم الجديدة الّتي تشبه كثيرًا دوائر Google+ لكنّها برأيي أفضل!</p>\n<p>القوائم الجديدة في Facebook تقسم إلى نوعيّن: ذكيّة وعاديّة.  </p>\n<p><strong>القوائم الذّكيّة Smart lists</strong> تعدّ تلقائيًّا، مثل قائمة المقيمين في مدينتك، قائمة طلّاب مدرستك، قائمة زملاء العمل، قائمة زملاء الجامعة... هذه القوائم تحدّث كلّما أضاف صديق معلومات جديدة إلى ملفّه الشّخصيّ. مثلاً: في قائمة المقيمين في مدينتك إذا غيّر صديق لك معلومات ملفّه الشّخصيّ ليجعل مكان إقامته الحالي مماثلاً لمدينتك فإنّه يُضاف تلقائيًّا إلى القائمة الموافقة. بالطّبع يمكن إضافة أصدقاء إلى القوائم الذّكيّة بشكل يدويّ، فعندما تضيف أحد أصدقائك إلى قائمة المقيمين في مدينتك، سيرسل إليه تنبيه ليحدّث معلومات ملفّه الشّخصيّ ويضيف المدينة.<br><img src='content/images/screenshot.22.jpg' title='null' text=''/></p>\n<p>قائمة ذكيّة للمقيمين في مدينتي، فيها كلّ من حدّد حماه مكان إقامته الحاليّ في معلوماته الشّخصيّة، ويُضاف إليها من يفعل هذا لاحقًا أو من أضيفه يدويًّا.</p>\n<p>أمّا <strong>القوائم العادّيّة</strong>، فأنت من ينشؤها ويضيف الأصدقاء إليها ولا تحدّث تلقائيًّا. مثل قائمة الأصدقاء المغتربين أو قائمة المعارف...  </p>\n<p>عندما تتصفّح قائمة معيّنة تظهر فقط مشاركات أعضائها في وسط الشّاشة، للاطّلاع على أخبار العائلة مثلاً، انقر على قائمة العائلة وستختفي مشاركات الاًصدقاء والصّفحات خارج قائمة العائلة. قائمة العائلة ذكيّة يُضاف إليها تلقائيًّا إخوتك وأقاربك الّذين تحدّدهم لدى تعديل الملفّ الشّخصيّ.<img src='content/images/screenshot.24.jpg' title='null' text=''/></p>\n<p>هنا يمكنك تحديد العائلة والأقارب وسيضافون إلى قائمة العائلة تلقائيًّا.</p>\n<p>يمكنك أن تشارك منشوراتك مع قائمة واحدة أو مع كلّ الأصدقاء أو مع كلّ الأصدقاء دون المعارف أو مع كلّ العالم (Public).</p>\n<p>لنقل مثلاً إنّني أريد أن أسأل أصدقائي في الجامعة عن موعد بدء الدّوام، كلّ ما عليّ فعله هو أن أختار قائمة أصدقاء الجامعة من جانب الصّفحة الرّئيسيّة ثمّ اكتب في مربّع المشاركة أسألهم عن الدّوام، سيظهر المنشور لكلّ من في القائمة ولا يظهر لغيرهم.<img src='content/images/screenshot.18.jpg' title='null' text=''/></p>\n<p>اختر القائمة المطلوبة من الجانب الأيسر ثمّ انقر عليها واكتب في مربّع المشاركة</p>\n<p>مع مرور الزّمن سيقترح عليك Facebook إضافة أصدقاء آخرين إلى كلّ قائمة، خوارزميّة الاقتراح معقّدة جدًّا فقد تعتمد مثلاً على الكنية (فيقترح عليك إضافة الصّديق إلى قائمة العائلة) أو العمر والإعجابات المشتركة (فيقترح عليك إضافة الصّديق إلى الأصدقاء المقرّبين) أو قلّة الإعجابات المشتركة والتّواصل (فيقترح عليك إضافة الصّديق إلى المعارف).</p>\n<p><img src='content/images/screenshot.21.jpg' title='null' text=''/></p>\n<p>اقتراحات لإضافة أصدقاء إلى قائمة، تظهر إلى الجانب</p>\n<p>من الخصائص المفيدة أيضًا إمكانيّة تفعيل التّنبيهات في قائمة الأصدقاء المقرّبين، فإذا لم تشأ أن يفوتك أيّ منشور من أصدقائك المقرّبين يمكنك تفعيل التّنبيهات فيها ليصلك تنبيه كلّما نشر أحد أصدقائك المقرّبين منشورًا جديدًا. من ناحيتي قمت بتعطيل هذه التّنبيهات لأنّها كثيرة. لتفعيلها أو تعطيلها انقر على قائمة الأصدقاء المقرّبين فيظهر هذا الزّرّ في أعلى الصّفحة.<br><img src='content/images/screenshot.19.jpg' title='null' text=''/></p>\n<p>تعطيل التّنبيهات أو تفعيلها لقائمة الأصدقاء المقرّبين</p>\n<p>يمكنك أيضًا أن تخفي أنواع معيّنة من المنشورات من كلّ قائمة، لنقل إنّك تريد إخفاء الصّور والفيديو في قائمة المعارف، انقر على قائمة المعارف ليظهر هذا الزّرّ في الأعلى:<img src='content/images/screenshot.25.jpg' title='null' text=''/></p>\n<p>انقر على Choose Update Types...</p>\n<p>انقر على Choose Update Types... فيظهر أنواع المنشورات:<img src='content/images/screenshot.20.jpg' title='null' text=''/></p>\n<p>أزل علامة (صحّ) لإخفاء الأنواع الموافقة من المنشورات</p>\n<p>الأنواع الّتي تخفيها تختفي فقط في هذه القائمة، بينما تبقى ظاهرة في نشرة الأخبار News feed.</p>\n<p>هناك قائمة خاصّة هي قائمة Restricted الّتي يمكنك إضافة صديق إليها لتخفي عنه منشوراتك السّابقة والجديدة ومعلومات ملفّك الشّخصيّ إلى أن تزيله منها، سيظهر ملفّك الشّخصيّ لهذا الصّديق وكأنّه لم يطلب صداقتك بعد، أي سيشاهد فقط معلوماتك العامّة ومنشوراتك العامّة.<img src='content/images/screenshot.23.jpg' title='null' text=''/></p>\n<p>قائمة Restricted مفيدة إذا كنت تشكّ في اختراق حساب أحد أصدقائك وتريد حماية خصوصيّتك إلى أن تتأكذ من هوّيته مثلاً.</p>\n<p>يمكنك إضافة قوائم محدّدة إلى المفضّلة أو إخفائها من مجموعة القوائم الّتي تظهر في جانب الصّفحة، عليك أوّلاً زيارة صفحة القوائم من خلال النّقر على كلمة LISTS أو MORE الّتي تظهر عندما تشير إلى القوائم:<img src='content/images/screenshot.15.jpg' title='null' text=''/></p>\n<p>انقر على الكلمة LISTS أو MORE لمشاهدة كلّ القوائم وإنشاء قائمة جديدة والتّعديل على القوائم الحاليّة</p>\n<p>ثم تظهر القوائم كلّها:<img src='content/images/screenshot.16.jpg' title='null' text=''/></p>\n<p>كلّ القوائم</p>\n<p><img src='content/images/screenshot.17.jpg' title='null' text=''/></p>\n<p>انقر على القائمة المطلوبة واختر ما تريد تنفيذه.</p>\n<p>بعض الأمور الّتي أتمنّى أن تُضاف أيضًا: إمكانيّة تعديل المنشور أو التّعليق كما في Google+، لكنّ الأفضل أن يرسل تنبيه إلى المعلّقين والمعجبين أنّ هذا المنشور تغيّر. أيضًا لا يمكنني حتّى الآن اختيار أكثر من قائمة لأشارك معها في نفس الوقت.<br>رأيي الشّخصيّ أنّ Facebook أصبح سهل الاستخدام كثيرًا بعد جملة التّعديلات والقوائم الجديدة. هذه التّعديلات تضعف فرصة Google+ بالنّجاح بدرجة كبيرة، على Google أن تتدارك الموقف وتجدّد إبداعاتها؛ إن كان لـGoogle+ أن تنجح بعد اليوم فلا بدّ أن دمج بقيّة خدمات Google معها هو ما سيجعلها ناجحة. Google شركة مبدعة ولا تستلم! صحيح أنّ فكرة الدّوائر وطريقة تنظيمها في Google+ أسهل، لكن هذا لا يكفي.</p>\n","title":"جديد Facebook وقوائمه","filename":"facebook.json","id":"facebook","date":"2011-09-20T00:00:00.000Z","image":"content/images/screenshot.22.jpg","description":"لم يستغرق الأمر سوى بضعة أسابيع ليضيف خلالها Facebook معظم خصائص Google+. الأمر لم يتوقّف هنا، إذ تابع Facebook إضافة ميّزات جديدة، منها إضافة القوائم الجديدة الّتي تشبه كثيرًا دوائر Google+ لكنّها برأيي أفضل!","images":11,"videos":0,"tracks":0,"links":1,"type":"text","page":2},{"html":"<h1 id=\"-1-\">حياة طالب جامعيّ (1)</h1>\n<p>السّنة الماضية كانت أسوأ سنواتي بامتياز: طالب بدأ حياته الجامعيّة، أحبّ دراسته الثّانويّة حتّى جاءت دراسة البكالوريا. أقلّ ما توصف به <strong>البكالوريا أنّها الدّرك الأسفل من نار الحياة الدّراسيّة</strong>، والمدرّسون هم شياطينها.</p>\n<p>كيف لمن خرج من الجحيم أن يتمنّى العودة؟ لذا قلت لنفسي: عليك أن تنظر للجامعة على أنّها <strong>جنّة</strong> الطّالب، عليك أن تكون كسولاً كالآخرين، اختلق الأعذار لنفسك ولأهلك وللمحاضرين ولأصدقائك فالكذب سهل، الكذب بحر والصّدق نقطة؛ من الممتع أن تجد عذرًا مُقنعًا في كلّ مرّة تقصّر أو تخطئ.<br>هكذا أصبح اختلاق الأعذار عادةً لديّ، وهذه بعض الأعذار الّتي لا أجد صعوبة في  اختلاقها أو تقديمها عند اللّزوم:  </p>\n<p><strong>تبرير الفشل في الموادّ</strong><br>&quot;المحاضر لا يشرح المادّة&quot; أو &quot;المحاضر يشرح تفاصيل كثيرة&quot;؛ &quot;المحاضر يكرهني&quot;؛ &quot;الأسئلة من خارج المنهاج&quot;؛ &quot;سأطالب بإعادة تصحيح إجاباتي ولن يفعلوا&quot;.  </p>\n<p><strong>تبرير الغياب</strong><br>&quot;الدّوام طويل لذا لن أذهب&quot; أو &quot;الدّوام قصير لذا لن أذهب&quot;؛ &quot;أهتمّ بالقسم العمليّ فقط&quot;؛ &quot;المحاضر مسافر&quot;؛ إن حضر: &quot;أنا مريض&quot;.  </p>\n<p><strong>للتّهرّب من الدّراسة</strong><br>&quot;المعلومات ليست جديدة&quot; أو &quot;المعلومات الجديدة كثيرة&quot;؛ &quot;كنت في الجامعة ولا وقت للدّراسة&quot;.  </p>\n<p><strong>للخروج من المنزل</strong><br>&quot;سأذهب لأدرس مع زميلي فالمادّة صعبة&quot; أو &quot;المادّة سهلة وسأدرسها عندما أعود&quot;؛ &quot;سيعلّمني صديقي كيف أنحت الضّاحك العلويّ&quot; أو &quot;سأعلّم صديقي كيف ينحت النّاب السّفليّ&quot;؛ &quot;سأنسخ فيديو التّشريح من صديقي&quot;؛ &quot;سأنسخ محاضراتٍ تنقصني&quot;؛ &quot;نفد الصّابون&quot;؛ إن كان لديّ صابون: &quot;هذا الصّابون رطب&quot;.  </p>\n<p><strong>للتّسلية</strong><br>&quot;آكل&quot;؛ &quot;أستخدم الكمبيوتر لأنّني أشاهد فيديو للدّكتور يشرح فيه عظام الجمجمة&quot;؛ &quot;أستعين ببرنامج التّشريح لأتعرّف على المصطلحات اللّاتينيّة&quot;؛ &quot;سأشاهد نشرة الأخبار&quot;.  </p>\n<p><strong>تبرير التّخلّف عن الامتحان</strong><br>&quot;لم أستطع أن أدرس المادّة قبل الامتحان&quot; أو &quot;درست المادّة قبل الامتحان بشكل جيّد لكن لا وقت يكفي لمراجعتها&quot;؛ إن كنت مسافرًا: &quot;كنت مسافرًا وعدت متعبًا&quot;؛ إن لم أكن مسافرًا: &quot;الأجواء هنا لا تسمح&quot;.  </p>\n<p>والقائمة تطول...</p>\n<p>أكثر ما يشعر الكسول بالفخر هو أن يتعرّف إلى محاضر المادّة <em>في قاعة الامتحان</em>، فيسأل ببلاهة: أهذا هو محاضر المادّة؟!</p>\n<p>لي عودة!</p>\n","title":"حياة طالب جامعيّ (1)","filename":"1.json","id":"1","date":"2011-09-18T00:00:00.000Z","image":null,"description":"السّنة الماضية كانت أسوأ سنواتي بامتياز: طالب بدأ حياته الجامعيّة، أحبّ دراسته الثّانويّة حتّى جاءت دراسة البكالوريا. أقلّ ما توصف به البكالوريا أنّها الدّرك الأسفل من نار الحياة الدّراسيّة، والمدرّسون هم شياطينها.","images":0,"videos":0,"tracks":0,"links":0,"type":"text","page":2},{"html":"<h1 id=\"-2-dropbox\">إلى السّحابة (2) - Dropbox</h1>\n<p><em>هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.</em><br>هل تملك عدّة حواسيب؟ هل تضطر للاحتفاظ بنسخ متطابقة من بعض الملفّات على جهازين أو أكثر؟ هل تنقلها يدويًّا باستخدام ذاكرة Flash؟ يبدو أنّك تعيش في العصر الحجريّ!<br>لديك حلّان لهذه المشكلة:  </p>\n<ul>\n<li>إمّا أن تربط الأجهزة باستخدام الشّبكة (مثل ميزة Homegroup في Windows) بحيث تحدّد الملفّات الّتي تريد مشاركتها مع بقيّة الأجهزة في بيتك. وهكذا يمكنك الوصول لملفّات جهاز من جهاز آخر. هذه الطّريقة تتطلّب ربط الأجهزة عبر الشّبكة سلكيًّا او لاسكليًّا ولا تحتاج إلى اتّصال بالإنترنت.</li>\n<li>الطّريقة الثّانية الّتي أريد الحديث عنها هي استخدام خدمات مثل Dropbox. هذه الطّريقة تتطلّب اتّصالاً سريعًا بالإنترنت ولكن لا داعي لربط الأجهزة عبر الشّبكة المنزليّة.ما Dropbox؟  </li>\n</ul>\n<p>سأحاول أن أشرح الخدمة ببساطة:</p>\n<ul>\n<li>لديك عدّة أجهزة تعمل بأنظمة تشغيل مختلفة (ومنها هاتف محمول مثلاً) أو متماثلة في بيتك وفي عملك و حتّى في بلد آخر.</li>\n<li>يفضّل تثبيت برنامج Dropbox. مهمّة البرنامج هي إنشاء مجلّد تجده في المستندات أو مجلّد المستخدم. هذا المجلّد تضع فيه الملفّات الّتي تريد مشاركتها مع بقيّة أجهزتك (حتّى مع الهاتف المحمول). قد تكون هذه الملفّات مستندات Word أو ملفّات تثبيت أو صور أو من أيّ نوع آخر.</li>\n<li>عندما تضع هذه الملفّات في المجلّد سيقوم البرنامج برفعها إلى أجهزة شركة Dropbox تلقائيًّا.</li>\n<li>عند انتهاء الرّفع، سيقوم البرنامج بتحميل الملفّات إلى بقيّة الأجهزة بحيث يمكنك الوصول إليها من أيّ جهاز مرتبط. لاحظ أنّه يجب عليك أن تثبّت البرنامج على كلّ أجهزتك.</li>\n<li>معنى هذا أنّه كلّ ما عليك فعله هو إضافة ملفّ إلى مجلّد Dropbox من أي جهاز ليمكنك بعدها مشاهدة هذا الملفّ من بقيّة الأجهزة المرتبطة.</li>\n<li>يمكنك أيضًا أن تشارك ملفّات مع أصدقائك أو مع العالم كلّه بسهولة.Dropbox تعطيك مساحة 2GB مبدئيًّا وبالمجّان، إن أردت المزيد من المساحة فعليك دعوة أصدقائك أو شراء مساحة إضافيّة. الأسعار رخيصة.  </li>\n</ul>\n<p>كيف أستخدمها؟</p>\n<p>اذهب إلى الموقع: <a href=\"http://www.dropbox.com/\">http://www.dropbox.com</a></p>\n<ul>\n<li>إن لم تشا تثبيت البرنامج على كلّ أجهزتك فيمكنك تحميل ورفع الملفّات <a href=\"http://www.dropbox.com/\">عبر الموقع</a> مباشرة. أنشئ حسابًا جديدًا إن لم يكن لديك.</li>\n<li>إن اردت تثبيت البرنامج الّذي يضيف مجلّدًا في المستندات أو في مجلّد المستخدم فلا داعي لإنشاء الحساب الآن، يمكنك إنشاؤه لاحقًا. فقط حمّل البرنامج ثمّ ثبّته. يشرح لك البرنامج كيفيّة العمل، وهي سهلة للغاية.تذكّر: هناك نسخ من البرنامج للهواتف الذّكيّة، وفي حال لم واجهت مشاكل مع البرنامج، فيمكنك دائمًا استخدام الموقع (واجهة Web) كبديل.</li>\n</ul>\n","title":"إلى السّحابة (2) - Dropbox","filename":"2-dropbox.json","id":"2-dropbox","date":"2011-09-15T00:00:00.000Z","image":null,"description":"هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.هل تملك عدّة حواسيب؟ هل تضطر للاحتفاظ بنسخ متطابقة من بعض الملفّات على جهازين أو أكثر؟ هل تنقلها يدويًّا باستخدام ذاكرة Flash؟ يبدو أنّك تعيش في العصر الحجريّ!لديك حلّان لهذه المشكلة:","images":0,"videos":0,"tracks":0,"links":2,"type":"text","page":2},{"html":"<h1 id=\"-1-google-docs\">إلى السّحابة (1) - Google Docs</h1>\n<p><em>هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.</em></p>\n<p>كثيرون يستخدمون مجموعة برامج Microsoft Office التّي تتضمّن Word وPowerPoint وExcel. الحقيقة أنّني لا أفضّل استخدام هذه المجموعة لعدّة أسباب:</p>\n<ol>\n<li>ليست مجّانيّة، ولا تعمل على كلّ الأجهزة.</li>\n<li>معقّدة وفيها خصائص لا أحتاجها.</li>\n<li>وقت تثبيتها طويل، وحجم التّثبيت كبير.</li>\n</ol>\n<p>الحلّ البديل الّذي أستخدمه هو Google Docs، وهي مجموعة تطبيقات ويب (Web apps) تتضمّن محرّر مستندات وعروض تقديميّة وجداول ومخطّطات ورسوم. المجموعة مجّانيّة بالكامل ويكفي لكي تبدأ باستخدامها أن يكون لديك عنوان بريد إلكترونيّ Gmail.  </p>\n<p>من أهمّ مزايا هذه المجموعة:</p>\n<ol>\n<li>سهلة الاستخدام وبسيطة لا تحوي خصائص معقّدة.</li>\n<li>متوافقة مع ملفّات Microsoft Office: فقط ارفع الملفّ!</li>\n<li>يمكن تصدير الملفّات إلى عدّة لواحق منها لواحق Microsoft Office وطباعتها.</li>\n<li>مدقّق إملائيّ عربيّ وإنكليزيّ وغيرهما.</li>\n<li>ميزة ترجمة المستند في ثوانٍ إلى أي لغة تدعمها ترجمة Google.</li>\n<li>إضافة الصّور والرّوابط تمامًا كما في Microsoft Office.</li>\n<li>الملفّات لا تخزّن على جهازك، بل تخزّن على أجهزة Google. هذا يعني إمكانيّة الوصول إليها من أيّ مكان فيه وصول للإنترنت!</li>\n<li>يمكن رفع ملفّات Photoshop وأنواع أخرى من الملفّات لقرائتها (التّعديل غير متاح)</li>\n<li>إذا كنت تستخدم متصفّح Chrome فبإمكانك تفعيل ميزة Offline الّتي تسمح لك بقراءة مستنداتك عند انقطاع الإنترنت.</li>\n<li>يمكن الوصول للمستندات وقراءتها من هاتفك الذّكيّ.</li>\n</ol>\n<p>من عيوبها:</p>\n<p>تحتاج إلى اتّصال بالإنترنت لإنشاء وتعديل المستندات.</p>\n<p>كيف أستخدمها؟</p>\n<p>فقط توجّه إلى <a href=\"http://docs.google.com/\">http://docs.google.com</a>. أدخل عنوان بريدك الإلكترونيّ Gmail وكلمة المرور الموافقة (إن لم يكن لديك، فأنشئ حسابًا جديدًا). بعدها ستشاهد قائمة بمستنداتك (قد تكون فارغة)، وستشاهد أيضًا زرّي &quot;إنشاء&quot; و&quot;رفع&quot;، الأوّل لإنشاء مستند جديد، والآخر لرفع مستند من جهازك وبدء التّعديل عليه أو قراءته من خلال Google Docs.</p>\n","title":"إلى السّحابة (1) - Google Docs","filename":"1-google-docs.json","id":"1-google-docs","date":"2011-09-10T00:00:00.000Z","image":null,"description":"هذه التّدوينة جزء من سلسلة (إلى السّحابة)، وهي سلسلة تساعدك في الانتقال إلى الحوسبة السّحابيّة، أي الانتقال من العمل على برامج تثبّتها على جهازك إلى برامج تعمل ضمن المتصفّح وعبر الإنترنت يمكنك الوصول إليها من كلّ متصفّح حديث.","images":0,"videos":0,"tracks":0,"links":1,"type":"text","page":2},{"html":"<h1 id=\"-\">لمَ أفكّر في حذف حساباتي الاجتماعيّة؟</h1>\n<p>مررت بأسبوع كانت حياتي فيه جحيمًا مطلقًا... أستطيع الآن معرفة كيف يشعر مدمن المخدّرات أو الخمر، هو نفس الشّعور تمامًا، لكنّني أدمنت Facebook وTwitter بدل الخمر والمخدّرات.<br>أن تكون مرهقًا، أن تكون جائعًا، أن تكون عطشان، ثمّ تبقى متسمّرًا أمام صفحة منتظرًا بشوق أن يزداد الرّقم في عدّاد Mentions في Twitter وعدّاد Notifications في Facebook والعناصر غير المقروءة في Google Reader فهذا هو الإدمان (والجنون) عينه.<br>وصلت لمرحلة قُطعت فيها تمامًا عن الأرض، الحديث مع الأصدقاء ورؤيتهم تتمّان عبر الإنترنت؛ الاطّلاع على الأخبار كذلك؛ ربّما الشيء الوحيد الّذي لم أستطيع تحقيقه عبر الإنترنت هو الأكل والشّرب!<br>بعد ذلك، شعرت أنّي حياتي مدمّرة بالكامل... لم أكن كذلك فقد كنت أكثر سعادة وأكثر نشاطًا، ثمّة خطأ في ما أفعله. أحسست أن إنتاجي في كل يوم يتناقص حتّى انعدم أخيرًا.<br>كلّ ما أستطيع قوله أنّني لم أجد راحتي في حياة كهذه، لذا <em>بدأت البحث عن حلّ</em>!  </p>\n<p>في Facebook، كتبت عن نيّتي في حذف حسابي... فبدأت التّعليقات الكثيرة عن السّبب؛ شرحت لهم أنّ الحياة أبسط وأجمل بلا &quot;إعلام اجتماعيّ&quot; وبلا &quot;هواتف ذكيّة&quot;؛ قال أحد أصدقائي أنّني مجنون، والآخر قال لي إنّه توقّع أن يحدث هذا معي! لكنّني وجدت من ينصحني، أحد أصدقائي نصحني بأن أبتعد لشهر عن Facebook، والآخر حكى لي عن تجربته في أيّام العيد بدون وصول للإنترنت وكيف شعر بالرّاحة، وأخي قال لي إنّ المغتربين لا يستطيعون حذف حساباتهم، أمّا أنا فأستطيع.  </p>\n<ol>\n<li>بدأت أبحث عن نصائح لإنتاج أكبر خلال اليوم، وجدت عدّة مقالات. إحدى المقالات تقترح تثبيت إضافة لمنع وصولك إلى موقع محدّد خلال فترة معيّنة من اليوم. بعد تجربتها، وجدت أنّ إضافات مثل هذه لا تفيدني لأنّ باستطاعتي أن أقوم بتعطيل الإضافة بكلّ سهولة!</li>\n<li>بالصّدفة، قرأت مقالة للأستاذ محمّد البدويّ عنوانها <a href=\"http://www.badwi.com/blog/?p=1165\">&quot;الحياة الاجتماعية مع التكنولوجيا تحت الصفر&quot;</a>. أنصح بقرءتها.</li>\n<li><p>وجدت مقالة أخرى عنوانها &quot;<a href=\"http://workawesome.com/productivity/productive-day/\">عشر نصائح ليوم تنتج فيه أكثر</a>&quot;، الحقيقة أنّني لم أنفذ بعد كل ما ورد فيها... لكنّني بدأت بالتّنفيذ. ساحاول تلخيص ما ورد فيها:</p>\n</li>\n<li><p><strong>خطّط ليومك: </strong>التّخطيط مهمّ، ضع قائمة بما تريد أن تنجزه.</p>\n</li>\n<li><strong>حدّد أولويّاتك:</strong> اعرف أيّ أعمالك يجب عليك أن تنجزه أوّلاً.</li>\n<li><strong>استفد من وقت التنقّل والسّفر: </strong>قد تجد سماع الموسيقى في سفرك شيئًا مريحًا، لكنّ الاستماع إلى كتاب صوتيّ أفضل!</li>\n<li><strong>استرح: </strong>ابتعد عن العمل بين فترة وأخرى، الاستراحة تخفّف التّوتر.</li>\n<li><strong>تكيّف: </strong>لا تشتكِ كثيرًا، إذا كان جهازك بطيئًا مثلاً، فعليك أن تأخذ هذا بالحسبان، لا أن تزداد توتّرًا!</li>\n<li><strong>أفد الآخرين: </strong>إذا نجحت، فانصح الآخرين وكن فخورًا.</li>\n<li><strong>لا تتحدّث كثيرًا</strong>: تجنّب الكلام الكثير، والكلام غير المفيد.</li>\n<li><strong>طوّر مواهبك:</strong> قد يفيد تطوير المواهب في إنجاز أعمالك بسرعة.</li>\n<li><strong>راقب تقدّمك: </strong>تابع إنجازاتك وكيف حقّقت أهدافك خلال الشّهور الماضيّة، حدّد ما الّذي فعلته لتنجح، وما الّذي يعيق تقدّمك.</li>\n</ol>\n<p>لدي نصيحة أخرى: المحادثة الفوريّة تقطع أعمالك وتشغلك... إمّا أن تجعل حالتك &quot;مشغول&quot; أو &quot;غير متّصل&quot;... لا بدّ من أحدهما! أمّا إن أردت التّفرغ للمحادثة (وهذا لا أنصح به) فلتحدّد ساعات مخصّصة لذلك خلال اليوم.</p>\n<p>منذ استيقاظي وضعت قائمة مبدئيّة بما يجب أن أنجزه اليوم: زيارة صديقي، تجديد الاشتراك في النّادي، شراء بطاقة للهاتف، الكتابة في <a href=\"http://www.it-scoop.com/2011/09/google-news-4/\">المجلّة التّقنيّة</a>، قراءة القرآن، كتابة مذكّراتي، وأخيرًا كتابة هذه المقالة. ثبتت إضافة <a href=\"https://chrome.google.com/webstore/detail/dmglolhoplikcoamfgjgammjbgchgjdd\">Google Tasks</a> لمتصفّح Chrome، هي إضافة بسيطة وسهلة الاستخدام. الجميل في هذه الإضافة أنّه يمكنك سحب عناصر القائمة وترتيبها لتوافق أولويّاتك، كما يمكنك الوصول لها من هاتفك عبر الإنترنت، وهو أمر مفيد إذا كان عليك إنجاز عمل خارج البيت.</p>\n<p>القائمة ربّما بسيطة وسأزيد من عناصرها كلّ يوم، بالطّبع ما لا أنجزه اليوم سيؤجّل إلى الغد... وهذا يعني تراكم الأعمال إن لم أتدارك الموقف وأعمل بجدّ.</p>\n<p>ربّما لم أستطع إنجاز كلّ ما كتبته في هذه القائمة اليوم، لكن لا بأس... سأراقب تقدّمي خلال الشّهر القادم (عن طريق الاحتفاظ بسجلّ القوائم) إن شاء الله. المهمّ أنّي بدأت وأنا اليوم أكثر سعادة!</p>\n<p>لم أقرّر بعد إذا ما كنت سأحذف حساباتي في الشّبكات الاجتماعيّة، لكنّي وجدت أنّ انشغالي بإنجاز محتويات القائمة أنساني Twitter وFacebook... ربّما أغرّد من ساعة إلى ساعة... لكنّني بالتّأكيد لم أعد أحرق أعصابي في انتظار تعليق أو ردّ! المعنى أنّ استخدامي للشبكة الاجتماعيّة أصبح أقرب إلى وسيلة منه إلى هدف!</p>\n","title":"لمَ أفكّر في حذف حساباتي الاجتماعيّة؟","filename":"blog-post.json","id":"blog-post","date":"2011-09-07T00:00:00.000Z","image":null,"description":"مررت بأسبوع كانت حياتي فيه جحيمًا مطلقًا... أستطيع الآن معرفة كيف يشعر مدمن المخدّرات أو الخمر، هو نفس الشّعور تمامًا، لكنّني أدمنت Facebook وTwitter بدل الخمر والمخدّرات.أن تكون مرهقًا، أن تكون جائعًا، أن تكون عطشان، ثمّ تبقى متسمّرًا أمام صفحة منتظرًا بشوق أن يزداد الرّقم في عدّاد Mentions في Twitter وعدّاد Notifications في Facebook والعناصر غير المقروءة في Google Reader فهذا هو الإدمان (والجنون) عينه.وصلت لمرحلة قُطعت فيها تمامًا عن الأرض، الحديث مع الأصدقاء ورؤيتهم تتمّان عبر الإنترنت؛ الاطّلاع على الأخبار كذلك؛ ربّما الشيء الوحيد الّذي لم أستطيع تحقيقه عبر الإنترنت هو الأكل والشّرب!بعد ذلك، شعرت أنّي حياتي مدمّرة بالكامل... لم أكن كذلك فقد كنت أكثر سعادة وأكثر نشاطًا، ثمّة خطأ في ما أفعله. أحسست أن إنتاجي في كل يوم يتناقص حتّى انعدم أخيرًا.كلّ ما أستطيع قوله أنّني لم أجد راحتي في حياة كهذه، لذا بدأت البحث عن حلّ!","images":0,"videos":0,"tracks":0,"links":4,"type":"text","page":2}]