{"html":"<h1 id=\"twitter-facebook-\">Twitter سيصبح Facebook آخر... هذا لا يعجبني!</h1>\n<p>خلال الأسبوع الماضي أجرى Twitter عدّة تعديلات على موقعه الرّسميّ وأعلن عن تعديلات قادمة تجعل منه Facebook جديدًا! وهذا ما يزعجني...</p>\n<p>بدأت باستخدام Twitter منذ أقلّ من عامّ، وأكثر ما أعجبني فيه فكرة المتابعة... بعكس فكرة الصّداقة في Facebook، في Twitter ليس من الضّروريّ أن تعرف شخصيًّا من تتواصل معه... بينما يطلب Facebook منك أن تقبل طلبات الصّداقة ممّن تعرفهم شخصيًّا فقط.</p>\n<p>من خواصّ Twitter الّتي أعجبتني أيضًا أنّك تستطيع الرّدّ على أيّ مستخدم في العالم دون أن يتبعك أو تتبعه، يمكنك التّواصل مع أي أحد دون قيود، ليس عليك أن تنتظر أيّامًا وربمّا سنين إلى أن يقبل Bill Gates طلب صداقتك (لو كنت على Facebook)!</p>\n<p>في Twitter إمّا أن تكون منفتحًا على كلّ العالم، أو منغلقًا تمامًا إلّا على مجموعة متابعيك، وهو برأيي أمر غير مفضّل ولا يظهره موقع Twitter على أنّه أمر إيجابيّ أو خيار مساوٍ لإعدادات الخصوصيّة في Facebook، بل هو خيار لا تلجأ إليه إلا عند الضّرورة، إلّا عندما تكون في خطر الملاحقة مثلاً.</p>\n<p>Twitter مميّز عن غيره، ليس Facebook وليس Google+... هو Twitter بكلّ ما يجعله مميّزًا: الجمل القصيرة وإعادة النّشر (retweet) والمتابعة والقوائم والوسوم المسبوقة بإشارة # والذكر (mention).  </p>\n<p>بعض الإضافات الجديدة أو القادمة إلى Twitter</p>\n<ul>\n<li><strong>مشاركة الصّور والفيديو</strong>، هذه ليست إضافة سيّئة بل يبقى Twitter مميّزًا بأنّ الصّور والفيديو تمضي مع الأخبار ولا تبقى في مجموعات كما في Facebook وGoogle+، كما يمكن البحث فيها على مستوى Twitter كلّه تمامًا كالبحث عن التّغريدات.</li>\n<li>جعل <strong>التغريدات العربيّة</strong> تظهر باتّجاه من اليمين لليسار، وهو أمر جيّد أيضًا وإن كان مربكًا للبعض، وأتمنّى أيضًا أن يضاف دعم الوسوم (hashtags) العربيّة.</li>\n<li><strong>تبويب جديد للنّشاط</strong> (Activity tab) الّذي يشبه آخر الأخبار (News feed) في Facebook: فلان تبع فلانًا، فلان فضّل تغريدة فلان أو ردّ عليها... فلان أعاد نشر تغريدة فلان... أمر لا يعجبني مطلقًا! تصوّري عن Twitter أنّه المكان الأفضل لمتابعة الأخبار لحظة بلحظة، أخبار من كلّ الأنواع: عالميّة أو شخصيّة، زلزال في اليابان أو مرض صديق... فوز فريق على آخر في كرة القدم... مهما يكن، <strong>المهمّ أنّ الأخبار لحظيّة ومنسابة</strong>، الأخبار القديمة تمضي ويصبح من الصّعب الوصول إليها... تعليقات الآخرين أو تفضيلاتهم لن تضايقك ولن تشغلك عن متابعة الأخبار، أمّا مع هذه الإضافة فسيكون لديك شيء جديد قد يشغلك عن الأخبار العالميّة ويجعل علاقتك مع متابعيك شخصيّة أكثر وفيها فضول!</li>\n<li>إضافة إمكانية ذكر المستخدم من خلال صفحة ملفّه الشّخصيّ أو ما سُمّي <strong>Profile Mention</strong>، ميزة جيّدة لكنّها تشبه أن تقوم بالنّشر على حائط أحد أصدقائك على Facebook.</li>\n</ul>\n<p>لكن ما سبب هذه الإضافات؟</p>\n<p>أعتقد أن سبب هذه الإضافات إلى Twitter المنافسة الشّديدة بين الشّبكات الاجتماعيّة، Twitter كان في اتّجاه آخر بعيد عن Facebook، ثمّ جاء Google+ الّذي أراه منافسًا لكليهما، أرادت الشّركة المحافظة على وجودها في سوق الشّبكات الاجتماعيّة وإن كان هذا يعني التّخلّي عمّا يميّزها، وإن كان على حساب رضا بعض مستخدميها.</p>\n<p>سيكون على مبرمجي تطبيقات Twitter تطويرها لتتناسب مع هذه التّعديلات، وخاصّة تطبيقات الجوّال.</p>\n<p>هل سأترك Twitter؟</p>\n<p>لم أقرّر بعد... الآراء الآن بعضها سلبيّ وبعضها إيجابيّ وبعضها حياديّ، لكن ثق تمامًا أنّه <strong>لن يترك Twitter إلّا قليلون</strong>، حتّى من لم تعجبه هذه الإضافات سيبقى يستخدم Twitter.</p>\n<p>الأمر الخطير في الشّبكات الاجتماعيّة أنّك تسجّل في إحداها لأنّها تعجبك... تجري الشّبكة تعديلات فلا تعجبك لكنّك لا تتركها لأنّ علاقاتك بمستخدميها كثيرة وتركك للخدمة سيقطعك عنهم وأنت لا تريد هذا، هنا أنت أمام خيارين: تبقى في الشّبكة مرغمًا أو تغادر أنت وكلّ متابعيك وأصدقائك إلى شبكة جديدة تعجبك -إن وجدت- وهذا مستحيل غالبًا؛ أرى أن معنى هذا أنّ <strong>الشّبكات الاجتماعيّة تملي عليك ما يرغب به مدراؤها وتغيّر اهتماماتك</strong>.</p>\n","title":"Twitter سيصبح Facebook آخر... هذا لا يعجبني!","filename":"twitter-facebook.json","id":"twitter-facebook","date":"2011-08-12T00:00:00.000Z","image":null,"description":"خلال الأسبوع الماضي أجرى Twitter عدّة تعديلات على موقعه الرّسميّ وأعلن عن تعديلات قادمة تجعل منه Facebook جديدًا! وهذا ما يزعجني...","images":0,"videos":0,"tracks":0,"links":0,"type":"text"}