{"html":"<h1 id=\"-ubuntu-\">ما Ubuntu؟</h1>\n<p>Ubuntu نظام تشغيل، مثل Windows وMac. مهمّة نظام التّشغيل هي ببساطة تشغيل الجهاز (كمبيوتر، جوال، حاسب لوحيّ أو حتّى ساعة!). أي التّعامل مع أجزاء الجهاز وتوفير بيئة تشغّل البرامج الّتي تساعدك على إتمام مهامّك. طبعًا لكلّ نظام برامجه الخاصّة ولا يمكن لبرنامج مبنيّ لنظام أن يعمل على نظام آخر إلا إن اصدرت الشّركة المنتجة لهذا البرنامج عدّة نسخ تعمل على عدّة أنظمة (مثل Google Chrome وFirefox).لن أخوض في تفاصيل أنظمة التّشغيل، يمكنك قراءة <a href=\"http://en.wikipedia.org/wiki/Operating_system\">هذه المقالة على ويكيبيديا</a>.  </p>\n<p>لكن ما الذي يجعل Ubuntu مميّزًا عن Windows وMac OS X؟</p>\n<ul>\n<li>Ubuntu أوّلًا نظام تشغيل <strong>حرّ ومفتوح المصد</strong>ر، أيّ أنّه يمكن للمبرمجين دراسة وتعديل ونشر الشيفرة المصدريّة للنّظام والمساهمة بتطويره دون أيّة قيود. هذا الأمر مفيد جدًّا للدّول النّامية إذا باستطاعتها تعديل هذه الأنظمة واستعمالها دون أن تخضع لتبعيّة الشّركات التّقنيّة الكبرى. هذه بالطّبع واحدة فقط من فوائد المصدر المفتوح، ولعلّها الأهمّ.</li>\n<li>ثانيًا، Ubuntu مجّانيّ تمامًا... ليس عليك أن تدفع أيّة رسوم لاستخدامه كما أنّ معظم برامجه مجّانيّة. قد تتساءل الآن &quot;أليس Windows وMac مجّانيّان&quot;، بالطّبع لا، لكنّنا في البلاد العربيّة تعوّدنا على برامج القرصنة الّتي تختلف مسمّياتها، ومنها Crack وPatch وKeygen... لكنّ مهمّتها واحدة وهي تزوير رخصة نسخة النّظام بحيث تبدو وكأنّها أصليّة؛ المهمّ أن Windows وMac من الأنظمة غير المجّانيّة واستعمالها دون دفع سعرها (الذي قد يصل حتّى 10000 ليرة سوريّة) أمر غير شرعيّ وغير أخلاقيّ.</li>\n<li>ثالثًا، أبونتو يستعمل نواة Linux... والنّواة هي الجزء من نظام التّشغيل الّذي يربط قطع الجهاز الملموسة Hardware بالبرامج Software؛ مثّلا: إذا أردت طباعة مستند كتبته ببرنامج محرّر النّصوص، فإنّ النّواة هي ما يوجّه أمر الطّباعة للطّابعة. و<strong>نواة Linux بالذّات تتمتّع بخصائص مميّزة تجعلها أكثر أمنًا وحماية وأكثر مرونة</strong>(حتّى أنّه يمكن استعمالها على الجوّالات، مثل نظام Android). وهي أيضًا مفتوحة المصدر ويساهم آلاف المبرمجين وعدّة شركات في تطويرها.</li>\n<li>أخيرًا، <strong>Ubuntu نظام سهل التّعلّم والاستخدام</strong>... سريع وآمن وله دعم كبير من المجتمع Community.</li>\n<li>قد تكون إحدى أهم دواعي استخدامه هي <strong>عدم تأثّره بفيروسات Windows</strong>... نعم، هذا صحيح! يمكنك وصل ذاكرة الفلاش الّتي استعرتها من صديقك دون تردّد ودون خوف... اطمئن، فلن تعمل هذه الفيروسات الخبيثة على Ubuntu!</li>\n</ul>\n<p>في المقالة القادمة سنتعرّف على كيفيّة تحميل Ubuntu وتثبيته.</p>\n","title":"ما Ubuntu؟","filename":"ubuntu-windows-mac.json","id":"ubuntu-windows-mac","date":"2011-06-20T00:00:00.000Z","image":null,"description":"Ubuntu نظام تشغيل، مثل Windows وMac. مهمّة نظام التّشغيل هي ببساطة تشغيل الجهاز (كمبيوتر، جوال، حاسب لوحيّ أو حتّى ساعة!). أي التّعامل مع أجزاء الجهاز وتوفير بيئة تشغّل البرامج الّتي تساعدك على إتمام مهامّك. طبعًا لكلّ نظام برامجه الخاصّة ولا يمكن لبرنامج مبنيّ لنظام أن يعمل على نظام آخر إلا إن اصدرت الشّركة المنتجة لهذا البرنامج عدّة نسخ تعمل على عدّة أنظمة (مثل Google Chrome وFirefox).لن أخوض في تفاصيل أنظمة التّشغيل، يمكنك قراءة هذه المقالة على ويكيبيديا.","images":0,"videos":0,"tracks":0,"links":1,"type":"text"}