{"html":"<h1 id=\"-ubuntu-\">كيف أُحمّل Ubuntu؟</h1>\n<p>الآن نبدأ بالخطوة العمليّة الأولى، وهي تحميل Ubuntu تمهيدًا لتثبيته.</p>\n<h1 id=\"-\">قبل التّحميل</h1>\n<p>أوّلاً نحتاج إلى اتّصال سريع بالإنترنت لتحميل نسخة Ubuntu، إذ أنّ حجم الملفّ الّذي سنقوم بتحميله يبلغ 700 ميغابايت (نسخة CD)، أمّا نسخة DVD فحجمها أكبر. الفرق بين النّسختين هو أنّ الأخيرة تحوي جميع اللّغات أمّا الأولى فتحوي الإنكليزيّة فقط. أنصح بتحميل نسخة CD لأنّه بإمكانك فيما بعد تحميل ملفّات دعم اللّغة العربيّة دون تحميل ملفّات دعم جميع اللّغات.  </p>\n<h1 id=\"-\">التحميل</h1>\n<ol>\n<li>توجّه إلى هذه الصّفحة: <a href=\"http://www.ubuntu.com/download/ubuntu/download\" title=\"ubuntu.com/download/ubuntu/download\">ubuntu.com/download/ubuntu/download</a>.</li>\n<li>يمكنك هنا الضّغط مباشرة على الزرّ ذي اللّون البرتقالي (Start download)، أو يمكنك تعديل الخيارات. الخيار الأوّل هو الإصدار الّذي تريد تحميله. سيتمّ تحديد آخر إصدار تلقائيًّا، في حال رغبت بتحميل الإصدار الأقدم فاختره من القائمة. معنى LTS هو Long-term support وهي نوع خاص من إصدارات Ubuntu يكون مدعومًا بالتّحديثات الأمنيّة (المجّانيّة، بالطّبع) لفترة أطول من بقيّة الإصدارات، ويكون عادة أكثر استقرارًا من غيره؛ إصدارات LTS تصدر كل سنتين في الشّهر الرّابع. من ناحيتي لم أواجه مشاكل تُذكر مع الإصدارات غير المدعومة لفترة طويلة. لذا أفضّل ترك هذا الخيار كما هو وتحميل آخر إصدار.</li>\n<li>في الخيار الثّاني، اختر ما يوافق بنية معالج جهازك... إن لم تكن تعلم ما هي بنيته... فتابع دون أن تغيّر هذا الخيار.</li>\n<li>سيبدأ الآن تحميل نسخة CD. لتحميل نسخة DVD اضغط Alternative downloads.</li>\n</ol>\n<p><img src='content/images/download-ubuntu.png' title='null' text=''/></p>\n<p>خيارات التّحميل</p>\n<p>ملاحظة: ترقيم إصدار Ubuntu يختلف عن ترقيم إصدارات Mac OS X وWindows، ففي Ubuntu يشير رقم الإصدار إلى تاريخ صدور النّسخة. مثلًا: النّسخة 11.04 صدرت في عام 2011 وفي الشّهر الرّابع. تصدر نسخة جديدة من Ubuntu كلّ ستّة شهور، وعليه فإنّ النّسخة القادمة ستصدر في الشّهر العاشر من هذا العام، ورقم إصدارها 11.10.</p>\n<h1 id=\"-\">ماذا بعد التّحميل؟</h1>\n<p>الملفّ الّي حمّلته هو ملف ذو لاحقة ISO. يمكن حرقه إلى قرص مضغوط (CD أو DVD) باستخدام برنامج نسخ مثل Nero وAshampoo وغيرهما. أو بدون برامج إذا كنت تستعمل Windows 7: كلّ ما عليك القيام به هو النّقر المزدوج على الملفّ المُحمّل ثمّ تظهر نافذة فيها خيارات الحرق. اضغط زرّ Burn أو ما يشبهه بالاسم.</p>\n<p>يمكن أيضًا أن تثبّت Ubuntu بدون حرق الملفّ السّابق، إذ يمكن استعمال برامج لتركيب الأقراص الوهميّة مثل Daemon Tools، وهذا يخصّ طريقة واحدة من التّثبيت سنتعرّف عليها لاحقًا.</p>\n<p>المقالة القادمة تتحدّث عن طرق تثبيت Ubuntu.</p>\n","title":"كيف أُحمّل Ubuntu؟","filename":"ubuntu.json","id":"ubuntu","date":"2011-06-27T00:00:00.000Z","image":"content/images/download-ubuntu.png","description":"الآن نبدأ بالخطوة العمليّة الأولى، وهي تحميل Ubuntu تمهيدًا لتثبيته.","images":1,"videos":0,"tracks":0,"links":1,"type":"image"}