{"html":"<h1 id=\"-ubuntu-\">كيف أُثبِّتُ Ubuntu؟</h1>\n<p>ملاحظة: لم أنهِ هذه المقالة بعد.</p>\n<p>ربّما لا يعلم الكثير من مستخدمي Windows كيفيّة تثبيته، لأنّ Windows يأتي مثبّتًا على معظم الحواسيب، أمّا Ubuntu، فعلى الرّغم من وجود بعض أجهزة Dell وأجهزة من شركات أخرى تأتي به، إلّا أنّ نسبتها قليلة، ولذلك فإنّ الشّركة المطوّرة لـUbuntu (وهي Canonical) تحاول مع كلّ إصدار تحسين برنامج التّثبيت وجعله سهلاً قدر الإمكان؛ وفي الحقيقة فإنّ تثبيت Ubuntu أصبح عمليّة سهلة جدًّا في في آخر إصداراته. سأتحدّث عن عدّة حالات لتثبيت Ubuntu. من الأمور الجيّدة في Ubuntu أنّه يمكنك تثبيته جنبًا إلى جنب مع Windows دون تعارض.  </p>\n<h1 id=\"-windows-ubuntu-windows\">الحالة الأولى: لديك Windows، تريد تثبيت Ubuntu دون إزالة Windows</h1>\n<p>في هذه الحالة، يمكن إتباع واحدة من هاتين الطّريقتين: تثبيت Ubuntu كبرنامج داخل Windowsما معنى هذا؟ هذه خاصيّة جميلة في Ubuntu وهي تعني إمكانيّة تثبيت Ubuntu تمامًا كما تثبّت أيّ برنامج: تشغّل المثبّت، تتبّع مجموعة من الخطوات المشابهة لعمليّة تثبيت بقيّة برامج Windows، يظهر البرنامج في لوحة التّحكّم بحيث يمكنك إزالته فيما بعد عن طريق عمل Uninstall! هذه الميزة مفيدة جدًّا إن لم ترد المخاطرة باحتمال ضياع ملفّاتك نتيجة ارتكاب خطأ أثناء عمليّة تثبيت Ubuntu كنظام كامل. الخلاصة أنّه هذه الطّريقة مضمونة ولن تشكّل أيّة مشكلة لك؛ لذا فإنّي أنصحك باتّباعها إن كانت هذه المرّة الأولى الّتي تستخدم فيها Ubuntu... ولكن لهذه الطّريقة سلبيّة واحدة وهي أنّه، على الرغم من حصولك على التّجربة الكاملة للنّظام، إلّا أنّ الأداء لن يكون ممتازًا كما في الطّريقة الثّانية (تثبيته كنظام كامل). إذًا كل ما عليك فعله هو الدّخول إلى Windows ثمّ حرق القرص ووضعه في السواقة، أو تركيبه على قارئ الأقراص الوهميّة. بعدها سيبدأ برنامج التّثبيت الشّبيه جدًّا ببقيّة البرامج. عليك هنا في الخطوة الأولى من معالج التّثبيت اختيار &quot;ثبّت داخل Windows&quot; أو &quot;Install inside Windows&quot;. في بقيّة الخطوات سيسألك عن اسمك ويطلب منك إدخال كلمة مرور للمستخدم... في النّهاية يطلب منك إعادة التّشغيل. ستظهر قائمة جديدة بعد إعادة التّشغيل تحوي خيارين: Ubuntu وWindows. اختر Ubuntu لمتابعة التّثبيت. إذا رغبت بالعودة إلى Windows اعد التّشغيل من داخل Ubuntu ثمّ اختر Windows من القائمة نفسها.</p>\n<h2 id=\"-ubuntu-windows\">تثبيت Ubuntu كنظام كامل إلى جانب Windows</h2>\n<p>هذه الطّريقة تضمن لك الأداء الكامل للنّظام إلّا أنّها أكثر تعقيدًا، و<strong>إن لم تتّبع هذه الخطوات بدقّة فقد تضيع ملفّاتك ونظام التّشغيل الموجود لديك سابقًا (Windows)</strong>.</p>\n<h1 id=\"-windows-ubuntu-windows\">الحالة الثّانية: لديك Windows، تريد تثبيت Ubuntu وإزالة Windows</h1>\n<h1 id=\"-ubuntu-\">الحالة الثّالثة: تريد تثبيت Ubuntu على جهاز بدون نظام تشغيل</h1>\n<p>الأمر بسيط، بعد حرق الملفّ الّذي قمت بتحميله، ضعه في السّوّاقة وأقلع منه. ستشاهد خطوات شبيهة <a href=\"http://techhamlet.com/2010/05/how-to-install-ubuntu-10-04/\">مصدر الصّور</a></p>\n","title":"كيف أُثبِّتُ Ubuntu؟","filename":"ubuntu_27.json","id":"ubuntu_27","date":"2011-06-27T00:00:00.000Z","image":null,"description":"ملاحظة: لم أنهِ هذه المقالة بعد.","images":0,"videos":0,"tracks":0,"links":1,"type":"text"}